content/python.org
#+TITLE:  python
#+OPTIONS: num:nil
#+STARTUP: overview
* Install
** prerequirement
#+begin_src
sudo apt-get install -y make build-essential libssl-dev zlib1g-dev libbz2-dev \
libreadline-dev libsqlite3-dev wget curl llvm libncurses5-dev libncursesw5-dev \
xz-utils tk-dev libffi-dev liblzma-dev python-openssl git
#+end_src

** install from source code
go to the offical python3.9 site, down the newest version python package, extract it
./configure
make
make test
sudo make install

** create virtualenv
*** virtualenv
virtualenv --python=python3.9 venv
source venv/bin/source
deactivate
*** python3-venv
sudo apt install python3-venv
python3 -m venv django

** pip
pip freeze > requirement.txt
pip install -r requirement.txt
*** ipython
:PROPERTIES:
:ID:       6d672724-4e1f-4691-b6ce-02d77bfa0003
:END:

install ipyton comes error
#+begin_src
  AttributeError: 'PtkHistoryAdapter' object has no attribute '_loaded'
#+end_src
this is because prompt-toolkit version 2 conflict with ipython,
upgrade it with
#+begin_src
  pip install prompt-toolkit --upgrade
#+end_src

* GPU Driver for linux
