content/python.org
** install with apt
:PROPERTIES:
:ID:       83e059c7-2ffb-4c68-99e5-eea5214dc2bb
:END:

Am 2022 May 09, monday I install cuda with apt,
I don't know if this is ready a offer for all, but I still wirte it down
#+begin_src 
sudo apt update
sudo apt upgrade
ubuntu-drivers devices
sudo apt install nvidia-driver-510
reboot
watch  -n 0.1 nvidia-smi 
#+end_src

#+begin_src
sudo apt install zlib1g nvidia-cuda-toolkit
nvcc -V
sudo apt install libcudnn8 libcudnn8-dev
reboot
#+end_src

#+begin_src
  pip install virtualenv 
  python -m virtualenv dlforcvenv
  cd dlforcvenv
  source ./bin/activate
  pip install torch torchvision torchaudio
#+end_src

#+begin_src
  pip install notebook
  python -m jupyter notebook &
  import torch
  torch.cuda.is_available(), torch.backends.cudnn.is_available(), torch.cuda.device_count()
#+end_src

** install  driver 418-server, cuda 10.1, cudnn 7.6.1 
#+begin_src 
1. nouveau to backlist: add following to /etc/modprobe.d/blacklist.conf
   blacklist nouveau
   options nouveau modeset=0
#+end_src
#+begin_src 
2. sudo update-initramfs -u   
   #+end_src
   #+begin_src 
3. sudo apt update
   ubuntu-drivers devices
   sudo apt install nvidia-drivers-418-server
   sudo reboot


   then I will be able to check :   nvidia-smi
#+end_src

#+begin_src 
4. CUDA
   go to [[https://developer.nvidia.com/cuda-toolkit-archive]]
   select CUDA Toolkit 10.1 update 2 to install
   unmark the Drivers in  CUDA installation
#+end_src
#+begin_src 
5. emacs ~/.bashrc
   export PATH="/usr/local/cuda-10.1/bin:$PATH"
   export LD_LIBRARY_PATH="/usr/lcoal/cuda-10.1/lib64:$LD_LIBRARY_PATH"
   source ~/.bashrc
#+end_src
#+begin_src 
6. check CUDA
   cd /usr/local/cuda-10.1/samples/1_Utilities/deviceQuery
   sudo make
   ./deviceQuery

   OK if Result = PASS
   or nvcc -V
   #+end_src
   #+begin_src 
6. cuDNN
   go to [[https://developer.nvidia.com/rdp/cudnn-download]]
   at least select 7.6.1 for CUDA 10.1
   sudo cp cuda/include/cudnn.h /usr/local/cuda/include/
   sudo cp cuda/lib64/libcudnn* /usr/local/cuda/lib64/
   sudo chmod a+r /usr/local/cuda/include/cudnn.h 
#+end_src
#+begin_src 
7. sudo apt remove nvidia-*
   reboot
   #+end_src
#+begin_src 
8. download the nvidia driver source file  at
   [[https://www.nvidia.com/Download/index.aspx?lang=en-us]]
#+end_src
#+begin_src 
9. cd ~/Downloads
   chmod +x ~/Downloads/NVIDIA-Linux-x86_64-450.80.02.run
   sudo ./NVI...
#+end_src
#+begin_src 
10. sudo apt install python3-pip
    sudo apt install ipython3
    pip3 install pip
    pip3 install tensorflow-gpu
    ipython3
    import tensorflow as tf
    print(tf.test.is_gpu_available())
#+end_src
11.
    fixup
    sometime it can be in the case: the communication with nvidia driver is failed,
    to fix it,  using apt install the driver 418-driver from apt again
12. 
    check
    #+BEGIN_SRC ipython :results output
    import tensorflow as tf
    if (tf.test.is_gpu_available(cuda_only=False, min_cuda_compute_capability=None)==True):
      print("using gpu")
  #+END_SRC

#+RESULTS:
: WARNING:tensorflow:From <ipython-input-3-77a0022b7707>:2: is_gpu_available (from tensorflow.python.framework.test_util) is deprecated and will be removed in a future version.
: Instructions for updating:
: Use `tf.config.list_physical_devices('GPU')` instead.
: using gpu

#+begin_src ipython  :results output
  import sys
  print(sys.version)
#+end_src

#+RESULTS:
: 2.7.17 (default, Sep 30 2020, 13:38:04) 
: [GCC 7.5.0]

* Error
** 'int' object is not callable
trying to assign a variable to the system variable
** can't open pip installed package
notebook, or ipython, such package, installed, bu can't open,
if the package is in the path, we can start it with
python -m package

* Python Program collection
** useful expression
conditional express
#+begin_src python :results output
condition = True
x = 1 if condition else 0
print(x)

#+end_src

#+RESULTS:
: 1


Large Number  Formation
#+begin_src python :results output

num1 = 100_000_000_000
num2 = 10_000_000
print(f'{num1 + num2 :,}')

#+end_src

#+RESULTS:
: 100,010,000,000



open with
#+begin_src python :results output
with open('pycharm_keybounding.org','r') as f:
    file= f.read()
words = file.split(' ')


#+end_src

#+RESULTS:

enumerate
#+begin_src python :results output
names = ['one', 'two', 'three', 'four']
for index, name in enumerate(names, start=1):
    print(index,name)

#+end_src

#+RESULTS:
: 1 one
: 2 two
: 3 three
: 4 four


zip
#+begin_src python :results output
  names = ['one', 'two', 'three', 'four']
  hero = ['ni', 'wo', 'ta', 'bu']

  for name, h in zip(names, hero):
      print(f'{name} is actually {h}')
#+end_src

#+RESULTS:
: one is actually ni
: two is actually wo
: three is actually ta
: four is actually bu


unpacking tuple
#+begin_src python :results output
a, b, *_ = (1,2,3, 4,5)
a, b, *f = (1,2,3, 4,5)
c, d, _ = (1,2,3)
print(a)
print(b)

#+end_src

#+RESULTS:
: 1
: 2


setattr, 

getattr


#+begin_src python
from getpass import getpass
password = getpass('Password:')
#+end_src


python -m model
直接执行model模块
** map and for
#+BEGIN_SRC python :results output :tangle ~/Schreibtisch/test11.py
list1 = [ord(x) for x in 'ABC']
print(list1)

list2 = map(ord, 'ABkkC')
print(list2)

#+END_SRC

#+RESULTS:
: [65, 66, 67]
: [65, 66, 107, 107, 67]
** multiply
#+BEGIN_SRC python :results output
print('A'*3)
print(['A']*3)
print([['A']]*3)

#+END_SRC

#+RESULTS:
: AAA
: ['A', 'A', 'A']
: [['A'], ['A'], ['A']]

