html/Python.html
<div id="outline-container-orgef0b7ae" class="outline-3">
<h3 id="orgef0b7ae"><span class="section-number-3">3.1.</span> install with apt</h3>
<div class="outline-text-3" id="text-3-1">
<p>
Am 2022 May 09, monday I install cuda with apt,
I don't know if this is ready a offer for all, but I still wirte it down
</p>
<pre class="example">
sudo apt update
sudo apt upgrade
ubuntu-drivers devices
sudo apt install nvidia-driver-510
reboot
watch  -n 0.1 nvidia-smi 
</pre>

<pre class="example">
sudo apt install zlib1g nvidia-cuda-toolkit
nvcc -V
</pre>

<pre class="example">
pip install virtualenv 
python -m virtualenv dlforcvenv
cd dlforcvenv
source ./bin/activate
pip install torch torchvision torchaudio
</pre>

<pre class="example">
pip install notebook
python -m jupyter notebook &amp;
import torch
torch.cuda.is_available(), torch.backends.cudnn.is_available(), torch.cuda.device_count()
</pre>
</div>
</div>

<div id="outline-container-org56293c6" class="outline-3">
<h3 id="org56293c6"><span class="section-number-3">3.2.</span> install  driver 418-server, cuda 10.1, cudnn 7.6.1</h3>
<div class="outline-text-3" id="text-3-2">
<pre class="example">
1. nouveau to backlist: add following to /etc/modprobe.d/blacklist.conf
   blacklist nouveau
   options nouveau modeset=0
</pre>
<pre class="example">
2. sudo update-initramfs -u   
</pre>
<pre class="example">
3. sudo apt update
   ubuntu-drivers devices
   sudo apt install nvidia-drivers-418-server
   sudo reboot


   then I will be able to check :   nvidia-smi
</pre>

<pre class="example">
4. CUDA
   go to [[https://developer.nvidia.com/cuda-toolkit-archive]]
   select CUDA Toolkit 10.1 update 2 to install
   unmark the Drivers in  CUDA installation
</pre>
<pre class="example">
5. emacs ~/.bashrc
   export PATH="/usr/local/cuda-10.1/bin:$PATH"
   export LD_LIBRARY_PATH="/usr/lcoal/cuda-10.1/lib64:$LD_LIBRARY_PATH"
   source ~/.bashrc
</pre>
<pre class="example">
6. check CUDA
   cd /usr/local/cuda-10.1/samples/1_Utilities/deviceQuery
   sudo make
   ./deviceQuery

   OK if Result = PASS
   or nvcc -V
</pre>
<pre class="example">
6. cuDNN
   go to [[https://developer.nvidia.com/rdp/cudnn-download]]
   at least select 7.6.1 for CUDA 10.1
   sudo cp cuda/include/cudnn.h /usr/local/cuda/include/
   sudo cp cuda/lib64/libcudnn* /usr/local/cuda/lib64/
   sudo chmod a+r /usr/local/cuda/include/cudnn.h 
</pre>
<pre class="example">
7. sudo apt remove nvidia-*
   reboot
</pre>
<pre class="example">
8. download the nvidia driver source file  at
   [[https://www.nvidia.com/Download/index.aspx?lang=en-us]]
</pre>
<pre class="example">
9. cd ~/Downloads
   chmod +x ~/Downloads/NVIDIA-Linux-x86_64-450.80.02.run
   sudo ./NVI...
</pre>
<pre class="example">
10. sudo apt install python3-pip
    sudo apt install ipython3
    pip3 install pip
    pip3 install tensorflow-gpu
    ipython3
    import tensorflow as tf
    print(tf.test.is_gpu_available())
</pre>
<ol class="org-ol">
<li>fixup
sometime it can be in the case: the communication with nvidia driver is failed,
to fix it,  using apt install the driver 418-driver from apt again</li>
<li><p>
check
</p>
<div class="org-src-container">
<pre class="src src-ipython">import tensorflow as tf
if (tf.test.is_gpu_available(cuda_only=False, min_cuda_compute_capability=None)==True):
  print("using gpu")
</pre>
</div></li>
</ol>

<pre class="example">
WARNING:tensorflow:From &lt;ipython-input-3-77a0022b7707&gt;:2: is_gpu_available (from tensorflow.python.framework.test_util) is deprecated and will be removed in a future version.
Instructions for updating:
Use `tf.config.list_physical_devices('GPU')` instead.
using gpu
</pre>


<div class="org-src-container">
<pre class="src src-ipython">import sys
print(sys.version)
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org72b66ec" class="outline-2">
<h2 id="org72b66ec"><span class="section-number-2">4.</span> Error</h2>
<div class="outline-text-2" id="text-4">
</div>
<div id="outline-container-orgd872611" class="outline-3">
<h3 id="orgd872611"><span class="section-number-3">4.1.</span> 'int' object is not callable</h3>
<div class="outline-text-3" id="text-4-1">
<p>
trying to assign a variable to the system variable
</p>
</div>
</div>
<div id="outline-container-org9ee92be" class="outline-3">
<h3 id="org9ee92be"><span class="section-number-3">4.2.</span> can't open pip installed package</h3>
<div class="outline-text-3" id="text-4-2">
<p>
notebook, or ipython, such package, installed, bu can't open,
if the package is in the path, we can start it with
python -m package
</p>
</div>
</div>
</div>

<div id="outline-container-org531441d" class="outline-2">
<h2 id="org531441d"><span class="section-number-2">5.</span> Python Program collection</h2>
<div class="outline-text-2" id="text-5">
</div>
<div id="outline-container-orgec7e235" class="outline-3">
<h3 id="orgec7e235"><span class="section-number-3">5.1.</span> useful expression</h3>
<div class="outline-text-3" id="text-5-1">
<p>
conditional express
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #7590db;">condition</span> = <span style="color: #a45bad;">True</span>
<span style="color: #7590db;">x</span> = 1 <span style="color: #4f97d7; font-weight: bold;">if</span> condition <span style="color: #4f97d7; font-weight: bold;">else</span> 0
<span style="color: #4f97d7;">print</span>(x)

</pre>
</div>


<p>
Large Number  Formation
</p>
<div class="org-src-container">
<pre class="src src-python">
<span style="color: #7590db;">num1</span> = 100_000_000_000
<span style="color: #7590db;">num2</span> = 10_000_000
<span style="color: #4f97d7;">print</span>(f<span style="color: #2d9574;">'</span>{num1 + num2 :,}<span style="color: #2d9574;">'</span>)

</pre>
</div>



<p>
open with
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #4f97d7; font-weight: bold;">with</span> <span style="color: #4f97d7;">open</span>(<span style="color: #2d9574;">'pycharm_keybounding.org'</span>,<span style="color: #2d9574;">'r'</span>) <span style="color: #4f97d7; font-weight: bold;">as</span> f:
<span style="background-color: #292e34;"> </span>   <span style="color: #4f97d7;">file</span>= f.read()
<span style="color: #7590db;">words</span> = <span style="color: #4f97d7;">file</span>.split(<span style="color: #2d9574;">' '</span>)


</pre>
</div>

<p>
enumerate
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #7590db;">names</span> = [<span style="color: #2d9574;">'one'</span>, <span style="color: #2d9574;">'two'</span>, <span style="color: #2d9574;">'three'</span>, <span style="color: #2d9574;">'four'</span>]
<span style="color: #4f97d7; font-weight: bold;">for</span> index, name <span style="color: #4f97d7; font-weight: bold;">in</span> <span style="color: #4f97d7;">enumerate</span>(names, start=1):
<span style="background-color: #292e34;"> </span>   <span style="color: #4f97d7;">print</span>(index,name)

</pre>
</div>


<p>
zip
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #7590db;">names</span> = [<span style="color: #2d9574;">'one'</span>, <span style="color: #2d9574;">'two'</span>, <span style="color: #2d9574;">'three'</span>, <span style="color: #2d9574;">'four'</span>]
<span style="color: #7590db;">hero</span> = [<span style="color: #2d9574;">'ni'</span>, <span style="color: #2d9574;">'wo'</span>, <span style="color: #2d9574;">'ta'</span>, <span style="color: #2d9574;">'bu'</span>]

<span style="color: #4f97d7; font-weight: bold;">for</span> name, h <span style="color: #4f97d7; font-weight: bold;">in</span> <span style="color: #4f97d7;">zip</span>(names, hero):
<span style="background-color: #292e34;"> </span>   <span style="color: #4f97d7;">print</span>(f<span style="color: #2d9574;">'</span>{name}<span style="color: #2d9574;"> is actually </span>{h}<span style="color: #2d9574;">'</span>)
</pre>
</div>


<p>
unpacking tuple
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #7590db;">a</span>, <span style="color: #7590db;">b</span>, *<span style="color: #7590db;">_</span> = (1,2,3, 4,5)
<span style="color: #7590db;">a</span>, <span style="color: #7590db;">b</span>, *<span style="color: #7590db;">f</span> = (1,2,3, 4,5)
<span style="color: #7590db;">c</span>, <span style="color: #7590db;">d</span>, <span style="color: #7590db;">_</span> = (1,2,3)
<span style="color: #4f97d7;">print</span>(a)
<span style="color: #4f97d7;">print</span>(b)

</pre>
</div>


<p>
setattr, 
</p>

<p>
getattr
</p>


<div class="org-src-container">
<pre class="src src-python"><span style="color: #4f97d7; font-weight: bold;">from</span> getpass <span style="color: #4f97d7; font-weight: bold;">import</span> getpass
<span style="color: #7590db;">password</span> = getpass(<span style="color: #2d9574;">'Password:'</span>)
</pre>
</div>


<p>
python -m model
直接执行model模块
</p>
</div>
</div>
<div id="outline-container-org5154d86" class="outline-3">
<h3 id="org5154d86"><span class="section-number-3">5.2.</span> map and for</h3>
<div class="outline-text-3" id="text-5-2">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #7590db;">list1</span> = [<span style="color: #4f97d7;">ord</span>(x) <span style="color: #4f97d7; font-weight: bold;">for</span> x <span style="color: #4f97d7; font-weight: bold;">in</span> <span style="color: #2d9574;">'ABC'</span>]
<span style="color: #4f97d7;">print</span>(list1)

<span style="color: #7590db;">list2</span> = <span style="color: #4f97d7;">map</span>(<span style="color: #4f97d7;">ord</span>, <span style="color: #2d9574;">'ABkkC'</span>)
<span style="color: #4f97d7;">print</span>(list2)

</pre>
</div>
</div>
</div>
