content/python.org
** generator

use yield stead of return

#+begin_src python :results output
  def func (lst):
      lt = []
      for i in lst:
          lt.append( i*i)
      return lt
  num = func([ x for x in range(8)])
  print(num)
  num1 = [ x*x for x in range(8)]
  print(num1)


  #generator
  def funcg (lst):
      for i in lst:
          yield (i*i)

  numg = funcg([ x for x in range(8)])
  print(numg)
  numg1 = ( x*x for x in range(8))
  print(numg1)



#+end_src

#+RESULTS:
: [0, 1, 4, 9, 16, 25, 36, 49]
: [0, 1, 4, 9, 16, 25, 36, 49]
: <generator object funcg at 0x7f654ba98190>
: <generator object <genexpr> at 0x7f654bb09d20>

** List
 this can not be execute, otherweise it will dead,rekursive of position 0
#+BEGIN_SRC python
words = ['big','cat','dog']
for a in words:
    words.insert(0, 'wo')

#+END_SRC
#+BEGIN_SRC python
words = ['big','cat','dog']
for a in words[:]:
    words.insert(0, 'wo')
#+END_SRC

#+RESULTS:
: None

** list creation

#+begin_src ipython :results output

# two fast way to create list
a0 = [1]*10
print(a0)
a1 = [1 for x in range(10)]
print(a1)

# every subarray is conneted
ak0 = [[]]*10
print(ak0)
ak0[2].append(3)
print(ak0)

# every subarray is disconneted
ak1 = [[] for x in range(10)]
print(ak1)
ak1[2].append(3)
print(ak1)

#+end_src

** Break Points

#+BEGIN_SRC 
else sentence after for: after for sentence else can be used

def fun(argument, *argument, **argument)
fun(single_value, tuple, dictionary)
#+END_SRC

 lambda with funtion
#+BEGIN_SRC python :results output
def fun(n):
    return lambda x: x+n
print(fun(3)(4))
#+END_SRC

#+RESULTS:
: 7




#+BEGIN_SRC 
nonlocal将变量的赋值,且将此值向外层作用域扩展一个范

global 将变量的赋值到程序的全局作用域
#+END_SRC

#+BEGIN_SRC 

 _ value: 在交互模式下，上一次打印出来的表达式被赋值给变量 _

 import test.py file as a model
 import test
 so all funtions and parameters can be called as in a test class
#+END_SRC

#+BEGIN_SRC 

python -i test.py 
after execute test.py file, terminal will get into python console, 
and all funtions and parameters can just be called.
#+END_SRC
** Tkinter Vairlaation
*** buttom
#+BEGIN_SRC python
  import tkinter as tk

  window = tk.Tk()
  window.title('my window')
  window.geometry('200x200')

  var = tk.StringVar()
  l = tk.Label(window, bg='yellow', width=20, text='empty')
  l.pack()

  def print_selection():
      l.config(text='you have selected ' + var.get())

  r1 = tk.Radiobutton(window, text='Option A',
                      variable=var, value='A',
                      command=print_selection)
  r1.pack()
  r2 = tk.Radiobutton(window, text='Option B',
                      variable=var, value='B',
                      command=print_selection)
  r2.pack()
  r3 = tk.Radiobutton(window, text='Option C',
                      variable=var, value='C',
                      command=print_selection)
  r3.pack()


  window.mainloop()


#+END_SRC
