html/Python.html
<div id="outline-container-org54f948e" class="outline-3">
<h3 id="org54f948e"><span class="section-number-3">5.3.</span> multiply</h3>
<div class="outline-text-3" id="text-5-3">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #4f97d7;">print</span>(<span style="color: #2d9574;">'A'</span>*3)
<span style="color: #4f97d7;">print</span>([<span style="color: #2d9574;">'A'</span>]*3)
<span style="color: #4f97d7;">print</span>([[<span style="color: #2d9574;">'A'</span>]]*3)

</pre>
</div>
</div>
</div>

<div id="outline-container-org8d2d8a0" class="outline-3">
<h3 id="org8d2d8a0"><span class="section-number-3">5.4.</span> generator</h3>
<div class="outline-text-3" id="text-5-4">
<p>
use yield stead of return
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #4f97d7; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">func</span> (lst):
<span style="background-color: #292e34;"> </span>   <span style="color: #7590db;">lt</span> = []
<span style="background-color: #292e34;"> </span>   <span style="color: #4f97d7; font-weight: bold;">for</span> i <span style="color: #4f97d7; font-weight: bold;">in</span> lst:
<span style="background-color: #292e34;"> </span>   <span style="background-color: #292e34;"> </span>   lt.append( i*i)
<span style="background-color: #292e34;"> </span>   <span style="color: #4f97d7; font-weight: bold;">return</span> lt
<span style="color: #7590db;">num</span> = func([ x <span style="color: #4f97d7; font-weight: bold;">for</span> x <span style="color: #4f97d7; font-weight: bold;">in</span> <span style="color: #4f97d7;">range</span>(8)])
<span style="color: #4f97d7;">print</span>(num)
<span style="color: #7590db;">num1</span> = [ x*x <span style="color: #4f97d7; font-weight: bold;">for</span> x <span style="color: #4f97d7; font-weight: bold;">in</span> <span style="color: #4f97d7;">range</span>(8)]
<span style="color: #4f97d7;">print</span>(num1)


<span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">generator</span>
<span style="color: #4f97d7; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">funcg</span> (lst):
<span style="background-color: #292e34;"> </span>   <span style="color: #4f97d7; font-weight: bold;">for</span> i <span style="color: #4f97d7; font-weight: bold;">in</span> lst:
<span style="background-color: #292e34;"> </span>   <span style="background-color: #292e34;"> </span>   <span style="color: #4f97d7; font-weight: bold;">yield</span> (i*i)

<span style="color: #7590db;">numg</span> = funcg([ x <span style="color: #4f97d7; font-weight: bold;">for</span> x <span style="color: #4f97d7; font-weight: bold;">in</span> <span style="color: #4f97d7;">range</span>(8)])
<span style="color: #4f97d7;">print</span>(numg)
<span style="color: #7590db;">numg1</span> = ( x*x <span style="color: #4f97d7; font-weight: bold;">for</span> x <span style="color: #4f97d7; font-weight: bold;">in</span> <span style="color: #4f97d7;">range</span>(8))
<span style="color: #4f97d7;">print</span>(numg1)



</pre>
</div>
</div>
</div>

<div id="outline-container-org4d37256" class="outline-3">
<h3 id="org4d37256"><span class="section-number-3">5.5.</span> List</h3>
<div class="outline-text-3" id="text-5-5">
<p>
this can not be execute, otherweise it will dead,rekursive of position 0
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #7590db;">words</span> = [<span style="color: #2d9574;">'big'</span>,<span style="color: #2d9574;">'cat'</span>,<span style="color: #2d9574;">'dog'</span>]
<span style="color: #4f97d7; font-weight: bold;">for</span> a <span style="color: #4f97d7; font-weight: bold;">in</span> words:
<span style="background-color: #292e34;"> </span>   words.insert(0, <span style="color: #2d9574;">'wo'</span>)

</pre>
</div>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #7590db;">words</span> = [<span style="color: #2d9574;">'big'</span>,<span style="color: #2d9574;">'cat'</span>,<span style="color: #2d9574;">'dog'</span>]
<span style="color: #4f97d7; font-weight: bold;">for</span> a <span style="color: #4f97d7; font-weight: bold;">in</span> words[:]:
<span style="background-color: #292e34;"> </span>   words.insert(0, <span style="color: #2d9574;">'wo'</span>)
</pre>
</div>
</div>
</div>

<div id="outline-container-org3fcd69e" class="outline-3">
<h3 id="org3fcd69e"><span class="section-number-3">5.6.</span> list creation</h3>
<div class="outline-text-3" id="text-5-6">
<div class="org-src-container">
<pre class="src src-ipython">
# two fast way to create list
a0 = [1]*10
print(a0)
a1 = [1 for x in range(10)]
print(a1)

# every subarray is conneted
ak0 = [[]]*10
print(ak0)
ak0[2].append(3)
print(ak0)

# every subarray is disconneted
ak1 = [[] for x in range(10)]
print(ak1)
ak1[2].append(3)
print(ak1)

</pre>
</div>
</div>
</div>

<div id="outline-container-org498308f" class="outline-3">
<h3 id="org498308f"><span class="section-number-3">5.7.</span> Break Points</h3>
<div class="outline-text-3" id="text-5-7">
<pre class="example">
else sentence after for: after for sentence else can be used

def fun(argument, *argument, **argument)
fun(single_value, tuple, dictionary)
</pre>

<p>
lambda with funtion
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #4f97d7; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">fun</span>(n):
<span style="background-color: #292e34;"> </span>   <span style="color: #4f97d7; font-weight: bold;">return</span> <span style="color: #4f97d7; font-weight: bold;">lambda</span> x: x+n
<span style="color: #4f97d7;">print</span>(fun(3)(4))
</pre>
</div>




<pre class="example">
nonlocal将变量的赋值,且将此值向外层作用域扩展一个范

global 将变量的赋值到程序的全局作用域
</pre>

<pre class="example">

_ value: 在交互模式下，上一次打印出来的表达式被赋值给变量 _

import test.py file as a model
import test
so all funtions and parameters can be called as in a test class
</pre>

<pre class="example">

python -i test.py 
after execute test.py file, terminal will get into python console, 
and all funtions and parameters can just be called.
</pre>
</div>
</div>
<div id="outline-container-org800f790" class="outline-3">
<h3 id="org800f790"><span class="section-number-3">5.8.</span> Tkinter Vairlaation</h3>
<div class="outline-text-3" id="text-5-8">
</div>
<div id="outline-container-org951d936" class="outline-4">
<h4 id="org951d936"><span class="section-number-4">5.8.1.</span> buttom</h4>
<div class="outline-text-4" id="text-5-8-1">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #4f97d7; font-weight: bold;">import</span> tkinter <span style="color: #4f97d7; font-weight: bold;">as</span> tk

<span style="color: #7590db;">window</span> = tk.Tk()
window.title(<span style="color: #2d9574;">'my window'</span>)
window.geometry(<span style="color: #2d9574;">'200x200'</span>)

<span style="color: #7590db;">var</span> = tk.StringVar()
<span style="color: #7590db;">l</span> = tk.Label(window, bg=<span style="color: #2d9574;">'yellow'</span>, width=20, text=<span style="color: #2d9574;">'empty'</span>)
l.pack()

<span style="color: #4f97d7; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">print_selection</span>():
<span style="background-color: #292e34;"> </span>   l.config(text=<span style="color: #2d9574;">'you have selected '</span> + var.get())

<span style="color: #7590db;">r1</span> = tk.Radiobutton(window, text=<span style="color: #2d9574;">'Option A'</span>,
<span style="background-color: #292e34;"> </span>   <span style="background-color: #292e34;"> </span>   <span style="background-color: #292e34;"> </span>   <span style="background-color: #292e34;"> </span>   <span style="background-color: #292e34;"> </span>   variable=var, value=<span style="color: #2d9574;">'A'</span>,
<span style="background-color: #292e34;"> </span>   <span style="background-color: #292e34;"> </span>   <span style="background-color: #292e34;"> </span>   <span style="background-color: #292e34;"> </span>   <span style="background-color: #292e34;"> </span>   command=print_selection)
r1.pack()
<span style="color: #7590db;">r2</span> = tk.Radiobutton(window, text=<span style="color: #2d9574;">'Option B'</span>,
<span style="background-color: #292e34;"> </span>   <span style="background-color: #292e34;"> </span>   <span style="background-color: #292e34;"> </span>   <span style="background-color: #292e34;"> </span>   <span style="background-color: #292e34;"> </span>   variable=var, value=<span style="color: #2d9574;">'B'</span>,
<span style="background-color: #292e34;"> </span>   <span style="background-color: #292e34;"> </span>   <span style="background-color: #292e34;"> </span>   <span style="background-color: #292e34;"> </span>   <span style="background-color: #292e34;"> </span>   command=print_selection)
r2.pack()
<span style="color: #7590db;">r3</span> = tk.Radiobutton(window, text=<span style="color: #2d9574;">'Option C'</span>,
<span style="background-color: #292e34;"> </span>   <span style="background-color: #292e34;"> </span>   <span style="background-color: #292e34;"> </span>   <span style="background-color: #292e34;"> </span>   <span style="background-color: #292e34;"> </span>   variable=var, value=<span style="color: #2d9574;">'C'</span>,
<span style="background-color: #292e34;"> </span>   <span style="background-color: #292e34;"> </span>   <span style="background-color: #292e34;"> </span>   <span style="background-color: #292e34;"> </span>   <span style="background-color: #292e34;"> </span>   command=print_selection)
r3.pack()


window.mainloop()


</pre>
</div>
</div>
</div>
