content/python.org
*** checkbutton
#+BEGIN_SRC python
  import tkinter as tk

  window = tk.Tk()
  window.title('my window')
  window.geometry('200x200')

  l = tk.Label(window, bg='yellow', width=20, text='empty')
  l.pack()

  def print_selection():
      if (var1.get() == 1) & (var2.get() == 0):
          l.config(text='I love only Python ')
      elif (var1.get() == 0) & (var2.get() == 1):
          l.config(text='I love only C++')
      elif (var1.get() == 0) & (var2.get() == 0):
          l.config(text='I do not love either')
      else:
          l.config(text='I love both')

  var1 = tk.IntVar()
  var2 = tk.IntVar()
  c1 = tk.Checkbutton(window, text='Python', variable=var1, onvalue=1, offvalue=0,
                      command=print_selection)
  c2 = tk.Checkbutton(window, text='C++', variable=var2, onvalue=1, offvalue=0,
                      command=print_selection)
  c1.pack()
  c2.pack()


  window.mainloop()


#+END_SRC
*** menubar
#+BEGIN_SRC python
  import tkinter as tk

  window = tk.Tk()
  window.title('my window')
  window.geometry('200x200')

  l = tk.Label(window, text='', bg='yellow')
  l.pack()
  counter = 0
  def do_job():
      global counter
      l.config(text='do '+ str(counter))
      counter+=1

  menubar = tk.Menu(window)
  filemenu = tk.Menu(menubar, tearoff=0)
  menubar.add_cascade(label='File', menu=filemenu)
  filemenu.add_command(label='New', command=do_job)
  filemenu.add_command(label='Open', command=do_job)
  filemenu.add_command(label='Save', command=do_job)
  filemenu.add_separator()
  filemenu.add_command(label='Exit', command=window.quit)

  editmenu = tk.Menu(menubar, tearoff=0)
  menubar.add_cascade(label='Edit', menu=editmenu)
  editmenu.add_command(label='Cut', command=do_job)
  editmenu.add_command(label='Copy', command=do_job)
  editmenu.add_command(label='Paste', command=do_job)

  submenu = tk.Menu(filemenu)
  filemenu.add_cascade(label='Import', menu=submenu, underline=0)
  submenu.add_command(label="Submenu1", command=do_job)

  window.config(menu=menubar)

  window.mainloop()


#+END_SRC
*** canvas (cannt load img)
#+BEGIN_SRC python
  import tkinter as tk

  window = tk.Tk()
  window.title('my window')
  window.geometry('200x200')

  canvas = tk.Canvas(window, bg='blue', height=100, width=200)
  image_file = tk.PhotoImage(file='ins.gif')
  image = canvas.create_image(10, 10, anchor='nw', image=image_file)
  x0, y0, x1, y1= 50, 50, 80, 80
  line = canvas.create_line(x0, y0, x1, y1)
  oval = canvas.create_oval(x0, y0, x1, y1, fill='red')
  arc = canvas.create_arc(x0+30, y0+30, x1+30, y1+30, start=0, extent=180)
  rect = canvas.create_rectangle(100, 30, 100+20, 30+20)
  canvas.pack()

  def moveit():
      canvas.move(rect, 0, 2)

  b = tk.Button(window, text='move', command=moveit).pack()


  window.mainloop()

#+END_SRC
*** frame


#+BEGIN_SRC python

  import tkinter as tk

  window = tk.Tk()
  window.title('my window')
  window.geometry('200x200')
  tk.Label(window, text='on the window').pack()

  frm = tk.Frame(window)
  frm.pack()
  frm_l = tk.Frame(frm, )
  frm_r = tk.Frame(frm)
  frm_l.pack(side='left')
  frm_r.pack(side='right')

  tk.Label(frm_l, text='on the frm_l1').pack()
  tk.Label(frm_l, text='on the frm_l2').pack()
  tk.Label(frm_r, text='on the frm_r1').pack()
  window.mainloop()

#+END_SRC
*** list
#+BEGIN_SRC python


  import tkinter as tk

  window = tk.Tk()
  window.title('my window')
  window.geometry('200x200')

  var1 = tk.StringVar()
  l = tk.Label(window, bg='yellow', width=4, textvariable=var1)
  l.pack()

  def print_selection():
      value = lb.get(lb.curselection())
      var1.set(value)

  b1 = tk.Button(window, text='print selection', width=15,
                height=2, command=print_selection)
  b1.pack()

  var2 = tk.StringVar()
  var2.set((11,22,33,44))
  lb = tk.Listbox(window, listvariable=var2)
  list_items = [1,2,3,4]
  for item in list_items:
      lb.insert('end', item)
  lb.insert(1, 'first')
  lb.insert(2, 'second')
  lb.delete(2)
  lb.pack()

  window.mainloop()


#+END_SRC
