html/Python.html
<div id="outline-container-orgb51e6cf" class="outline-4">
<h4 id="orgb51e6cf"><span class="section-number-4">5.8.2.</span> checkbutton</h4>
<div class="outline-text-4" id="text-5-8-2">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #4f97d7; font-weight: bold;">import</span> tkinter <span style="color: #4f97d7; font-weight: bold;">as</span> tk

<span style="color: #7590db;">window</span> = tk.Tk()
window.title(<span style="color: #2d9574;">'my window'</span>)
window.geometry(<span style="color: #2d9574;">'200x200'</span>)

<span style="color: #7590db;">l</span> = tk.Label(window, bg=<span style="color: #2d9574;">'yellow'</span>, width=20, text=<span style="color: #2d9574;">'empty'</span>)
l.pack()

<span style="color: #4f97d7; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">print_selection</span>():
<span style="background-color: #292e34;"> </span>   <span style="color: #4f97d7; font-weight: bold;">if</span> (var1.get() == 1) &amp; (var2.get() == 0):
<span style="background-color: #292e34;"> </span>   <span style="background-color: #292e34;"> </span>   l.config(text=<span style="color: #2d9574;">'I love only Python '</span>)
<span style="background-color: #292e34;"> </span>   <span style="color: #4f97d7; font-weight: bold;">elif</span> (var1.get() == 0) &amp; (var2.get() == 1):
<span style="background-color: #292e34;"> </span>   <span style="background-color: #292e34;"> </span>   l.config(text=<span style="color: #2d9574;">'I love only C++'</span>)
<span style="background-color: #292e34;"> </span>   <span style="color: #4f97d7; font-weight: bold;">elif</span> (var1.get() == 0) &amp; (var2.get() == 0):
<span style="background-color: #292e34;"> </span>   <span style="background-color: #292e34;"> </span>   l.config(text=<span style="color: #2d9574;">'I do not love either'</span>)
<span style="background-color: #292e34;"> </span>   <span style="color: #4f97d7; font-weight: bold;">else</span>:
<span style="background-color: #292e34;"> </span>   <span style="background-color: #292e34;"> </span>   l.config(text=<span style="color: #2d9574;">'I love both'</span>)

<span style="color: #7590db;">var1</span> = tk.IntVar()
<span style="color: #7590db;">var2</span> = tk.IntVar()
<span style="color: #7590db;">c1</span> = tk.Checkbutton(window, text=<span style="color: #2d9574;">'Python'</span>, variable=var1, onvalue=1, offvalue=0,
<span style="background-color: #292e34;"> </span>   <span style="background-color: #292e34;"> </span>   <span style="background-color: #292e34;"> </span>   <span style="background-color: #292e34;"> </span>   <span style="background-color: #292e34;"> </span>   command=print_selection)
<span style="color: #7590db;">c2</span> = tk.Checkbutton(window, text=<span style="color: #2d9574;">'C++'</span>, variable=var2, onvalue=1, offvalue=0,
<span style="background-color: #292e34;"> </span>   <span style="background-color: #292e34;"> </span>   <span style="background-color: #292e34;"> </span>   <span style="background-color: #292e34;"> </span>   <span style="background-color: #292e34;"> </span>   command=print_selection)
c1.pack()
c2.pack()


window.mainloop()


</pre>
</div>
</div>
</div>
<div id="outline-container-org5b73f44" class="outline-4">
<h4 id="org5b73f44"><span class="section-number-4">5.8.3.</span> menubar</h4>
<div class="outline-text-4" id="text-5-8-3">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #4f97d7; font-weight: bold;">import</span> tkinter <span style="color: #4f97d7; font-weight: bold;">as</span> tk

<span style="color: #7590db;">window</span> = tk.Tk()
window.title(<span style="color: #2d9574;">'my window'</span>)
window.geometry(<span style="color: #2d9574;">'200x200'</span>)

<span style="color: #7590db;">l</span> = tk.Label(window, text=<span style="color: #2d9574;">''</span>, bg=<span style="color: #2d9574;">'yellow'</span>)
l.pack()
<span style="color: #7590db;">counter</span> = 0
<span style="color: #4f97d7; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">do_job</span>():
<span style="background-color: #292e34;"> </span>   <span style="color: #4f97d7; font-weight: bold;">global</span> counter
<span style="background-color: #292e34;"> </span>   l.config(text=<span style="color: #2d9574;">'do '</span>+ <span style="color: #4f97d7;">str</span>(counter))
<span style="background-color: #292e34;"> </span>   <span style="color: #7590db;">counter</span>+=1

<span style="color: #7590db;">menubar</span> = tk.Menu(window)
<span style="color: #7590db;">filemenu</span> = tk.Menu(menubar, tearoff=0)
menubar.add_cascade(label=<span style="color: #2d9574;">'File'</span>, menu=filemenu)
filemenu.add_command(label=<span style="color: #2d9574;">'New'</span>, command=do_job)
filemenu.add_command(label=<span style="color: #2d9574;">'Open'</span>, command=do_job)
filemenu.add_command(label=<span style="color: #2d9574;">'Save'</span>, command=do_job)
filemenu.add_separator()
filemenu.add_command(label=<span style="color: #2d9574;">'Exit'</span>, command=window.<span style="color: #a45bad;">quit</span>)

<span style="color: #7590db;">editmenu</span> = tk.Menu(menubar, tearoff=0)
menubar.add_cascade(label=<span style="color: #2d9574;">'Edit'</span>, menu=editmenu)
editmenu.add_command(label=<span style="color: #2d9574;">'Cut'</span>, command=do_job)
editmenu.add_command(label=<span style="color: #2d9574;">'Copy'</span>, command=do_job)
editmenu.add_command(label=<span style="color: #2d9574;">'Paste'</span>, command=do_job)

<span style="color: #7590db;">submenu</span> = tk.Menu(filemenu)
filemenu.add_cascade(label=<span style="color: #2d9574;">'Import'</span>, menu=submenu, underline=0)
submenu.add_command(label=<span style="color: #2d9574;">"Submenu1"</span>, command=do_job)

window.config(menu=menubar)

window.mainloop()


</pre>
</div>
</div>
</div>
<div id="outline-container-org3a56131" class="outline-4">
<h4 id="org3a56131"><span class="section-number-4">5.8.4.</span> canvas (cannt load img)</h4>
<div class="outline-text-4" id="text-5-8-4">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #4f97d7; font-weight: bold;">import</span> tkinter <span style="color: #4f97d7; font-weight: bold;">as</span> tk

<span style="color: #7590db;">window</span> = tk.Tk()
window.title(<span style="color: #2d9574;">'my window'</span>)
window.geometry(<span style="color: #2d9574;">'200x200'</span>)

<span style="color: #7590db;">canvas</span> = tk.Canvas(window, bg=<span style="color: #2d9574;">'blue'</span>, height=100, width=200)
<span style="color: #7590db;">image_file</span> = tk.PhotoImage(<span style="color: #4f97d7;">file</span>=<span style="color: #2d9574;">'ins.gif'</span>)
<span style="color: #7590db;">image</span> = canvas.create_image(10, 10, anchor=<span style="color: #2d9574;">'nw'</span>, image=image_file)
<span style="color: #7590db;">x0</span>, <span style="color: #7590db;">y0</span>, <span style="color: #7590db;">x1</span>, <span style="color: #7590db;">y1</span>= 50, 50, 80, 80
<span style="color: #7590db;">line</span> = canvas.create_line(x0, y0, x1, y1)
<span style="color: #7590db;">oval</span> = canvas.create_oval(x0, y0, x1, y1, fill=<span style="color: #2d9574;">'red'</span>)
<span style="color: #7590db;">arc</span> = canvas.create_arc(x0+30, y0+30, x1+30, y1+30, start=0, extent=180)
<span style="color: #7590db;">rect</span> = canvas.create_rectangle(100, 30, 100+20, 30+20)
canvas.pack()

<span style="color: #4f97d7; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">moveit</span>():
<span style="background-color: #292e34;"> </span>   canvas.move(rect, 0, 2)

<span style="color: #7590db;">b</span> = tk.Button(window, text=<span style="color: #2d9574;">'move'</span>, command=moveit).pack()


window.mainloop()

</pre>
</div>
</div>
</div>
<div id="outline-container-org8fc5179" class="outline-4">
<h4 id="org8fc5179"><span class="section-number-4">5.8.5.</span> frame</h4>
<div class="outline-text-4" id="text-5-8-5">
<div class="org-src-container">
<pre class="src src-python">
<span style="color: #4f97d7; font-weight: bold;">import</span> tkinter <span style="color: #4f97d7; font-weight: bold;">as</span> tk

<span style="color: #7590db;">window</span> = tk.Tk()
window.title(<span style="color: #2d9574;">'my window'</span>)
window.geometry(<span style="color: #2d9574;">'200x200'</span>)
tk.Label(window, text=<span style="color: #2d9574;">'on the window'</span>).pack()

<span style="color: #7590db;">frm</span> = tk.Frame(window)
frm.pack()
<span style="color: #7590db;">frm_l</span> = tk.Frame(frm, )
<span style="color: #7590db;">frm_r</span> = tk.Frame(frm)
frm_l.pack(side=<span style="color: #2d9574;">'left'</span>)
frm_r.pack(side=<span style="color: #2d9574;">'right'</span>)

tk.Label(frm_l, text=<span style="color: #2d9574;">'on the frm_l1'</span>).pack()
tk.Label(frm_l, text=<span style="color: #2d9574;">'on the frm_l2'</span>).pack()
tk.Label(frm_r, text=<span style="color: #2d9574;">'on the frm_r1'</span>).pack()
window.mainloop()

</pre>
</div>
</div>
</div>
<div id="outline-container-orgf64765d" class="outline-4">
<h4 id="orgf64765d"><span class="section-number-4">5.8.6.</span> list</h4>
<div class="outline-text-4" id="text-5-8-6">
<div class="org-src-container">
<pre class="src src-python">

<span style="color: #4f97d7; font-weight: bold;">import</span> tkinter <span style="color: #4f97d7; font-weight: bold;">as</span> tk

<span style="color: #7590db;">window</span> = tk.Tk()
window.title(<span style="color: #2d9574;">'my window'</span>)
window.geometry(<span style="color: #2d9574;">'200x200'</span>)

<span style="color: #7590db;">var1</span> = tk.StringVar()
<span style="color: #7590db;">l</span> = tk.Label(window, bg=<span style="color: #2d9574;">'yellow'</span>, width=4, textvariable=var1)
l.pack()

<span style="color: #4f97d7; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">print_selection</span>():
<span style="background-color: #292e34;"> </span>   <span style="color: #7590db;">value</span> = lb.get(lb.curselection())
<span style="background-color: #292e34;"> </span>   var1.<span style="color: #4f97d7;">set</span>(value)

<span style="color: #7590db;">b1</span> = tk.Button(window, text=<span style="color: #2d9574;">'print selection'</span>, width=15,
<span style="background-color: #292e34;"> </span>   <span style="background-color: #292e34;"> </span>   <span style="background-color: #292e34;"> </span>   <span style="background-color: #292e34;"> </span> height=2, command=print_selection)
b1.pack()

<span style="color: #7590db;">var2</span> = tk.StringVar()
var2.<span style="color: #4f97d7;">set</span>((11,22,33,44))
<span style="color: #7590db;">lb</span> = tk.Listbox(window, listvariable=var2)
<span style="color: #7590db;">list_items</span> = [1,2,3,4]
<span style="color: #4f97d7; font-weight: bold;">for</span> item <span style="color: #4f97d7; font-weight: bold;">in</span> list_items:
<span style="background-color: #292e34;"> </span>   lb.insert(<span style="color: #2d9574;">'end'</span>, item)
lb.insert(1, <span style="color: #2d9574;">'first'</span>)
lb.insert(2, <span style="color: #2d9574;">'second'</span>)
lb.delete(2)
lb.pack()

window.mainloop()


</pre>
</div>
</div>
</div>
