content/python.org
*** scale
#+BEGIN_SRC python

  import tkinter as tk

  window = tk.Tk()
  window.title('my window')
  window.geometry('200x200')

  l = tk.Label(window, bg='yellow', width=20, text='empty')
  l.pack()

  def print_selection(v):
      l.config(text='you have selected ' + v)

  s = tk.Scale(window, label='try me', from_=5, to=11, orient=tk.HORIZONTAL,
               length=200, showvalue=0, tickinterval=2, resolution=0.01, command=print_selection)
  s.pack()

  window.mainloop()


#+END_SRC
** decorator
1, @后没有参数，则被修饰函数名被传到修饰函数作参数
2, @后有参数，在该参数被传到修饰函数作参数，而被修饰函数可在其定义内被
接收
#+BEGIN_SRC python :results output :session
  def log(func):
      def wrapper(*args, **kw):
          print('call function %s():' % func.__name__)
          return func(*args, **kw)
      return wrapper

  def loog(text):
      def decorator(fun):
          def wrapper(*args, **kw):
              print('kkcall function %s with %s():' % (fun.__name__, text))
              return fun(*args, **kw)
          return wrapper
      return decorator



  @loog('exit')
  def now():
      print("now to start")

  now()
#+END_SRC

** functools
#+BEGIN_SRC python :results output
import functools
int2 = functools.partial(int, base=3)
print(int2('1211'))

#+END_SRC

#+RESULTS:
: 49

** Polymorphism
#+BEGIN_SRC python :results output :session
  class Animal(object):
      def __init__(self):
          self.name ='Animal name'

      def run(self):
          print('Animal is running')

  class Dog(Animal):
      def __init__(self):
          self.name ='Dog name'
      def run(self):
          print('Dog is running')

  class Cat(Animal):
      def __init__(self):
          self.name ='Cat name'
      def run(self):
          print('Cat is running')

  class Tortoise(Animal):
      def __init__(self):
          self.name ='Tortoise name'
      def run(self):
          print('Tortoise is running slowly')
            
  # Polymorphism, all Class or instance will be checked the best passing
  # mothode or character
  def run_twice(a):
      a.run()

  def name(b):
      print(b.name)

  dog = Dog()
  cat = Cat()

  
  run_twice(Animal())
  run_twice(Dog())
  run_twice(Cat())
  run_twice(dog)
  
  name(Animal())
  name(Dog())
  name(dog)

#+END_SRC

#+RESULTS:
: Animal is running
: Animal is running
: Dog is running
: Cat is running
: Dog is running
: Animal name
: Dog name
: Dog name

