html/Python.html
<div id="outline-container-org483acf7" class="outline-4">
<h4 id="org483acf7"><span class="section-number-4">5.8.7.</span> scale</h4>
<div class="outline-text-4" id="text-5-8-7">
<div class="org-src-container">
<pre class="src src-python">
<span style="color: #4f97d7; font-weight: bold;">import</span> tkinter <span style="color: #4f97d7; font-weight: bold;">as</span> tk

<span style="color: #7590db;">window</span> = tk.Tk()
window.title(<span style="color: #2d9574;">'my window'</span>)
window.geometry(<span style="color: #2d9574;">'200x200'</span>)

<span style="color: #7590db;">l</span> = tk.Label(window, bg=<span style="color: #2d9574;">'yellow'</span>, width=20, text=<span style="color: #2d9574;">'empty'</span>)
l.pack()

<span style="color: #4f97d7; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">print_selection</span>(v):
<span style="background-color: #292e34;"> </span>   l.config(text=<span style="color: #2d9574;">'you have selected '</span> + v)

<span style="color: #7590db;">s</span> = tk.Scale(window, label=<span style="color: #2d9574;">'try me'</span>, from_=5, to=11, orient=tk.HORIZONTAL,
<span style="background-color: #292e34;"> </span>   <span style="background-color: #292e34;"> </span>   <span style="background-color: #292e34;"> </span>   <span style="background-color: #292e34;"> </span>length=200, showvalue=0, tickinterval=2, resolution=0.01, command=print_selection)
s.pack()

window.mainloop()


</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-orgff48518" class="outline-3">
<h3 id="orgff48518"><span class="section-number-3">5.9.</span> decorator</h3>
<div class="outline-text-3" id="text-5-9">
<p>
1, @后没有参数，则被修饰函数名被传到修饰函数作参数
2, @后有参数，在该参数被传到修饰函数作参数，而被修饰函数可在其定义内被接收
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #4f97d7; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">log</span>(func):
<span style="background-color: #292e34;"> </span>   <span style="color: #4f97d7; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">wrapper</span>(*args, **kw):
<span style="background-color: #292e34;"> </span>   <span style="background-color: #292e34;"> </span>   <span style="color: #4f97d7;">print</span>(<span style="color: #2d9574;">'call function %s():'</span> % func.<span style="color: #4f97d7;">__name__</span>)
<span style="background-color: #292e34;"> </span>   <span style="background-color: #292e34;"> </span>   <span style="color: #4f97d7; font-weight: bold;">return</span> func(*args, **kw)
<span style="background-color: #292e34;"> </span>   <span style="color: #4f97d7; font-weight: bold;">return</span> wrapper

<span style="color: #4f97d7; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">loog</span>(text):
<span style="background-color: #292e34;"> </span>   <span style="color: #4f97d7; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">decorator</span>(fun):
<span style="background-color: #292e34;"> </span>   <span style="background-color: #292e34;"> </span>   <span style="color: #4f97d7; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">wrapper</span>(*args, **kw):
<span style="background-color: #292e34;"> </span>   <span style="background-color: #292e34;"> </span>   <span style="background-color: #292e34;"> </span>   <span style="color: #4f97d7;">print</span>(<span style="color: #2d9574;">'kkcall function %s with %s():'</span> % (fun.<span style="color: #4f97d7;">__name__</span>, text))
<span style="background-color: #292e34;"> </span>   <span style="background-color: #292e34;"> </span>   <span style="background-color: #292e34;"> </span>   <span style="color: #4f97d7; font-weight: bold;">return</span> fun(*args, **kw)
<span style="background-color: #292e34;"> </span>   <span style="background-color: #292e34;"> </span>   <span style="color: #4f97d7; font-weight: bold;">return</span> wrapper
<span style="background-color: #292e34;"> </span>   <span style="color: #4f97d7; font-weight: bold;">return</span> decorator



<span style="color: #ce537a; font-weight: bold;">@loog</span>(<span style="color: #2d9574;">'exit'</span>)
<span style="color: #4f97d7; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">now</span>():
<span style="background-color: #292e34;"> </span>   <span style="color: #4f97d7;">print</span>(<span style="color: #2d9574;">"now to start"</span>)

now()
</pre>
</div>
</div>
</div>

<div id="outline-container-orgc9acd27" class="outline-3">
<h3 id="orgc9acd27"><span class="section-number-3">5.10.</span> functools</h3>
<div class="outline-text-3" id="text-5-10">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #4f97d7; font-weight: bold;">import</span> functools
<span style="color: #7590db;">int2</span> = functools.partial(<span style="color: #4f97d7;">int</span>, base=3)
<span style="color: #4f97d7;">print</span>(int2(<span style="color: #2d9574;">'1211'</span>))

</pre>
</div>
</div>
</div>

<div id="outline-container-org0d8e0aa" class="outline-3">
<h3 id="org0d8e0aa"><span class="section-number-3">5.11.</span> Polymorphism</h3>
<div class="outline-text-3" id="text-5-11">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #4f97d7; font-weight: bold;">class</span> <span style="color: #ce537a; font-weight: bold;">Animal</span>(<span style="color: #4f97d7;">object</span>):
<span style="background-color: #292e34;"> </span>   <span style="color: #4f97d7; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">__init__</span>(<span style="color: #4f97d7; font-weight: bold;">self</span>):
<span style="background-color: #292e34;"> </span>   <span style="background-color: #292e34;"> </span>   <span style="color: #4f97d7; font-weight: bold;">self</span>.<span style="color: #7590db;">name</span> =<span style="color: #2d9574;">'Animal name'</span>

<span style="background-color: #292e34;"> </span>   <span style="color: #4f97d7; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">run</span>(<span style="color: #4f97d7; font-weight: bold;">self</span>):
<span style="background-color: #292e34;"> </span>   <span style="background-color: #292e34;"> </span>   <span style="color: #4f97d7;">print</span>(<span style="color: #2d9574;">'Animal is running'</span>)

<span style="color: #4f97d7; font-weight: bold;">class</span> <span style="color: #ce537a; font-weight: bold;">Dog</span>(Animal):
<span style="background-color: #292e34;"> </span>   <span style="color: #4f97d7; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">__init__</span>(<span style="color: #4f97d7; font-weight: bold;">self</span>):
<span style="background-color: #292e34;"> </span>   <span style="background-color: #292e34;"> </span>   <span style="color: #4f97d7; font-weight: bold;">self</span>.<span style="color: #7590db;">name</span> =<span style="color: #2d9574;">'Dog name'</span>
<span style="background-color: #292e34;"> </span>   <span style="color: #4f97d7; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">run</span>(<span style="color: #4f97d7; font-weight: bold;">self</span>):
<span style="background-color: #292e34;"> </span>   <span style="background-color: #292e34;"> </span>   <span style="color: #4f97d7;">print</span>(<span style="color: #2d9574;">'Dog is running'</span>)

<span style="color: #4f97d7; font-weight: bold;">class</span> <span style="color: #ce537a; font-weight: bold;">Cat</span>(Animal):
<span style="background-color: #292e34;"> </span>   <span style="color: #4f97d7; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">__init__</span>(<span style="color: #4f97d7; font-weight: bold;">self</span>):
<span style="background-color: #292e34;"> </span>   <span style="background-color: #292e34;"> </span>   <span style="color: #4f97d7; font-weight: bold;">self</span>.<span style="color: #7590db;">name</span> =<span style="color: #2d9574;">'Cat name'</span>
<span style="background-color: #292e34;"> </span>   <span style="color: #4f97d7; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">run</span>(<span style="color: #4f97d7; font-weight: bold;">self</span>):
<span style="background-color: #292e34;"> </span>   <span style="background-color: #292e34;"> </span>   <span style="color: #4f97d7;">print</span>(<span style="color: #2d9574;">'Cat is running'</span>)

<span style="color: #4f97d7; font-weight: bold;">class</span> <span style="color: #ce537a; font-weight: bold;">Tortoise</span>(Animal):
<span style="background-color: #292e34;"> </span>   <span style="color: #4f97d7; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">__init__</span>(<span style="color: #4f97d7; font-weight: bold;">self</span>):
<span style="background-color: #292e34;"> </span>   <span style="background-color: #292e34;"> </span>   <span style="color: #4f97d7; font-weight: bold;">self</span>.<span style="color: #7590db;">name</span> =<span style="color: #2d9574;">'Tortoise name'</span>
<span style="background-color: #292e34;"> </span>   <span style="color: #4f97d7; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">run</span>(<span style="color: #4f97d7; font-weight: bold;">self</span>):
<span style="background-color: #292e34;"> </span>   <span style="background-color: #292e34;"> </span>   <span style="color: #4f97d7;">print</span>(<span style="color: #2d9574;">'Tortoise is running slowly'</span>)

<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">Polymorphism, all Class or instance will be checked the best passing</span>
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">mothode or character</span>
<span style="color: #4f97d7; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">run_twice</span>(a):
<span style="background-color: #292e34;"> </span>   a.run()

<span style="color: #4f97d7; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">name</span>(b):
<span style="background-color: #292e34;"> </span>   <span style="color: #4f97d7;">print</span>(b.name)

<span style="color: #7590db;">dog</span> = Dog()
<span style="color: #7590db;">cat</span> = Cat()


run_twice(Animal())
run_twice(Dog())
run_twice(Cat())
run_twice(dog)

name(Animal())
name(Dog())
name(dog)

</pre>
</div>
</div>
</div>
