content/python.org
** generator
#+BEGIN_SRC python :results output :session
  def something():
      result = []
      for _ in range(10):
          result.append(2)
      return result
  print(something())


  def iter_some():
      x = 0
      for _ in range(10):
          yield x
          x += 1
  a = iter_some()
  print(next(a))
  print(next(a))
  print(next(a))

#+END_SRC

#+RESULTS:
: [2, 2, 2, 2, 2, 2, 2, 2, 2, 2]
: 0
: 1
: 2

#+BEGIN_SRC python :results output :session

  def fib ():
      a = b = 1
      yield a
      yield b
      while True:
          a, b = b, a+b
          yield b
        

  for var in fib():
      if var > 100:
          break
      print(var)
    
            

#+END_SRC

#+RESULTS:
#+begin_example
1
1
2
3
5
8
13
21
34
55
89
#+end_example

** pdb
1. python -m pdb test.py
step by step with n,

2. import pdb 
pdb.set_trace() 设置断点

** Copy
copying fundmental vaiable will creat a new id for assigned varible, 
copy = [:] for object will create also a new id for new object, but not for nested object
deepcopy will also creat id for nested object in copyed object

** Decorator
decorator just rewrite the function, using call function as argument
#+begin_src python :results output
  def decorator_function(original_function):
      def wrapper_function(*arg, **kwargs):
          print("using wrapper, and  the name is {}, and the age".format(original_function.__name__))
          return original_function(*arg, **kwargs)
      return wrapper_function

  class decorator_class(object):
      def __init__(self, original_function):
          self.original_function = original_function
      def __call__(self, *arg, **kwargs):
          print("using the decorator class")
          return self.original_function(*arg, **kwargs)

  print("////////function decor without augurment//////////////////////")
  def display():
      print("display this")
  display = decorator_function(display)
  display()
  print("////////decorator decor without augurment//////////////////////")
  @decorator_function
  def display1():
      print("display1 this")
  display1()
  print("////////function decor with augurment//////////////////////")
  def display_info(name, age):
      print("display the name is {}, and the age is {}".format(name, age))
  display_info = decorator_function(display_info)
  display_info("Xiang", 21)
  print("////////decorator decor with augurment//////////////////////")
  @decorator_function
  def display_info1(name, age):
      print("display the name is {}, and the age is {}".format(name, age))
  display_info1("Xiang", 21)
  print("/////////class decorator decor/////////////////////")
  @decorator_class
  def display_info_class(name, age):
      print("display the name is {}, and the age is {}".format(name, age))
  display_info_class("Xiang", 21)
  print("////////class function decor//////////////////////")
  def display_info_class(name, age):
      print("display the name is {}, and the age is {}".format(name, age))
  display_info_class1 = decorator_class(display_info_class)
  display_info_class1("Xiang", 21)



#+end_src

#+RESULTS:
#+begin_example
////////function decor without augurment//////////////////////
using wrapper, and  the name is display, and the age
display this
////////decorator decor without augurment//////////////////////
using wrapper, and  the name is display1, and the age
display1 this
////////function decor with augurment//////////////////////
using wrapper, and  the name is display_info, and the age
display the name is Xiang, and the age is 21
////////decorator decor with augurment//////////////////////
using wrapper, and  the name is display_info1, and the age
display the name is Xiang, and the age is 21
/////////class decorator decor/////////////////////
using the decorator class
display the name is Xiang, and the age is 21
////////class function decor//////////////////////
using the decorator class
display the name is Xiang, and the age is 21
#+end_example

** with * **
#+begin_src ipython :results output :exports both
  def function_with_one_star(*d):
      print(d)

  def function_with_two_stars(**d):
      print(d)

  function_with_one_star(1,2,3)

  function_with_two_stars(a=1, b=2, c=3)


#+end_src

#+RESULTS:
: (1, 2, 3)
: {'a': 1, 'b': 2, 'c': 3}

