html/Python.html

<div id="outline-container-org7b40154" class="outline-3">
<h3 id="org7b40154"><span class="section-number-3">5.12.</span> generator</h3>
<div class="outline-text-3" id="text-5-12">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #4f97d7; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">something</span>():
<span style="background-color: #292e34;"> </span>   <span style="color: #7590db;">result</span> = []
<span style="background-color: #292e34;"> </span>   <span style="color: #4f97d7; font-weight: bold;">for</span> _ <span style="color: #4f97d7; font-weight: bold;">in</span> <span style="color: #4f97d7;">range</span>(10):
<span style="background-color: #292e34;"> </span>   <span style="background-color: #292e34;"> </span>   result.append(2)
<span style="background-color: #292e34;"> </span>   <span style="color: #4f97d7; font-weight: bold;">return</span> result
<span style="color: #4f97d7;">print</span>(something())


<span style="color: #4f97d7; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">iter_some</span>():
<span style="background-color: #292e34;"> </span>   <span style="color: #7590db;">x</span> = 0
<span style="background-color: #292e34;"> </span>   <span style="color: #4f97d7; font-weight: bold;">for</span> _ <span style="color: #4f97d7; font-weight: bold;">in</span> <span style="color: #4f97d7;">range</span>(10):
<span style="background-color: #292e34;"> </span>   <span style="background-color: #292e34;"> </span>   <span style="color: #4f97d7; font-weight: bold;">yield</span> x
<span style="background-color: #292e34;"> </span>   <span style="background-color: #292e34;"> </span>   <span style="color: #7590db;">x</span> += 1
<span style="color: #7590db;">a</span> = iter_some()
<span style="color: #4f97d7;">print</span>(<span style="color: #4f97d7;">next</span>(a))
<span style="color: #4f97d7;">print</span>(<span style="color: #4f97d7;">next</span>(a))
<span style="color: #4f97d7;">print</span>(<span style="color: #4f97d7;">next</span>(a))

</pre>
</div>

<div class="org-src-container">
<pre class="src src-python">
<span style="color: #4f97d7; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">fib</span> ():
<span style="background-color: #292e34;"> </span>   <span style="color: #7590db;">a</span> = <span style="color: #7590db;">b</span> = 1
<span style="background-color: #292e34;"> </span>   <span style="color: #4f97d7; font-weight: bold;">yield</span> a
<span style="background-color: #292e34;"> </span>   <span style="color: #4f97d7; font-weight: bold;">yield</span> b
<span style="background-color: #292e34;"> </span>   <span style="color: #4f97d7; font-weight: bold;">while</span> <span style="color: #a45bad;">True</span>:
<span style="background-color: #292e34;"> </span>   <span style="background-color: #292e34;"> </span>   <span style="color: #7590db;">a</span>, <span style="color: #7590db;">b</span> = b, a+b
<span style="background-color: #292e34;"> </span>   <span style="background-color: #292e34;"> </span>   <span style="color: #4f97d7; font-weight: bold;">yield</span> b


<span style="color: #4f97d7; font-weight: bold;">for</span> var <span style="color: #4f97d7; font-weight: bold;">in</span> fib():
<span style="background-color: #292e34;"> </span>   <span style="color: #4f97d7; font-weight: bold;">if</span> var &gt; 100:
<span style="background-color: #292e34;"> </span>   <span style="background-color: #292e34;"> </span>   <span style="color: #4f97d7; font-weight: bold;">break</span>
<span style="background-color: #292e34;"> </span>   <span style="color: #4f97d7;">print</span>(var)



</pre>
</div>
</div>
</div>

<div id="outline-container-orgc4b745e" class="outline-3">
<h3 id="orgc4b745e"><span class="section-number-3">5.13.</span> pdb</h3>
<div class="outline-text-3" id="text-5-13">
<ol class="org-ol">
<li>python -m pdb test.py</li>
</ol>
<p>
step by step with n,
</p>

<ol class="org-ol">
<li>import pdb</li>
</ol>
<p>
pdb.set<sub>trace</sub>() 设置断点
</p>
</div>
</div>

<div id="outline-container-org82ec6d0" class="outline-3">
<h3 id="org82ec6d0"><span class="section-number-3">5.14.</span> Copy</h3>
<div class="outline-text-3" id="text-5-14">
<p>
copying fundmental vaiable will creat a new id for assigned varible, 
copy = [:] for object will create also a new id for new object, but not for nested object
deepcopy will also creat id for nested object in copyed object
</p>
</div>
</div>

<div id="outline-container-org9458d5d" class="outline-3">
<h3 id="org9458d5d"><span class="section-number-3">5.15.</span> Decorator</h3>
<div class="outline-text-3" id="text-5-15">
<p>
decorator just rewrite the function, using call function as argument
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #4f97d7; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">decorator_function</span>(original_function):
<span style="background-color: #292e34;"> </span>   <span style="color: #4f97d7; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">wrapper_function</span>(*arg, **kwargs):
<span style="background-color: #292e34;"> </span>   <span style="background-color: #292e34;"> </span>   <span style="color: #4f97d7;">print</span>(<span style="color: #2d9574;">"using wrapper, and  the name is {}, and the age"</span>.<span style="color: #4f97d7;">format</span>(original_function.<span style="color: #4f97d7;">__name__</span>))
<span style="background-color: #292e34;"> </span>   <span style="background-color: #292e34;"> </span>   <span style="color: #4f97d7; font-weight: bold;">return</span> original_function(*arg, **kwargs)
<span style="background-color: #292e34;"> </span>   <span style="color: #4f97d7; font-weight: bold;">return</span> wrapper_function

<span style="color: #4f97d7; font-weight: bold;">class</span> <span style="color: #ce537a; font-weight: bold;">decorator_class</span>(<span style="color: #4f97d7;">object</span>):
<span style="background-color: #292e34;"> </span>   <span style="color: #4f97d7; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">__init__</span>(<span style="color: #4f97d7; font-weight: bold;">self</span>, original_function):
<span style="background-color: #292e34;"> </span>   <span style="background-color: #292e34;"> </span>   <span style="color: #4f97d7; font-weight: bold;">self</span>.<span style="color: #7590db;">original_function</span> = original_function
<span style="background-color: #292e34;"> </span>   <span style="color: #4f97d7; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">__call__</span>(<span style="color: #4f97d7; font-weight: bold;">self</span>, *arg, **kwargs):
<span style="background-color: #292e34;"> </span>   <span style="background-color: #292e34;"> </span>   <span style="color: #4f97d7;">print</span>(<span style="color: #2d9574;">"using the decorator class"</span>)
<span style="background-color: #292e34;"> </span>   <span style="background-color: #292e34;"> </span>   <span style="color: #4f97d7; font-weight: bold;">return</span> <span style="color: #4f97d7; font-weight: bold;">self</span>.original_function(*arg, **kwargs)

<span style="color: #4f97d7;">print</span>(<span style="color: #2d9574;">"////////function decor without augurment//////////////////////"</span>)
<span style="color: #4f97d7; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">display</span>():
<span style="background-color: #292e34;"> </span>   <span style="color: #4f97d7;">print</span>(<span style="color: #2d9574;">"display this"</span>)
<span style="color: #7590db;">display</span> = decorator_function(display)
display()
<span style="color: #4f97d7;">print</span>(<span style="color: #2d9574;">"////////decorator decor without augurment//////////////////////"</span>)
<span style="color: #ce537a; font-weight: bold;">@decorator_function</span>
<span style="color: #4f97d7; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">display1</span>():
<span style="background-color: #292e34;"> </span>   <span style="color: #4f97d7;">print</span>(<span style="color: #2d9574;">"display1 this"</span>)
display1()
<span style="color: #4f97d7;">print</span>(<span style="color: #2d9574;">"////////function decor with augurment//////////////////////"</span>)
<span style="color: #4f97d7; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">display_info</span>(name, age):
<span style="background-color: #292e34;"> </span>   <span style="color: #4f97d7;">print</span>(<span style="color: #2d9574;">"display the name is {}, and the age is {}"</span>.<span style="color: #4f97d7;">format</span>(name, age))
<span style="color: #7590db;">display_info</span> = decorator_function(display_info)
display_info(<span style="color: #2d9574;">"Xiang"</span>, 21)
<span style="color: #4f97d7;">print</span>(<span style="color: #2d9574;">"////////decorator decor with augurment//////////////////////"</span>)
<span style="color: #ce537a; font-weight: bold;">@decorator_function</span>
<span style="color: #4f97d7; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">display_info1</span>(name, age):
<span style="background-color: #292e34;"> </span>   <span style="color: #4f97d7;">print</span>(<span style="color: #2d9574;">"display the name is {}, and the age is {}"</span>.<span style="color: #4f97d7;">format</span>(name, age))
display_info1(<span style="color: #2d9574;">"Xiang"</span>, 21)
<span style="color: #4f97d7;">print</span>(<span style="color: #2d9574;">"/////////class decorator decor/////////////////////"</span>)
<span style="color: #ce537a; font-weight: bold;">@decorator_class</span>
<span style="color: #4f97d7; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">display_info_class</span>(name, age):
<span style="background-color: #292e34;"> </span>   <span style="color: #4f97d7;">print</span>(<span style="color: #2d9574;">"display the name is {}, and the age is {}"</span>.<span style="color: #4f97d7;">format</span>(name, age))
display_info_class(<span style="color: #2d9574;">"Xiang"</span>, 21)
<span style="color: #4f97d7;">print</span>(<span style="color: #2d9574;">"////////class function decor//////////////////////"</span>)
<span style="color: #4f97d7; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">display_info_class</span>(name, age):
<span style="background-color: #292e34;"> </span>   <span style="color: #4f97d7;">print</span>(<span style="color: #2d9574;">"display the name is {}, and the age is {}"</span>.<span style="color: #4f97d7;">format</span>(name, age))
<span style="color: #7590db;">display_info_class1</span> = decorator_class(display_info_class)
display_info_class1(<span style="color: #2d9574;">"Xiang"</span>, 21)



</pre>
</div>
</div>
</div>

<div id="outline-container-orgbf1d916" class="outline-3">
<h3 id="orgbf1d916"><span class="section-number-3">5.16.</span> with * **</h3>
<div class="outline-text-3" id="text-5-16">
<div class="org-src-container">
<pre class="src src-ipython">def function_with_one_star(*d):
    print(d)

def function_with_two_stars(**d):
    print(d)

function_with_one_star(1,2,3)

function_with_two_stars(a=1, b=2, c=3)


</pre>
</div>

<pre class="example">
(1, 2, 3)
{'a': 1, 'b': 2, 'c': 3}
</pre>
</div>
</div>
