content/python.org
** Python Numpy with ~

Wenn we want to filter the we wanted from a np.array,
we can define the filter  with boolen in a np.array,

#+begin_src ipython :results output :exports both
  import numpy as np
  x = np.arange(25).reshape(5,5)
  print(x)

#+end_src

#+RESULTS:
: [[ 0  1  2  3  4]
:  [ 5  6  7  8  9]
:  [10 11 12 13 14]
:  [15 16 17 18 19]
:  [20 21 22 23 24]]
Or
#+begin_src ipython :results output :exports both
  import numpy as np
  xx = np.linspace(0, 24, 25).reshape(5,5)
  print(xx)

#+end_src

#+RESULTS:
: [[ 0.  1.  2.  3.  4.]
:  [ 5.  6.  7.  8.  9.]
:  [10. 11. 12. 13. 14.]
:  [15. 16. 17. 18. 19.]
:  [20. 21. 22. 23. 24.]]

With np.linspace is float number, but arange is int number

#+begin_src ipython :results output :exports both
  import numpy as np
  x = np.arange(25).reshape(5,5)
  y = np.array([False, False, True, True, False])
  print(x[y,2])

#+end_src

#+RESULTS:
: [12 17]

according to   y = np.array([False, False, True, True, False]) to filter
the true position in the third column.

if we want the false position in the third column, with ~ on the filter array

#+begin_src ipython :results output :exports both
  import numpy as np
  x = np.arange(25).reshape(5,5)
  y = np.array([False, False, True, True, False])
  print(x[~y,2])

#+end_src

#+RESULTS:
: [ 2  7 22]

** turtle movement
#+BEGIN_SRC python

  import turtle
  turtle.setup(650, 350, 200, 200)
  turtle.penup()
  turtle.fd(-250)
  turtle.pendown()
  turtle.pensize(25)
  turtle.pencolor("purple")
  turtle.seth(-40)
  for i in range(4):
      turtle.circle(40, 80)
      turtle.circle(-40, 80)
  turtle.circle(40, 80/2)
  turtle.fd(40)
  turtle.circle(16, 180)
  turtle.fd(40*2/3)
  turtle.done()


#+END_SRC

#+RESULTS:

** tempertur converse
#+BEGIN_SRC python
  #TempConver.py
  TempStr = input('请输入带有符号的温度值:')
  if TempStr[-1] in ['F', 'f']:
      C = (eval(TempStr[0:-1]) - 32)/1.8
      print('转换后的温度值为{:.2f}C'.format(C))
  elif TempStr[-1] in ['C', 'c']:
      F = 1.8*eval(TempStr[0:-1]) + 32
      print('转换后的温度值为{:.2f}F'.format(F))
  else:
      print('输入有误')


#+END_SRC
