html/Python.html

<div id="outline-container-org06377c4" class="outline-3">
<h3 id="org06377c4"><span class="section-number-3">5.17.</span> Python Numpy with ~</h3>
<div class="outline-text-3" id="text-5-17">
<p>
Wenn we want to filter the we wanted from a np.array,
we can define the filter  with boolen in a np.array,
</p>

<div class="org-src-container">
<pre class="src src-ipython">import numpy as np
x = np.arange(25).reshape(5,5)
print(x)

</pre>
</div>

<pre class="example">
[[ 0  1  2  3  4]
 [ 5  6  7  8  9]
 [10 11 12 13 14]
 [15 16 17 18 19]
 [20 21 22 23 24]]
</pre>

<p>
Or
</p>
<div class="org-src-container">
<pre class="src src-ipython">import numpy as np
xx = np.linspace(0, 24, 25).reshape(5,5)
print(xx)

</pre>
</div>

<pre class="example">
[[ 0.  1.  2.  3.  4.]
 [ 5.  6.  7.  8.  9.]
 [10. 11. 12. 13. 14.]
 [15. 16. 17. 18. 19.]
 [20. 21. 22. 23. 24.]]
</pre>


<p>
With np.linspace is float number, but arange is int number
</p>

<div class="org-src-container">
<pre class="src src-ipython">import numpy as np
x = np.arange(25).reshape(5,5)
y = np.array([False, False, True, True, False])
print(x[y,2])

</pre>
</div>

<pre class="example">
[12 17]
</pre>


<p>
according to   y = np.array([False, False, True, True, False]) to filter
the true position in the third column.
</p>

<p>
if we want the false position in the third column, with ~ on the filter array
</p>

<div class="org-src-container">
<pre class="src src-ipython">import numpy as np
x = np.arange(25).reshape(5,5)
y = np.array([False, False, True, True, False])
print(x[~y,2])

</pre>
</div>

<pre class="example">
[ 2  7 22]
</pre>
</div>
</div>

<div id="outline-container-org0c74fd8" class="outline-3">
<h3 id="org0c74fd8"><span class="section-number-3">5.18.</span> turtle movement</h3>
<div class="outline-text-3" id="text-5-18">
<div class="org-src-container">
<pre class="src src-python">
<span style="color: #4f97d7; font-weight: bold;">import</span> turtle
turtle.setup(650, 350, 200, 200)
turtle.penup()
turtle.fd(-250)
turtle.pendown()
turtle.pensize(25)
turtle.pencolor(<span style="color: #2d9574;">"purple"</span>)
turtle.seth(-40)
<span style="color: #4f97d7; font-weight: bold;">for</span> i <span style="color: #4f97d7; font-weight: bold;">in</span> <span style="color: #4f97d7;">range</span>(4):
<span style="background-color: #292e34;"> </span>   turtle.circle(40, 80)
<span style="background-color: #292e34;"> </span>   turtle.circle(-40, 80)
turtle.circle(40, 80/2)
turtle.fd(40)
turtle.circle(16, 180)
turtle.fd(40*2/3)
turtle.done()


</pre>
</div>
</div>
</div>

<div id="outline-container-org1b2efdd" class="outline-3">
<h3 id="org1b2efdd"><span class="section-number-3">5.19.</span> tempertur converse</h3>
<div class="outline-text-3" id="text-5-19">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">TempConver.py</span>
<span style="color: #7590db;">TempStr</span> = <span style="color: #4f97d7;">input</span>(<span style="color: #2d9574;">'&#35831;&#36755;&#20837;&#24102;&#26377;&#31526;&#21495;&#30340;&#28201;&#24230;&#20540;:'</span>)
<span style="color: #4f97d7; font-weight: bold;">if</span> TempStr[-1] <span style="color: #4f97d7; font-weight: bold;">in</span> [<span style="color: #2d9574;">'F'</span>, <span style="color: #2d9574;">'f'</span>]:
<span style="background-color: #292e34;"> </span>   <span style="color: #7590db;">C</span> = (<span style="color: #4f97d7;">eval</span>(TempStr[0:-1]) - 32)/1.8
<span style="background-color: #292e34;"> </span>   <span style="color: #4f97d7;">print</span>(<span style="color: #2d9574;">'&#36716;&#25442;&#21518;&#30340;&#28201;&#24230;&#20540;&#20026;{:.2f}C'</span>.<span style="color: #4f97d7;">format</span>(C))
<span style="color: #4f97d7; font-weight: bold;">elif</span> TempStr[-1] <span style="color: #4f97d7; font-weight: bold;">in</span> [<span style="color: #2d9574;">'C'</span>, <span style="color: #2d9574;">'c'</span>]:
<span style="background-color: #292e34;"> </span>   <span style="color: #7590db;">F</span> = 1.8*<span style="color: #4f97d7;">eval</span>(TempStr[0:-1]) + 32
<span style="background-color: #292e34;"> </span>   <span style="color: #4f97d7;">print</span>(<span style="color: #2d9574;">'&#36716;&#25442;&#21518;&#30340;&#28201;&#24230;&#20540;&#20026;{:.2f}F'</span>.<span style="color: #4f97d7;">format</span>(F))
<span style="color: #4f97d7; font-weight: bold;">else</span>:
<span style="background-color: #292e34;"> </span>   <span style="color: #4f97d7;">print</span>(<span style="color: #2d9574;">'&#36755;&#20837;&#26377;&#35823;'</span>)


</pre>
</div>
</div>
</div>
