html/Python.html
<div id="outline-container-org89b6dc1" class="outline-3">
<h3 id="org89b6dc1"><span class="section-number-3">5.20.</span> print current time</h3>
<div class="outline-text-3" id="text-5-20">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #4f97d7; font-weight: bold;">import</span> turtle, time
<span style="color: #4f97d7; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">drawGap</span>():
<span style="background-color: #292e34;"> </span>   turtle.penup()
<span style="background-color: #292e34;"> </span>   turtle.fd(5)
<span style="color: #4f97d7; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">drawLine</span>(draw):
<span style="background-color: #292e34;"> </span>   drawGap()
<span style="background-color: #292e34;"> </span>   turtle.pendown() <span style="color: #4f97d7; font-weight: bold;">if</span> draw <span style="color: #4f97d7; font-weight: bold;">else</span> turtle.penup()
<span style="background-color: #292e34;"> </span>   turtle.fd(40)
<span style="background-color: #292e34;"> </span>   drawGap()
<span style="background-color: #292e34;"> </span>   turtle.right(90)
<span style="color: #4f97d7; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">drawDigit</span>(digit):
<span style="background-color: #292e34;"> </span>   drawLine(<span style="color: #a45bad;">True</span>) <span style="color: #4f97d7; font-weight: bold;">if</span> digit <span style="color: #4f97d7; font-weight: bold;">in</span> [2,3,4,5,6,8,9] <span style="color: #4f97d7; font-weight: bold;">else</span> drawLine(<span style="color: #a45bad;">False</span>)
<span style="background-color: #292e34;"> </span>   drawLine(<span style="color: #a45bad;">True</span>) <span style="color: #4f97d7; font-weight: bold;">if</span> digit <span style="color: #4f97d7; font-weight: bold;">in</span> [0,1,3,4,5,6,7,8,9] <span style="color: #4f97d7; font-weight: bold;">else</span> drawLine(<span style="color: #a45bad;">False</span>)
<span style="background-color: #292e34;"> </span>   drawLine(<span style="color: #a45bad;">True</span>) <span style="color: #4f97d7; font-weight: bold;">if</span> digit <span style="color: #4f97d7; font-weight: bold;">in</span> [0,2,3,5,6,8,9] <span style="color: #4f97d7; font-weight: bold;">else</span> drawLine(<span style="color: #a45bad;">False</span>)
<span style="background-color: #292e34;"> </span>   drawLine(<span style="color: #a45bad;">True</span>) <span style="color: #4f97d7; font-weight: bold;">if</span> digit <span style="color: #4f97d7; font-weight: bold;">in</span> [0,2,6,8] <span style="color: #4f97d7; font-weight: bold;">else</span> drawLine(<span style="color: #a45bad;">False</span>)
<span style="background-color: #292e34;"> </span>   turtle.left(90)
<span style="background-color: #292e34;"> </span>   drawLine(<span style="color: #a45bad;">True</span>) <span style="color: #4f97d7; font-weight: bold;">if</span> digit <span style="color: #4f97d7; font-weight: bold;">in</span> [0,4,5,6,8,9] <span style="color: #4f97d7; font-weight: bold;">else</span> drawLine(<span style="color: #a45bad;">False</span>)
<span style="background-color: #292e34;"> </span>   drawLine(<span style="color: #a45bad;">True</span>) <span style="color: #4f97d7; font-weight: bold;">if</span> digit <span style="color: #4f97d7; font-weight: bold;">in</span> [0,2,3,5,6,7,8,9] <span style="color: #4f97d7; font-weight: bold;">else</span> drawLine(<span style="color: #a45bad;">False</span>)
<span style="background-color: #292e34;"> </span>   drawLine(<span style="color: #a45bad;">True</span>) <span style="color: #4f97d7; font-weight: bold;">if</span> digit <span style="color: #4f97d7; font-weight: bold;">in</span> [0,1,2,3,4,7,8,9] <span style="color: #4f97d7; font-weight: bold;">else</span> drawLine(<span style="color: #a45bad;">False</span>)
<span style="background-color: #292e34;"> </span>   turtle.left(180)
<span style="background-color: #292e34;"> </span>   turtle.penup()
<span style="background-color: #292e34;"> </span>   turtle.fd(20)
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">def drawDate(date):</span>
<span style="color: #2aa1ae; background-color: #292e34;">#     </span><span style="color: #2aa1ae; background-color: #292e34;">for i in date:</span>
<span style="color: #2aa1ae; background-color: #292e34;">#         </span><span style="color: #2aa1ae; background-color: #292e34;">drawDigit(eval(i))</span>
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">def main():</span>
<span style="color: #4f97d7; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">drawDate</span>(date):
<span style="background-color: #292e34;"> </span>   turtle.pencolor(<span style="color: #2d9574;">"red"</span>)
<span style="background-color: #292e34;"> </span>   <span style="color: #4f97d7; font-weight: bold;">for</span> i <span style="color: #4f97d7; font-weight: bold;">in</span> date:
<span style="background-color: #292e34;"> </span>   <span style="background-color: #292e34;"> </span>   <span style="color: #4f97d7; font-weight: bold;">if</span> i == <span style="color: #2d9574;">'-'</span>:
<span style="background-color: #292e34;"> </span>   <span style="background-color: #292e34;"> </span>   <span style="background-color: #292e34;"> </span>   turtle.write(<span style="color: #2d9574;">'&#24180;'</span>, font=(<span style="color: #2d9574;">"Arial"</span>, 18, <span style="color: #2d9574;">"normal"</span>))
<span style="background-color: #292e34;"> </span>   <span style="background-color: #292e34;"> </span>   <span style="background-color: #292e34;"> </span>   turtle.pencolor(<span style="color: #2d9574;">"green"</span>)
<span style="background-color: #292e34;"> </span>   <span style="background-color: #292e34;"> </span>   <span style="background-color: #292e34;"> </span>   turtle.fd(40)
<span style="background-color: #292e34;"> </span>   <span style="background-color: #292e34;"> </span>   <span style="color: #4f97d7; font-weight: bold;">elif</span> i == <span style="color: #2d9574;">'='</span>:
<span style="background-color: #292e34;"> </span>   <span style="background-color: #292e34;"> </span>   <span style="background-color: #292e34;"> </span>   turtle.write(<span style="color: #2d9574;">'&#26376;'</span>, font=(<span style="color: #2d9574;">"Arial"</span>, 18, <span style="color: #2d9574;">"normal"</span>))
<span style="background-color: #292e34;"> </span>   <span style="background-color: #292e34;"> </span>   <span style="background-color: #292e34;"> </span>   turtle.pencolor(<span style="color: #2d9574;">"blue"</span>)
<span style="background-color: #292e34;"> </span>   <span style="background-color: #292e34;"> </span>   <span style="background-color: #292e34;"> </span>   turtle.fd(40)
<span style="background-color: #292e34;"> </span>   <span style="background-color: #292e34;"> </span>   <span style="color: #4f97d7; font-weight: bold;">elif</span> i == <span style="color: #2d9574;">'+'</span>:
<span style="background-color: #292e34;"> </span>   <span style="background-color: #292e34;"> </span>   <span style="background-color: #292e34;"> </span>   turtle.write(<span style="color: #2d9574;">'&#26085;'</span>, font=(<span style="color: #2d9574;">"Arial"</span>, 18, <span style="color: #2d9574;">"normal"</span>))
<span style="background-color: #292e34;"> </span>   <span style="background-color: #292e34;"> </span>   <span style="color: #4f97d7; font-weight: bold;">else</span>:
<span style="background-color: #292e34;"> </span>   <span style="background-color: #292e34;"> </span>   <span style="background-color: #292e34;"> </span>   drawDigit(<span style="color: #4f97d7;">eval</span>(i))
<span style="color: #4f97d7; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">main</span>():
<span style="background-color: #292e34;"> </span>   turtle.setup(800,350,200,200)
<span style="background-color: #292e34;"> </span>   turtle.penup()
<span style="background-color: #292e34;"> </span>   turtle.fd(-300)
<span style="background-color: #292e34;"> </span>   turtle.pensize(5)
<span style="background-color: #292e34;"> </span>   <span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">drawDate('20181010')</span>
<span style="background-color: #292e34;"> </span>   drawDate(time.strftime(<span style="color: #2d9574;">"%Y-%m=%d+"</span>,time.gmtime()))
<span style="background-color: #292e34;"> </span>   turtle.hideturtle()
<span style="background-color: #292e34;"> </span>   turtle.done()
main()

</pre>
</div>
</div>
</div>
