content/python.org
** pandas DataFrame  merge

merge in pandas DataFrame is very similar like join in SQL.
#+begin_src ipython
  DataFrame.merge(right,
                  how='inner', 
                  on=None,
                  left_on=None,
                  right_on=None, 
                  left_index=False,
                  right_index=False, 
                  sort=False,
                  suffixes=('_x', '_y'),
                  copy=True,
                  indicator=False, 
                  validate=None)[source]
#+end_src
how = 'inner', 'outer', 'left', 'right' default is 'inner'
inner: interaction set
output: union set
left : all left 
right : all right



if right_on, left_on, and on is not given, the merge is on the index(row).
we use the frist column from  left and right dataframe to merge, just like the example.
left: 'one' has 0, 1
right: 'one' has 1, 2, 3
the interaction set is only 1 
all columns will be just added together

#+begin_src ipython :results output :exports both
import pandas as pd
dd = {'one':[0, 1 ], 'two':[0, 0], 'three':[1, 1]}
a = pd.DataFrame(data= dd)
b = pd.DataFrame({'zero':[0,0,0], 'one':[1,2,3 ], 'two':[0,0,0 ]})
print(a)
print(b)
print(a.merge(b))
#+end_src

#+RESULTS:
:    one  two  three
: 0    0    0      1
: 1    1    0      1
:    zero  one  two
: 0     0    1    0
: 1     0    2    0
: 2     0    3    0
:    one  two  three  zero
: 0    1    0      1     0

the can also be merge on columns, for each compare elemenet 
in column with out repeated key
#+begin_src ipython :results output :exports both
dd = {'one':[0, 1 ], 'two':[0, 0], 'three':[1, 1]}
a = pd.DataFrame(data= dd)
b = pd.DataFrame({'zero':[0,0,0], 'one':[1,2,3 ], 'two':[0,0,0 ]})
print(a)
print(b)
print(a.merge(b, on='one', how='inner'))

#+end_src

#+RESULTS:
:    one  two  three
: 0    0    0      1
: 1    1    0      1
:    zero  one  two
: 0     0    1    0
: 1     0    2    0
: 2     0    3    0
:    one  two_x  three  zero  two_y
: 0    1      0      1     0      0

if with repeated key, the number will be multipy by its occurrence,
#+begin_src ipython :results output :exports both
dd = {'one':[0, 1 ], 'two':[0, 0], 'three':[1, 1]}
a = pd.DataFrame(data= dd)
b = pd.DataFrame({'zero':[0,0,0], 'one':[1,2,3 ], 'two':[0,0,0 ]})
print(a)
print(b)
print(a.merge(b, on='two', how='inner'))
#+end_src

#+RESULTS:
#+begin_example
   one  two  three
0    0    0      1
1    1    0      1
   zero  one  two
0     0    1    0
1     0    2    0
2     0    3    0
   one_x  two  three  zero  one_y
0      0    0      1     0      1
1      0    0      1     0      2
2      0    0      1     0      3
3      1    0      1     0      1
4      1    0      1     0      2
5      1    0      1     0      3
#+end_example

** filp
:PROPERTIES:
:ID:       6db7b2dc-ccf8-4feb-9ad0-724f66244ad9
:END:

see numpy document [[https://numpy.org/doc/stable/reference/generated/numpy.flip.html][numpy.flip]]
#+begin_src python :results output :exports both
  import numpy as np
  A = np.array([[1,2,3], [4,5,6], [7,8,9]])
  print(A)
  print(A[::-1])
  print(np.all(A[::-1] == np.flip(A, 0)))


#+end_src

#+RESULTS:
: [[1 2 3]
:  [4 5 6]
:  [7 8 9]]
: [[7 8 9]
:  [4 5 6]
:  [1 2 3]]
: True

* python automotion
** system manipulation 
*** os.getcwd()
#+begin_src ipython :results output :exports both
import os
print(os.getcwd())
#+end_src

#+RESULTS:
: /home/silin/Dropbox/subjects

*** os.chdir() 
#+begin_src ipython  :results output :exports both
  # import os
  # os.chdir("../../Schreibtisch")
  # print(os.getcwd())
#+end_src

#+RESULTS:

*** os.listdir()
#+begin_src ipython  :results output :exports both
print(os.listdir())
#+end_src

#+RESULTS:
: []

* PyTorch
** Basic
*** cpu with cuda.gpu 
#+begin_src ipython :results output

  import torch
  import time
  print(torch.__version__)
  print(torch.cuda.is_available)

  a = torch.randn(10000, 1000)
  b = torch.randn(1000, 2000)

  t0 = time.time()
  c = torch.matmul(a, b)
  t1 = time.time()
  print(a.device, t1-t0, c.norm(2))

  device = torch.device('cuda')
  a = a.to(device)
  b = b.to(device)

  t0 = time.time()
  c = torch.matmul(a, b)
  t2 = time.time()
  print(a.device, t2-t0, c.norm(2))


  t0 = time.time()
  c = torch.matmul(a, b)
  t2 = time.time()
  print(a.device, t2-t0, c.norm(2))
#+end_src

#+RESULTS:
: 1.7.0+cu101
: <function is_available at 0x7f58ba0e9d90>
: cpu 0.22681307792663574 tensor(141040.8438)
: cuda:0 0.004456043243408203 tensor(141442.0938, device='cuda:0')
: cuda:0 0.00037932395935058594 tensor(141442.0938, device='cuda:0')

*** auto Derivative

#+begin_src ipython :results output
  import torch
  from torch import autograd

  x = torch.tensor(1.)
  a = torch.tensor(1. , requires_grad=True)
  b = torch.tensor(2. , requires_grad=True)
  c = torch.tensor(3. , requires_grad=True)

  y = a**2*x + b*x + c

  print('before:', a.grad, b.grad, c.grad)
  grad = autograd.grad(y, [a,b,c])
  print('after:', grad[0], grad[1], grad[2])

#+end_src

#+RESULTS:
: before: None None None
: after: tensor(2.) tensor(1.) tensor(1.)

*** small example
#+begin_src ipython :results output
  import torch

  x = torch.ones(2,2,requires_grad=True)
  y = x +2
  z = y*y*3
  out = z.mean()
  out.backward()
  print(x.grad)

#+end_src

#+RESULTS:
: tensor([[4.5000, 4.5000],
:         [4.5000, 4.5000]])


\begin{equation}
x = 
  \left(
  \begin{array}{cc}
          1  & 1  \\
          1  & 1 \\
  \end{array}
  \right)
\end{equation}



\begin{equation}
y =    2 + x =
  \left(
  \begin{array}{cc}
          3  & 3  \\
          3  & 3 \\
  \end{array}
  \right)
\end{equation}


\begin{equation}
z =   3*y*y =
  \left(
  \begin{array}{cc}
          27  & 27  \\
          27  & 27 \\
  \end{array}
  \right)
\end{equation}

$$ out = \frac{1}{4}\sum_{i=1,j=1}^{i=2, j=2}3y_{ij}y_{ij} =\frac{1}{4}\sum_{i=1,j=1}^{i=2, j=2}3(2+x_{ij})(2+x_{ij}) $$

x.grad is to say :
$$ \frac{d(out_{ij})}{d(x_{ij})}  = 3(2+4)/4 = 4.5$$ 





** Function
*** x = x.new_ones(4,3)

