content/python.org
** Iterator DataLoader

here, THE i is the number of iterations, each iteration has 20 iter
#+begin_src ipython :results output
  import torch
  import numpy as np

  i = np.array([a for a in range(100)])
  i = torch.from_numpy(i)

  test = torch.utils.data.DataLoader(i, batch_size=20,shuffle=False)
  testiter = iter(test)

  for k, data in enumerate(testiter):
      print(k)


#+end_src

#+RESULTS:
: 0
: 1
: 2
: 3
: 4

** torch.max
the return is a namedtuple
dim = 0, 1, maximum of rows or columns
#+begin_src ipython :results output
import torch
i = torch.randn(3,4)
print(torch.max(i, 0))
print(torch.max(i, 1))

#+end_src

#+RESULTS:
: torch.return_types.max(
: values=tensor([-0.1560,  0.1561,  0.9781,  0.4501]),
: indices=tensor([1, 0, 1, 0]))
: torch.return_types.max(
: values=tensor([0.4904, 0.9781, 0.2857]),
: indices=tensor([2, 2, 2]))

** exsample 3 ploy
#+begin_src ipython :results output
  import torch
  import math


  class Polynomial3(torch.nn.Module):
      def __init__(self):
          """
          In the constructor we instantiate four parameters and assign them as
          member parameters.
          """
          super().__init__()
          self.a = torch.nn.Parameter(torch.randn(()))
          self.b = torch.nn.Parameter(torch.randn(()))
          self.c = torch.nn.Parameter(torch.randn(()))
          self.d = torch.nn.Parameter(torch.randn(()))

      def forward(self, x):
          """
          In the forward function we accept a Tensor of input data and we must return
          a Tensor of output data. We can use Modules defined in the constructor as
          well as arbitrary operators on Tensors.
          """
          return self.a + self.b * x + self.c * x ** 2 + self.d * x ** 3

      def string(self):
          """
          Just like any class in Python, you can also define custom method on PyTorch modules
          """
          return f'y = {self.a.item()} + {self.b.item()} x + {self.c.item()} x^2 + {self.d.item()} x^3'


  # Create Tensors to hold input and outputs.
  x = torch.linspace(-math.pi, math.pi, 2000)
  y = torch.sin(x)

  # Construct our model by instantiating the class defined above
  model = Polynomial3()

  # Construct our loss function and an Optimizer. The call to model.parameters()
  # in the SGD constructor will contain the learnable parameters of the nn.Linear
  # module which is members of the model.
  criterion = torch.nn.MSELoss(reduction='sum')
  optimizer = torch.optim.SGD(model.parameters(), lr=1e-6)
  for t in range(2000):
      # Forward pass: Compute predicted y by passing x to the model
      y_pred = model(x)

      # Compute and print loss
      loss = criterion(y_pred, y)
      if t % 100 == 99:
          print(t, loss.item())

      # Zero gradients, perform a backward pass, and update the weights.
      optimizer.zero_grad()
      loss.backward()
      optimizer.step()

  print(f'Result: {model.string()}')


#+end_src

* packages
** matplotlib.plot
*** two linear plot 
#+begin_src ipython :results output
  import numpy as np
  import random
  from matplotlib import pyplot as plt

  a = np.array([ x for x in range(10)])
  b = np.array([[random.randint(0,10) for x in range(10)],[random.randint(0,10) for x in range(10)]])
  plt.plot(a,b.T)
  plt.show()


#+end_src

#+RESULTS:

*** simplest linear plot
#+BEGIN_SRC ipython :results output
  import matplotlib.pyplot as plt
  plt.plot([1,2,3,4])
  plt.ylabel('some numbers')
  plt.show()


#+END_SRC

#+RESULTS:

*** simplest point plot
#+BEGIN_SRC ipython :results output
  import matplotlib.pyplot as plt
  plt.plot([1,2,3,4], [1,4,9,16], 'ro')
  plt.axis([0, 6, 0, 20])
  plt.show()


#+END_SRC

#+RESULTS:

*** simplest function plot
#+BEGIN_SRC ipython :results output
  import numpy as np
  import matplotlib.pyplot as plt

  # evenly sampled time at 200ms intervals
  t = np.arange(0., 5., 0.2)

  # red dashes, blue squares and green triangles
  plt.plot(t, t, 'r--', t, t**2, 'bs', t, t**3, 'g^')
  plt.show()


#+END_SRC
*** simplest subplot
#+BEGIN_SRC  ipython :results output
  import numpy as np
  import matplotlib.pyplot as plt

  def f(t):
      return np.exp(-t) * np.cos(2*np.pi*t)

  t1 = np.arange(0.0, 5.0, 0.1)
  t2 = np.arange(0.0, 5.0, 0.02)

  plt.figure(1)
  plt.subplot(211)
  plt.plot(t1, f(t1), 'bo', t2, f(t2), 'k')

  plt.subplot(212)
  plt.plot(t2, np.cos(2*np.pi*t2), 'r--')
  plt.show()


#+END_SRC
*** histogram plot with cusomised legend
#+BEGIN_SRC  ipython :results output
  import numpy as np
  import matplotlib.pyplot as plt

  # Fixing random state for reproducibility
  np.random.seed(19680801)

  mu, sigma = 100, 15
  x = mu + sigma * np.random.randn(10000)

  # the histogram of the data
  n, bins, patches = plt.hist(x, 50, normed=1, facecolor='g', alpha=0.75)


  plt.xlabel('Smarts')
  plt.ylabel('Probability')
  plt.title('Histogram of IQ')
  plt.text(60, .025, r'$\mu=100,\ \sigma=15$')
  plt.axis([40, 160, 0, 0.03])
  plt.grid(True)
  plt.show()


#+END_SRC
*** histogram plot 
#+BEGIN_SRC  ipython :results output
  import numpy as np
  import matplotlib.pyplot as plt

  # Fixing random state for reproducibility
  np.random.seed(19680801)

  mu, sigma = 100, 15
  x = mu + sigma * np.random.randn(100000)

  # the histogram of the data
  n, bins, patches = plt.hist(x, 50, facecolor='g')

  plt.xlabel('Smarts')
  plt.ylabel('Probability')
  plt.title('Histogram of IQ')
  #plt.text(60, .025, r'$\mu=100,\ \sigma=15$')
  #plt.axis([40, 160, 0, 0.03])
  #plt.grid(True)
  plt.show()



#+END_SRC
