html/Python.html




<div id="outline-container-org9cf1e33" class="outline-3">
<h3 id="org9cf1e33"><span class="section-number-3">7.2.</span> Function</h3>
<div class="outline-text-3" id="text-7-2">
</div>
<div id="outline-container-org2f6bc61" class="outline-4">
<h4 id="org2f6bc61"><span class="section-number-4">7.2.1.</span> x = x.new<sub>ones</sub>(4,3)</h4>
</div>
</div>

<div id="outline-container-org24b9eb3" class="outline-3">
<h3 id="org24b9eb3"><span class="section-number-3">7.3.</span> Iterator DataLoader</h3>
<div class="outline-text-3" id="text-7-3">
<p>
here, THE i is the number of iterations, each iteration has 20 iter
</p>
<div class="org-src-container">
<pre class="src src-ipython">import torch
import numpy as np

i = np.array([a for a in range(100)])
i = torch.from_numpy(i)

test = torch.utils.data.DataLoader(i, batch_size=20,shuffle=False)
testiter = iter(test)

for k, data in enumerate(testiter):
    print(k)


</pre>
</div>
</div>
</div>

<div id="outline-container-orgfff9420" class="outline-3">
<h3 id="orgfff9420"><span class="section-number-3">7.4.</span> torch.max</h3>
<div class="outline-text-3" id="text-7-4">
<p>
the return is a namedtuple
dim = 0, 1, maximum of rows or columns
</p>
<div class="org-src-container">
<pre class="src src-ipython">import torch
i = torch.randn(3,4)
print(torch.max(i, 0))
print(torch.max(i, 1))

</pre>
</div>
</div>
</div>

<div id="outline-container-orgf79ed59" class="outline-3">
<h3 id="orgf79ed59"><span class="section-number-3">7.5.</span> exsample 3 ploy</h3>
<div class="outline-text-3" id="text-7-5">
<div class="org-src-container">
<pre class="src src-ipython">import torch
import math


class Polynomial3(torch.nn.Module):
    def __init__(self):
        """
        In the constructor we instantiate four parameters and assign them as
        member parameters.
        """
        super().__init__()
        self.a = torch.nn.Parameter(torch.randn(()))
        self.b = torch.nn.Parameter(torch.randn(()))
        self.c = torch.nn.Parameter(torch.randn(()))
        self.d = torch.nn.Parameter(torch.randn(()))

    def forward(self, x):
        """
        In the forward function we accept a Tensor of input data and we must return
        a Tensor of output data. We can use Modules defined in the constructor as
        well as arbitrary operators on Tensors.
        """
        return self.a + self.b * x + self.c * x ** 2 + self.d * x ** 3

    def string(self):
        """
        Just like any class in Python, you can also define custom method on PyTorch modules
        """
        return f'y = {self.a.item()} + {self.b.item()} x + {self.c.item()} x^2 + {self.d.item()} x^3'


# Create Tensors to hold input and outputs.
x = torch.linspace(-math.pi, math.pi, 2000)
y = torch.sin(x)

# Construct our model by instantiating the class defined above
model = Polynomial3()

# Construct our loss function and an Optimizer. The call to model.parameters()
# in the SGD constructor will contain the learnable parameters of the nn.Linear
# module which is members of the model.
criterion = torch.nn.MSELoss(reduction='sum')
optimizer = torch.optim.SGD(model.parameters(), lr=1e-6)
for t in range(2000):
    # Forward pass: Compute predicted y by passing x to the model
    y_pred = model(x)

    # Compute and print loss
    loss = criterion(y_pred, y)
    if t % 100 == 99:
        print(t, loss.item())

    # Zero gradients, perform a backward pass, and update the weights.
    optimizer.zero_grad()
    loss.backward()
    optimizer.step()

print(f'Result: {model.string()}')


</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgb0c4c79" class="outline-2">
<h2 id="orgb0c4c79"><span class="section-number-2">8.</span> packages</h2>
<div class="outline-text-2" id="text-8">
</div>
<div id="outline-container-orgb4ffb79" class="outline-3">
<h3 id="orgb4ffb79"><span class="section-number-3">8.1.</span> matplotlib.plot</h3>
<div class="outline-text-3" id="text-8-1">
</div>
<div id="outline-container-org5f2255c" class="outline-4">
<h4 id="org5f2255c"><span class="section-number-4">8.1.1.</span> two linear plot</h4>
<div class="outline-text-4" id="text-8-1-1">
<div class="org-src-container">
<pre class="src src-ipython">import numpy as np
import random
from matplotlib import pyplot as plt

a = np.array([ x for x in range(10)])
b = np.array([[random.randint(0,10) for x in range(10)],[random.randint(0,10) for x in range(10)]])
plt.plot(a,b.T)
plt.show()


</pre>
</div>
</div>
</div>

<div id="outline-container-org3c6cb8b" class="outline-4">
<h4 id="org3c6cb8b"><span class="section-number-4">8.1.2.</span> simplest linear plot</h4>
<div class="outline-text-4" id="text-8-1-2">
<div class="org-src-container">
<pre class="src src-ipython">import matplotlib.pyplot as plt
plt.plot([1,2,3,4])
plt.ylabel('some numbers')
plt.show()


</pre>
</div>
</div>
</div>

<div id="outline-container-orge0d2663" class="outline-4">
<h4 id="orge0d2663"><span class="section-number-4">8.1.3.</span> simplest point plot</h4>
<div class="outline-text-4" id="text-8-1-3">
<div class="org-src-container">
<pre class="src src-ipython">import matplotlib.pyplot as plt
plt.plot([1,2,3,4], [1,4,9,16], 'ro')
plt.axis([0, 6, 0, 20])
plt.show()


</pre>
</div>
</div>
</div>

<div id="outline-container-org63525d8" class="outline-4">
<h4 id="org63525d8"><span class="section-number-4">8.1.4.</span> simplest function plot</h4>
<div class="outline-text-4" id="text-8-1-4">
<div class="org-src-container">
<pre class="src src-ipython">import numpy as np
import matplotlib.pyplot as plt

# evenly sampled time at 200ms intervals
t = np.arange(0., 5., 0.2)

# red dashes, blue squares and green triangles
plt.plot(t, t, 'r--', t, t**2, 'bs', t, t**3, 'g^')
plt.show()


</pre>
</div>
</div>
</div>
<div id="outline-container-org2cce819" class="outline-4">
<h4 id="org2cce819"><span class="section-number-4">8.1.5.</span> simplest subplot</h4>
<div class="outline-text-4" id="text-8-1-5">
<div class="org-src-container">
<pre class="src src-ipython">import numpy as np
import matplotlib.pyplot as plt

def f(t):
    return np.exp(-t) * np.cos(2*np.pi*t)

t1 = np.arange(0.0, 5.0, 0.1)
t2 = np.arange(0.0, 5.0, 0.02)

plt.figure(1)
plt.subplot(211)
plt.plot(t1, f(t1), 'bo', t2, f(t2), 'k')

plt.subplot(212)
plt.plot(t2, np.cos(2*np.pi*t2), 'r--')
plt.show()


</pre>
</div>
</div>
</div>
<div id="outline-container-org5ee739f" class="outline-4">
<h4 id="org5ee739f"><span class="section-number-4">8.1.6.</span> histogram plot with cusomised legend</h4>
<div class="outline-text-4" id="text-8-1-6">
<div class="org-src-container">
<pre class="src src-ipython">import numpy as np
import matplotlib.pyplot as plt

# Fixing random state for reproducibility
np.random.seed(19680801)

mu, sigma = 100, 15
x = mu + sigma * np.random.randn(10000)

# the histogram of the data
n, bins, patches = plt.hist(x, 50, normed=1, facecolor='g', alpha=0.75)


plt.xlabel('Smarts')
plt.ylabel('Probability')
plt.title('Histogram of IQ')
plt.text(60, .025, r'$\mu=100,\ \sigma=15$')
plt.axis([40, 160, 0, 0.03])
plt.grid(True)
plt.show()


</pre>
</div>
</div>
</div>
<div id="outline-container-org144770d" class="outline-4">
<h4 id="org144770d"><span class="section-number-4">8.1.7.</span> histogram plot</h4>
<div class="outline-text-4" id="text-8-1-7">
<div class="org-src-container">
<pre class="src src-ipython">import numpy as np
import matplotlib.pyplot as plt

# Fixing random state for reproducibility
np.random.seed(19680801)

mu, sigma = 100, 15
x = mu + sigma * np.random.randn(100000)

# the histogram of the data
n, bins, patches = plt.hist(x, 50, facecolor='g')

plt.xlabel('Smarts')
plt.ylabel('Probability')
plt.title('Histogram of IQ')
#plt.text(60, .025, r'$\mu=100,\ \sigma=15$')
#plt.axis([40, 160, 0, 0.03])
#plt.grid(True)
plt.show()



</pre>
</div>
</div>
</div>
