content/python.org
*** histogram y axis with log index
#+BEGIN_SRC  ipython :results output

  import numpy as np
  import matplotlib.pyplot as plt
  from matplotlib.ticker import NullFormatter  # useful for `logit` scale

  # Fixing random state for reproducibility
  np.random.seed(19680801)

  # make up some data in the interval ]0, 1[
  y = np.random.normal(loc=0.5, scale=0.4, size=1000)
  y = y[(y > 0) & (y < 1)]
  y.sort()
  x = np.arange(len(y))

  # plot with various axes scales
  plt.figure(1)

  # linear
  plt.subplot(221)
  plt.plot(x, y)
  plt.yscale('linear')
  plt.title('linear')
  plt.grid(True)


  # log
  plt.subplot(222)
  plt.plot(x, y)
  plt.yscale('log')
  plt.title('log')
  plt.grid(True)


  # symmetric log
  plt.subplot(223)
  plt.plot(x, y - y.mean())
  plt.yscale('symlog', linthreshy=0.01)
  plt.title('symlog')
  plt.grid(True)

  # logit
  plt.subplot(224)
  plt.plot(x, y)
  plt.yscale('logit')
  plt.title('logit')
  plt.grid(True)
  # Format the minor tick labels of the y-axis into empty strings with
  # `NullFormatter`, to avoid cumbering the axis with too many labels.
  plt.gca().yaxis.set_minor_formatter(NullFormatter())
  # Adjust the subplot layout, because the logit one may take more space
  # than usual, due to y-tick labels like "1 - 10^{-3}"
  plt.subplots_adjust(top=0.92, bottom=0.08, left=0.10, right=0.95, hspace=0.25, wspace=0.35)

  plt.show()


#+END_SRC
*** a example of mean standrad deviation plotting 
#+BEGIN_SRC  ipython :results output
  import matplotlib.pyplot as plt;
  import numpy as np
  import scipy.stats
  import scipy as sp
  from scipy import integrate
  from scipy.optimize import curve_fit

  data = np.genfromtxt('Highz_SN_data.txt');

  redshift = np.array([data[:,2]])
  mu = np.array([data[:,3]])
  velocity = np.array([data[:,4]])
  redshift_mean = np.mean(redshift)
  mu_mean = np.mean(mu)
  velocity_mean = np.mean(velocity)
  redshift_std = np.std(redshift)
  mu_std = np.std(mu)
  velocity_std = np.std(velocity)
  para = ["redshift", "mu", "velocity"]
  x_pos = np.arange(len(para))
  ctes = [redshift_mean, mu_mean, velocity_mean]
  error = [redshift_std, mu_std, velocity_std]


  fig, ax = plt.subplots()
  ax.bar(x_pos, ctes, yerr=error, align='center', alpha=0.5, ecolor='black', capsize=10)
  ax.set_ylabel('Coefficient of Thermal Expansion ($\degree C^{-1}$)')
  ax.set_xticks(x_pos)
  ax.set_xticklabels(para)
  ax.set_title('Coefficent of Thermal Expansion (CTE) of Three Metals')
  ax.yaxis.grid(True)

  # Save the figure and show
  plt.tight_layout()
  plt.savefig('bar_plot_with_error_bars.png')
  plt.show()

#+END_SRC

** pandas 
*** plot.scatter()
#+begin_src python :results output
  import pandas as pd
  import numpy as np
  a = pd.DataFrame(np.random.rand(3,2))
  print(a)
  a.plot.scatter(x=0, y = 1)


#+end_src

#+RESULTS:
:           0         1
: 0  0.768941  0.501116
: 1  0.514047  0.526439
: 2  0.843669  0.523868

* Tensorflow 1
** Constand additional und multiply
*** addition
#+BEGIN_SRC python   :results output :session
  import tensorflow as tf
  a = tf.constant([1.0, 2.0])
  b = tf.constant([3.0, 4.0])

  a_m = tf.constant([[1.0, 2.0]])
  b_m = tf.constant([[3.0], [4.0]])

  result_add = a + b
  result_multpl = tf.matmul(a_m, b_m)

  with tf.Session() as sess:
      print (sess.run(result_add))
      print (sess.run(result_multpl))

  print (result_add)
  print (result_multpl)
#+END_SRC

*** mpppultiply

#+BEGIN_SRC python   :results output :session

  import tensorflow as tf
  #创建常量
  m1= tf.constant([[3,3]])
  m2=tf.constant([[1],[2]])
  #相乘
  product = tf.matmul(m1,m2)
  print(product)

  #定义一个会话，启动默认图
  sess = tf.Session()
  #调用sess，执行乘法运算
  result = sess.run(product)
  print(result)
  #不要忘了关闭sess
  sess.close()

  with tf.Session() as sess:
      result = sess.run(product)
      print(result)
  #使用with不需要专门关闭sess


#+END_SRC

#+RESULTS:
: Tensor("MatMul:0", shape=(1, 1), dtype=int32)
: [[9]]
: [[9]]

** Variable
*** the first using of variable & subtract add 
#+BEGIN_SRC python :results output
  import tensorflow as tf
  x = tf.Variable([1,2])
  a = tf.constant([3,3])
  sub = tf.subtract(x,a)
  add = tf.add(x,sub)
# 对于变量，要初始化init
  init = tf.global_variables_initializer()
  with tf.Session() as sess:
      sess.run(init)
      print(sess.run(sub))
      print(sess.run(add))


#+END_SRC

#+RESULTS:
: [-2 -1]
: [-1  1]

