html/Python.html
<div id="outline-container-org14902b5" class="outline-4">
<h4 id="org14902b5"><span class="section-number-4">8.1.8.</span> histogram y axis with log index</h4>
<div class="outline-text-4" id="text-8-1-8">
<div class="org-src-container">
<pre class="src src-ipython">
import numpy as np
import matplotlib.pyplot as plt
from matplotlib.ticker import NullFormatter  # useful for `logit` scale

# Fixing random state for reproducibility
np.random.seed(19680801)

# make up some data in the interval ]0, 1[
y = np.random.normal(loc=0.5, scale=0.4, size=1000)
y = y[(y &gt; 0) &amp; (y &lt; 1)]
y.sort()
x = np.arange(len(y))

# plot with various axes scales
plt.figure(1)

# linear
plt.subplot(221)
plt.plot(x, y)
plt.yscale('linear')
plt.title('linear')
plt.grid(True)


# log
plt.subplot(222)
plt.plot(x, y)
plt.yscale('log')
plt.title('log')
plt.grid(True)


# symmetric log
plt.subplot(223)
plt.plot(x, y - y.mean())
plt.yscale('symlog', linthreshy=0.01)
plt.title('symlog')
plt.grid(True)

# logit
plt.subplot(224)
plt.plot(x, y)
plt.yscale('logit')
plt.title('logit')
plt.grid(True)
# Format the minor tick labels of the y-axis into empty strings with
# `NullFormatter`, to avoid cumbering the axis with too many labels.
plt.gca().yaxis.set_minor_formatter(NullFormatter())
# Adjust the subplot layout, because the logit one may take more space
# than usual, due to y-tick labels like "1 - 10^{-3}"
plt.subplots_adjust(top=0.92, bottom=0.08, left=0.10, right=0.95, hspace=0.25, wspace=0.35)

plt.show()


</pre>
</div>
</div>
</div>
<div id="outline-container-orgc31d2b5" class="outline-4">
<h4 id="orgc31d2b5"><span class="section-number-4">8.1.9.</span> a example of mean standrad deviation plotting</h4>
<div class="outline-text-4" id="text-8-1-9">
<div class="org-src-container">
<pre class="src src-ipython">import matplotlib.pyplot as plt;
import numpy as np
import scipy.stats
import scipy as sp
from scipy import integrate
from scipy.optimize import curve_fit

data = np.genfromtxt('Highz_SN_data.txt');

redshift = np.array([data[:,2]])
mu = np.array([data[:,3]])
velocity = np.array([data[:,4]])
redshift_mean = np.mean(redshift)
mu_mean = np.mean(mu)
velocity_mean = np.mean(velocity)
redshift_std = np.std(redshift)
mu_std = np.std(mu)
velocity_std = np.std(velocity)
para = ["redshift", "mu", "velocity"]
x_pos = np.arange(len(para))
ctes = [redshift_mean, mu_mean, velocity_mean]
error = [redshift_std, mu_std, velocity_std]


fig, ax = plt.subplots()
ax.bar(x_pos, ctes, yerr=error, align='center', alpha=0.5, ecolor='black', capsize=10)
ax.set_ylabel('Coefficient of Thermal Expansion ($\degree C^{-1}$)')
ax.set_xticks(x_pos)
ax.set_xticklabels(para)
ax.set_title('Coefficent of Thermal Expansion (CTE) of Three Metals')
ax.yaxis.grid(True)

# Save the figure and show
plt.tight_layout()
plt.savefig('bar_plot_with_error_bars.png')
plt.show()

</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org309dde6" class="outline-3">
<h3 id="org309dde6"><span class="section-number-3">8.2.</span> pandas</h3>
<div class="outline-text-3" id="text-8-2">
</div>
<div id="outline-container-orgab87275" class="outline-4">
<h4 id="orgab87275"><span class="section-number-4">8.2.1.</span> plot.scatter()</h4>
<div class="outline-text-4" id="text-8-2-1">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #4f97d7; font-weight: bold;">import</span> pandas <span style="color: #4f97d7; font-weight: bold;">as</span> pd
<span style="color: #4f97d7; font-weight: bold;">import</span> numpy <span style="color: #4f97d7; font-weight: bold;">as</span> np
<span style="color: #7590db;">a</span> = pd.DataFrame(np.random.rand(3,2))
<span style="color: #4f97d7;">print</span>(a)
a.plot.scatter(x=0, y = 1)


</pre>
</div>
</div>
</div>
</div>
</div>

<div id="outline-container-org89cb34f" class="outline-2">
<h2 id="org89cb34f"><span class="section-number-2">9.</span> Tensorflow 1</h2>
<div class="outline-text-2" id="text-9">
</div>
<div id="outline-container-org4352160" class="outline-3">
<h3 id="org4352160"><span class="section-number-3">9.1.</span> Constand additional und multiply</h3>
<div class="outline-text-3" id="text-9-1">
</div>
<div id="outline-container-org046cb69" class="outline-4">
<h4 id="org046cb69"><span class="section-number-4">9.1.1.</span> addition</h4>
<div class="outline-text-4" id="text-9-1-1">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #4f97d7; font-weight: bold;">import</span> tensorflow <span style="color: #4f97d7; font-weight: bold;">as</span> tf
<span style="color: #7590db;">a</span> = tf.constant([1.0, 2.0])
<span style="color: #7590db;">b</span> = tf.constant([3.0, 4.0])

<span style="color: #7590db;">a_m</span> = tf.constant([[1.0, 2.0]])
<span style="color: #7590db;">b_m</span> = tf.constant([[3.0], [4.0]])

<span style="color: #7590db;">result_add</span> = a + b
<span style="color: #7590db;">result_multpl</span> = tf.matmul(a_m, b_m)

<span style="color: #4f97d7; font-weight: bold;">with</span> tf.Session() <span style="color: #4f97d7; font-weight: bold;">as</span> sess:
<span style="background-color: #292e34;"> </span>   <span style="color: #4f97d7;">print</span> (sess.run(result_add))
<span style="background-color: #292e34;"> </span>   <span style="color: #4f97d7;">print</span> (sess.run(result_multpl))

<span style="color: #4f97d7;">print</span> (result_add)
<span style="color: #4f97d7;">print</span> (result_multpl)
</pre>
</div>
</div>
</div>

<div id="outline-container-org123f7bc" class="outline-4">
<h4 id="org123f7bc"><span class="section-number-4">9.1.2.</span> mpppultiply</h4>
<div class="outline-text-4" id="text-9-1-2">
<div class="org-src-container">
<pre class="src src-python">
<span style="color: #4f97d7; font-weight: bold;">import</span> tensorflow <span style="color: #4f97d7; font-weight: bold;">as</span> tf
<span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">&#21019;&#24314;&#24120;&#37327;</span>
<span style="color: #7590db;">m1</span>= tf.constant([[3,3]])
<span style="color: #7590db;">m2</span>=tf.constant([[1],[2]])
<span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">&#30456;&#20056;</span>
<span style="color: #7590db;">product</span> = tf.matmul(m1,m2)
<span style="color: #4f97d7;">print</span>(product)

<span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">&#23450;&#20041;&#19968;&#20010;&#20250;&#35805;&#65292;&#21551;&#21160;&#40664;&#35748;&#22270;</span>
<span style="color: #7590db;">sess</span> = tf.Session()
<span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">&#35843;&#29992;sess&#65292;&#25191;&#34892;&#20056;&#27861;&#36816;&#31639;</span>
<span style="color: #7590db;">result</span> = sess.run(product)
<span style="color: #4f97d7;">print</span>(result)
<span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">&#19981;&#35201;&#24536;&#20102;&#20851;&#38381;sess</span>
sess.close()

<span style="color: #4f97d7; font-weight: bold;">with</span> tf.Session() <span style="color: #4f97d7; font-weight: bold;">as</span> sess:
<span style="background-color: #292e34;"> </span>   <span style="color: #7590db;">result</span> = sess.run(product)
<span style="background-color: #292e34;"> </span>   <span style="color: #4f97d7;">print</span>(result)
<span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">&#20351;&#29992;with&#19981;&#38656;&#35201;&#19987;&#38376;&#20851;&#38381;sess</span>


</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org913895e" class="outline-3">
<h3 id="org913895e"><span class="section-number-3">9.2.</span> Variable</h3>
<div class="outline-text-3" id="text-9-2">
</div>
<div id="outline-container-org11bcc40" class="outline-4">
<h4 id="org11bcc40"><span class="section-number-4">9.2.1.</span> the first using of variable &amp; subtract add</h4>
<div class="outline-text-4" id="text-9-2-1">
<div class="org-src-container">
<pre class="src src-python"><span style="background-color: #292e34;"> </span> <span style="color: #4f97d7; font-weight: bold;">import</span> tensorflow <span style="color: #4f97d7; font-weight: bold;">as</span> tf
<span style="background-color: #292e34;"> </span> <span style="color: #7590db;">x</span> = tf.Variable([1,2])
<span style="background-color: #292e34;"> </span> <span style="color: #7590db;">a</span> = tf.constant([3,3])
<span style="background-color: #292e34;"> </span> <span style="color: #7590db;">sub</span> = tf.subtract(x,a)
<span style="background-color: #292e34;"> </span> <span style="color: #7590db;">add</span> = tf.add(x,sub)
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">&#23545;&#20110;&#21464;&#37327;&#65292;&#35201;&#21021;&#22987;&#21270;init</span>
<span style="background-color: #292e34;"> </span> <span style="color: #7590db;">init</span> = tf.global_variables_initializer()
<span style="background-color: #292e34;"> </span> <span style="color: #4f97d7; font-weight: bold;">with</span> tf.Session() <span style="color: #4f97d7; font-weight: bold;">as</span> sess:
<span style="background-color: #292e34;"> </span>   <span style="background-color: #292e34;"> </span> sess.run(init)
<span style="background-color: #292e34;"> </span>   <span style="background-color: #292e34;"> </span> <span style="color: #4f97d7;">print</span>(sess.run(sub))
<span style="background-color: #292e34;"> </span>   <span style="background-color: #292e34;"> </span> <span style="color: #4f97d7;">print</span>(sess.run(add))


</pre>
</div>
</div>
</div>
