content/python.org
*** assign a value for variable and update & assign 
#+BEGIN_SRC python :results output
  #............................．．．．．．变量计算
  #变量可以被起名，初始化为０
  import tensorflow as tf
  state = tf.Variable(0, name = 'counter')
  new_value = tf.add(state,1)
  #赋值功能assign
  update = tf.assign(state,new_value)
  init = tf.global_variables_initializer()
  with tf.Session() as sess:
      sess.run(init)
      print(state)
      for _ in range(5):
          sess.run(update)
          print(sess.run(state))
          print(sess.run(update))


#+END_SRC

#+RESULTS:
#+begin_example
<tf.Variable 'counter:0' shape=() dtype=int32_ref>
1
2
3
4
5
6
7
8
9
10
#+end_example

*** fetch and Feed &placeholder
#+BEGIN_SRC python :results output
  import tensorflow as tf
  # Fetch 在一个会话里执行多个op
  input1 = tf.constant(3.0)
  input2 = tf.constant(2.0)
  input3 = tf.constant(5.0)

  add = tf.add(input2,input3)
  mul = tf.multiply(input1,add)

  with tf.Session() as sess:
      result = sess.run([add,mul])  #有[]
      print(result)

  #------------------Feed
  #创建占位符
  input4= tf.placeholder(tf.float32)
  input5 = tf.placeholder(tf.float32)
  output = tf.multiply(input4, input5)
  with tf.Session() as sess:
      print(sess.run(output,feed_dict = {input4:[7.0],input5:[2.0]}))  #随后赋值是用字典的方式进行的feed_dict = {input4:[7.0],input5:[2.0]}, 数字还加了方括号．


#+END_SRC

#+RESULTS:
: [7.0, 21.0]
: [14.]

** Tuning
*** change learing rate
#+BEGIN_SRC python
  #coding:utf-8

  import tensorflow as tf
  LEARING_RATE_BASE = 0.1
  LEARING_RATE_DECAY = 0.99
  LEARING_RATE_STEP= 1

  global_step = tf.Variable(0,trainable = False)
  learning_rate = tf.train.exponential_decay(LEARING_RATE_BASE, global_step,
  LEARING_RATE_STEP, LEARING_RATE_DECAY, staircase = True)
  
  w = tf.Variable(tf.constant(5, dtype = tf.float32))
  loss = tf.square(w+1)

  train_step = tf.train.GradientDescentOptimizer(learning_rate).minimize(loss,global_step = global_step)

  with tf.Session() as sess:
      init_op = tf.global_variables_initializer()
      sess.run(init_op)
      for i in range(40):
          sess.run(train_step)
          learnin_rate_val = sess.run(learning_rate)
          global_step_val = sess.run(global_step)
          w_val = sess.run(w)
          loss_val = sess.run(loss)
          print(" After {} steps: global_step is {}, w is {}, learnin_rate is {}, loss is {}"
  .format(i, global_step_val, w_val, learnin_rate_val, loss_val))


#+END_SRC
*** learing rate for loss
#+BEGIN_SRC python :results output
  import tensorflow as tf
  w = tf.Variable(tf.constant(5,dtype=tf.float32))
  loss = tf.square(w+1)
  train_step = tf.train.GradientDescentOptimizer(0.2).minimize(loss)

  with tf.Session() as sess:
      init_op=tf.global_variables_initializer()
      sess.run(init_op)
      for i in range(50):
          sess.run(train_step)
          w_var = sess.run(w)
          loss_val = sess.run(loss)
          print("After {} steps: w is {}, loss is {}".format(i,w_var,loss_val))
          #print("After %s steps: w is %f, loss is %f." %(i,w_var, loss_val))


#+END_SRC

** train examples
