html/Python.html

<div id="outline-container-orge5b655d" class="outline-4">
<h4 id="orge5b655d"><span class="section-number-4">9.2.2.</span> assign a value for variable and update &amp; assign</h4>
<div class="outline-text-4" id="text-9-2-2">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">............................&#65294;&#65294;&#65294;&#65294;&#65294;&#65294;&#21464;&#37327;&#35745;&#31639;</span>
<span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">&#21464;&#37327;&#21487;&#20197;&#34987;&#36215;&#21517;&#65292;&#21021;&#22987;&#21270;&#20026;&#65296;</span>
<span style="color: #4f97d7; font-weight: bold;">import</span> tensorflow <span style="color: #4f97d7; font-weight: bold;">as</span> tf
<span style="color: #7590db;">state</span> = tf.Variable(0, name = <span style="color: #2d9574;">'counter'</span>)
<span style="color: #7590db;">new_value</span> = tf.add(state,1)
<span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">&#36171;&#20540;&#21151;&#33021;assign</span>
<span style="color: #7590db;">update</span> = tf.assign(state,new_value)
<span style="color: #7590db;">init</span> = tf.global_variables_initializer()
<span style="color: #4f97d7; font-weight: bold;">with</span> tf.Session() <span style="color: #4f97d7; font-weight: bold;">as</span> sess:
<span style="background-color: #292e34;"> </span>   sess.run(init)
<span style="background-color: #292e34;"> </span>   <span style="color: #4f97d7;">print</span>(state)
<span style="background-color: #292e34;"> </span>   <span style="color: #4f97d7; font-weight: bold;">for</span> _ <span style="color: #4f97d7; font-weight: bold;">in</span> <span style="color: #4f97d7;">range</span>(5):
<span style="background-color: #292e34;"> </span>   <span style="background-color: #292e34;"> </span>   sess.run(update)
<span style="background-color: #292e34;"> </span>   <span style="background-color: #292e34;"> </span>   <span style="color: #4f97d7;">print</span>(sess.run(state))
<span style="background-color: #292e34;"> </span>   <span style="background-color: #292e34;"> </span>   <span style="color: #4f97d7;">print</span>(sess.run(update))


</pre>
</div>
</div>
</div>

<div id="outline-container-org9a22082" class="outline-4">
<h4 id="org9a22082"><span class="section-number-4">9.2.3.</span> fetch and Feed &amp;placeholder</h4>
<div class="outline-text-4" id="text-9-2-3">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #4f97d7; font-weight: bold;">import</span> tensorflow <span style="color: #4f97d7; font-weight: bold;">as</span> tf
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">Fetch &#22312;&#19968;&#20010;&#20250;&#35805;&#37324;&#25191;&#34892;&#22810;&#20010;op</span>
<span style="color: #7590db;">input1</span> = tf.constant(3.0)
<span style="color: #7590db;">input2</span> = tf.constant(2.0)
<span style="color: #7590db;">input3</span> = tf.constant(5.0)

<span style="color: #7590db;">add</span> = tf.add(input2,input3)
<span style="color: #7590db;">mul</span> = tf.multiply(input1,add)

<span style="color: #4f97d7; font-weight: bold;">with</span> tf.Session() <span style="color: #4f97d7; font-weight: bold;">as</span> sess:
<span style="background-color: #292e34;"> </span>   <span style="color: #7590db;">result</span> = sess.run([add,mul])  <span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">&#26377;[]</span>
<span style="background-color: #292e34;"> </span>   <span style="color: #4f97d7;">print</span>(result)

<span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">------------------Feed</span>
<span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">&#21019;&#24314;&#21344;&#20301;&#31526;</span>
<span style="color: #7590db;">input4</span>= tf.placeholder(tf.float32)
<span style="color: #7590db;">input5</span> = tf.placeholder(tf.float32)
<span style="color: #7590db;">output</span> = tf.multiply(input4, input5)
<span style="color: #4f97d7; font-weight: bold;">with</span> tf.Session() <span style="color: #4f97d7; font-weight: bold;">as</span> sess:
<span style="background-color: #292e34;"> </span>   <span style="color: #4f97d7;">print</span>(sess.run(output,feed_dict = {<span style="color: #7590db;">input4</span>:[7.0],input5:[2.0]}))  <span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">&#38543;&#21518;&#36171;&#20540;&#26159;&#29992;&#23383;&#20856;&#30340;&#26041;&#24335;&#36827;&#34892;&#30340;feed_dict = {input4:[7.0],input5:[2.0]}, &#25968;&#23383;&#36824;&#21152;&#20102;&#26041;&#25324;&#21495;&#65294;</span>


</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org451efb4" class="outline-3">
<h3 id="org451efb4"><span class="section-number-3">9.3.</span> Tuning</h3>
<div class="outline-text-3" id="text-9-3">
</div>
<div id="outline-container-orgf44870d" class="outline-4">
<h4 id="orgf44870d"><span class="section-number-4">9.3.1.</span> change learing rate</h4>
<div class="outline-text-4" id="text-9-3-1">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">coding:utf-8</span>

<span style="color: #4f97d7; font-weight: bold;">import</span> tensorflow <span style="color: #4f97d7; font-weight: bold;">as</span> tf
<span style="color: #7590db;">LEARING_RATE_BASE</span> = 0.1
<span style="color: #7590db;">LEARING_RATE_DECAY</span> = 0.99
<span style="color: #7590db;">LEARING_RATE_STEP</span>= 1

<span style="color: #7590db;">global_step</span> = tf.Variable(0,trainable = <span style="color: #a45bad;">False</span>)
<span style="color: #7590db;">learning_rate</span> = tf.train.exponential_decay(LEARING_RATE_BASE, global_step,
LEARING_RATE_STEP, LEARING_RATE_DECAY, staircase = <span style="color: #a45bad;">True</span>)

<span style="color: #7590db;">w</span> = tf.Variable(tf.constant(5, dtype = tf.float32))
<span style="color: #7590db;">loss</span> = tf.square(w+1)

<span style="color: #7590db;">train_step</span> = tf.train.GradientDescentOptimizer(learning_rate).minimize(loss,global_step = global_step)

<span style="color: #4f97d7; font-weight: bold;">with</span> tf.Session() <span style="color: #4f97d7; font-weight: bold;">as</span> sess:
<span style="background-color: #292e34;"> </span>   <span style="color: #7590db;">init_op</span> = tf.global_variables_initializer()
<span style="background-color: #292e34;"> </span>   sess.run(init_op)
<span style="background-color: #292e34;"> </span>   <span style="color: #4f97d7; font-weight: bold;">for</span> i <span style="color: #4f97d7; font-weight: bold;">in</span> <span style="color: #4f97d7;">range</span>(40):
<span style="background-color: #292e34;"> </span>   <span style="background-color: #292e34;"> </span>   sess.run(train_step)
<span style="background-color: #292e34;"> </span>   <span style="background-color: #292e34;"> </span>   <span style="color: #7590db;">learnin_rate_val</span> = sess.run(learning_rate)
<span style="background-color: #292e34;"> </span>   <span style="background-color: #292e34;"> </span>   <span style="color: #7590db;">global_step_val</span> = sess.run(global_step)
<span style="background-color: #292e34;"> </span>   <span style="background-color: #292e34;"> </span>   <span style="color: #7590db;">w_val</span> = sess.run(w)
<span style="background-color: #292e34;"> </span>   <span style="background-color: #292e34;"> </span>   <span style="color: #7590db;">loss_val</span> = sess.run(loss)
<span style="background-color: #292e34;"> </span>   <span style="background-color: #292e34;"> </span>   <span style="color: #4f97d7;">print</span>(<span style="color: #2d9574;">" After {} steps: global_step is {}, w is {}, learnin_rate is {}, loss is {}"</span>
.<span style="color: #4f97d7;">format</span>(i, global_step_val, w_val, learnin_rate_val, loss_val))


</pre>
</div>
</div>
</div>
<div id="outline-container-orgd9d1538" class="outline-4">
<h4 id="orgd9d1538"><span class="section-number-4">9.3.2.</span> learing rate for loss</h4>
<div class="outline-text-4" id="text-9-3-2">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #4f97d7; font-weight: bold;">import</span> tensorflow <span style="color: #4f97d7; font-weight: bold;">as</span> tf
<span style="color: #7590db;">w</span> = tf.Variable(tf.constant(5,dtype=tf.float32))
<span style="color: #7590db;">loss</span> = tf.square(w+1)
<span style="color: #7590db;">train_step</span> = tf.train.GradientDescentOptimizer(0.2).minimize(loss)

<span style="color: #4f97d7; font-weight: bold;">with</span> tf.Session() <span style="color: #4f97d7; font-weight: bold;">as</span> sess:
<span style="background-color: #292e34;"> </span>   <span style="color: #7590db;">init_op</span>=tf.global_variables_initializer()
<span style="background-color: #292e34;"> </span>   sess.run(init_op)
<span style="background-color: #292e34;"> </span>   <span style="color: #4f97d7; font-weight: bold;">for</span> i <span style="color: #4f97d7; font-weight: bold;">in</span> <span style="color: #4f97d7;">range</span>(50):
<span style="background-color: #292e34;"> </span>   <span style="background-color: #292e34;"> </span>   sess.run(train_step)
<span style="background-color: #292e34;"> </span>   <span style="background-color: #292e34;"> </span>   <span style="color: #7590db;">w_var</span> = sess.run(w)
<span style="background-color: #292e34;"> </span>   <span style="background-color: #292e34;"> </span>   <span style="color: #7590db;">loss_val</span> = sess.run(loss)
<span style="background-color: #292e34;"> </span>   <span style="background-color: #292e34;"> </span>   <span style="color: #4f97d7;">print</span>(<span style="color: #2d9574;">"After {} steps: w is {}, loss is {}"</span>.<span style="color: #4f97d7;">format</span>(i,w_var,loss_val))
<span style="background-color: #292e34;"> </span>   <span style="background-color: #292e34;"> </span>   <span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">print("After %s steps: w is %f, loss is %f." %(i,w_var, loss_val))</span>


</pre>
</div>
</div>
</div>
</div>
