content/python.org
*** the first train case
#+BEGIN_SRC python :results output
  import tensorflow as tf
  import numpy as np
  import matplotlib.pyplot as plt
  #生成随机数据
  x_date = np.random.rand(100)
  y_date = x_date*0.4 + 2

  #构造线性模型
  b = tf.Variable(0.)
  k = tf.Variable(0.)
  y = k*x_date + b

  #构造二次代价函数
  loss = tf.reduce_mean(tf.square(y_date-y))
  #定义梯度下降的优化器
  optimizer = tf.train.GradientDescentOptimizer(0.2)
  #定义一个最小化代价函数
  train = optimizer.minimize(loss)
  init = tf.global_variables_initializer()
  with tf.Session() as sess:
      sess.run(init)
      for steps in range(201):
          sess.run(train)
          if steps%20 == 0:
              print(steps, sess.run([k,b]))
      prediction_value = sess.run(y)
      plt.figure()
      plt.scatter(x_date, y_date)
      plt.plot(x_date,prediction_value,'r-',lw=5)
      plt.show()



#+END_SRC

#+RESULTS:
#+begin_example
0 [0.44114023, 0.87820524]
20 [0.7041128, 1.841991]
40 [0.58822596, 1.9022033]
60 [0.5164994, 1.9394703]
80 [0.47210538, 1.9625362]
100 [0.44462854, 1.9768122]
120 [0.4276222, 1.9856484]
140 [0.4170963, 1.9911172]
160 [0.41058153, 1.9945022]
180 [0.40654916, 1.9965973]
200 [0.40405348, 1.9978939]
#+end_example

*** non linear regression case
#+BEGIN_SRC python
  #----------------------------非线性回归
  import tensorflow as tf
  import numpy as np
  import matplotlib.pyplot as plt

  #构造数据
  x_date = np.linspace (-0.5,0.5,100)[:,np.newaxis] #np.newaxis 功能同None，将行变列
  noise = np.random.normal(0,0.02,x_date.shape)
  y_date = np.square(x_date)+noise

  x = tf.placeholder(tf.float32,[None,1])
  y = tf.placeholder(tf.float32,[None,1])

  #构建神经网络
  Weight_L1 = tf.Variable(tf.random_normal([1,10]))
  Biase_L1 = tf.Variable(tf.zeros([1,10]))
  Wx_plus_b_L1 = tf.matmul(x,Weight_L1)+Biase_L1
  L1 = tf.nn.tanh(Wx_plus_b_L1)

  #定义输出层
  Weight_L2 = tf.Variable(tf.random_normal([10,1]))
  Biase_L2 = tf.Variable(tf.zeros([1,1]))
  Wx_plus_b_L2 = tf.matmul(L1,Weight_L2)+ Biase_L2
  prediction = tf.nn.tanh(Wx_plus_b_L2)

  #二次代价函数
  loss = tf.reduce_mean(tf.square(y-prediction))
  train_step = tf.train.GradientDescentOptimizer(0.1).minimize(loss)
  with tf.Session() as sess:
      sess.run(tf.global_variables_initializer())
      for _ in range(2000):
          sess.run(train_step,feed_dict={x:x_date,y:y_date})

      #训练好后，用来做预测
      prediction_value = sess.run(prediction,feed_dict={x:x_date})
      plt.figure()
      plt.scatter(x_date, y_date)
      plt.plot(x_date,prediction_value,'r-',lw=5)
      plt.show()


#+END_SRC

#+RESULTS:
: None

