html/Python.html

<div id="outline-container-org8b444ce" class="outline-3">
<h3 id="org8b444ce"><span class="section-number-3">9.4.</span> train examples</h3>
<div class="outline-text-3" id="text-9-4">
</div>
<div id="outline-container-org261f7c0" class="outline-4">
<h4 id="org261f7c0"><span class="section-number-4">9.4.1.</span> the first train case</h4>
<div class="outline-text-4" id="text-9-4-1">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #4f97d7; font-weight: bold;">import</span> tensorflow <span style="color: #4f97d7; font-weight: bold;">as</span> tf
<span style="color: #4f97d7; font-weight: bold;">import</span> numpy <span style="color: #4f97d7; font-weight: bold;">as</span> np
<span style="color: #4f97d7; font-weight: bold;">import</span> matplotlib.pyplot <span style="color: #4f97d7; font-weight: bold;">as</span> plt
<span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">&#29983;&#25104;&#38543;&#26426;&#25968;&#25454;</span>
<span style="color: #7590db;">x_date</span> = np.random.rand(100)
<span style="color: #7590db;">y_date</span> = x_date*0.4 + 2

<span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">&#26500;&#36896;&#32447;&#24615;&#27169;&#22411;</span>
<span style="color: #7590db;">b</span> = tf.Variable(0.)
<span style="color: #7590db;">k</span> = tf.Variable(0.)
<span style="color: #7590db;">y</span> = k*x_date + b

<span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">&#26500;&#36896;&#20108;&#27425;&#20195;&#20215;&#20989;&#25968;</span>
<span style="color: #7590db;">loss</span> = tf.reduce_mean(tf.square(y_date-y))
<span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">&#23450;&#20041;&#26799;&#24230;&#19979;&#38477;&#30340;&#20248;&#21270;&#22120;</span>
<span style="color: #7590db;">optimizer</span> = tf.train.GradientDescentOptimizer(0.2)
<span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">&#23450;&#20041;&#19968;&#20010;&#26368;&#23567;&#21270;&#20195;&#20215;&#20989;&#25968;</span>
<span style="color: #7590db;">train</span> = optimizer.minimize(loss)
<span style="color: #7590db;">init</span> = tf.global_variables_initializer()
<span style="color: #4f97d7; font-weight: bold;">with</span> tf.Session() <span style="color: #4f97d7; font-weight: bold;">as</span> sess:
<span style="background-color: #292e34;"> </span>   sess.run(init)
<span style="background-color: #292e34;"> </span>   <span style="color: #4f97d7; font-weight: bold;">for</span> steps <span style="color: #4f97d7; font-weight: bold;">in</span> <span style="color: #4f97d7;">range</span>(201):
<span style="background-color: #292e34;"> </span>   <span style="background-color: #292e34;"> </span>   sess.run(train)
<span style="background-color: #292e34;"> </span>   <span style="background-color: #292e34;"> </span>   <span style="color: #4f97d7; font-weight: bold;">if</span> steps%20 == 0:
<span style="background-color: #292e34;"> </span>   <span style="background-color: #292e34;"> </span>   <span style="background-color: #292e34;"> </span>   <span style="color: #4f97d7;">print</span>(steps, sess.run([k,b]))
<span style="background-color: #292e34;"> </span>   <span style="color: #7590db;">prediction_value</span> = sess.run(y)
<span style="background-color: #292e34;"> </span>   plt.figure()
<span style="background-color: #292e34;"> </span>   plt.scatter(x_date, y_date)
<span style="background-color: #292e34;"> </span>   plt.plot(x_date,prediction_value,<span style="color: #2d9574;">'r-'</span>,lw=5)
<span style="background-color: #292e34;"> </span>   plt.show()



</pre>
</div>
</div>
</div>

<div id="outline-container-org411e4c2" class="outline-4">
<h4 id="org411e4c2"><span class="section-number-4">9.4.2.</span> non linear regression case</h4>
<div class="outline-text-4" id="text-9-4-2">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">----------------------------&#38750;&#32447;&#24615;&#22238;&#24402;</span>
<span style="color: #4f97d7; font-weight: bold;">import</span> tensorflow <span style="color: #4f97d7; font-weight: bold;">as</span> tf
<span style="color: #4f97d7; font-weight: bold;">import</span> numpy <span style="color: #4f97d7; font-weight: bold;">as</span> np
<span style="color: #4f97d7; font-weight: bold;">import</span> matplotlib.pyplot <span style="color: #4f97d7; font-weight: bold;">as</span> plt

<span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">&#26500;&#36896;&#25968;&#25454;</span>
<span style="color: #7590db;">x_date</span> = np.linspace (-0.5,0.5,100)[:,np.newaxis] <span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">np.newaxis &#21151;&#33021;&#21516;None&#65292;&#23558;&#34892;&#21464;&#21015;</span>
<span style="color: #7590db;">noise</span> = np.random.normal(0,0.02,x_date.shape)
<span style="color: #7590db;">y_date</span> = np.square(x_date)+noise

<span style="color: #7590db;">x</span> = tf.placeholder(tf.float32,[<span style="color: #a45bad;">None</span>,1])
<span style="color: #7590db;">y</span> = tf.placeholder(tf.float32,[<span style="color: #a45bad;">None</span>,1])

<span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">&#26500;&#24314;&#31070;&#32463;&#32593;&#32476;</span>
<span style="color: #7590db;">Weight_L1</span> = tf.Variable(tf.random_normal([1,10]))
<span style="color: #7590db;">Biase_L1</span> = tf.Variable(tf.zeros([1,10]))
<span style="color: #7590db;">Wx_plus_b_L1</span> = tf.matmul(x,Weight_L1)+Biase_L1
<span style="color: #7590db;">L1</span> = tf.nn.tanh(Wx_plus_b_L1)

<span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">&#23450;&#20041;&#36755;&#20986;&#23618;</span>
<span style="color: #7590db;">Weight_L2</span> = tf.Variable(tf.random_normal([10,1]))
<span style="color: #7590db;">Biase_L2</span> = tf.Variable(tf.zeros([1,1]))
<span style="color: #7590db;">Wx_plus_b_L2</span> = tf.matmul(L1,Weight_L2)+ Biase_L2
<span style="color: #7590db;">prediction</span> = tf.nn.tanh(Wx_plus_b_L2)

<span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">&#20108;&#27425;&#20195;&#20215;&#20989;&#25968;</span>
<span style="color: #7590db;">loss</span> = tf.reduce_mean(tf.square(y-prediction))
<span style="color: #7590db;">train_step</span> = tf.train.GradientDescentOptimizer(0.1).minimize(loss)
<span style="color: #4f97d7; font-weight: bold;">with</span> tf.Session() <span style="color: #4f97d7; font-weight: bold;">as</span> sess:
<span style="background-color: #292e34;"> </span>   sess.run(tf.global_variables_initializer())
<span style="background-color: #292e34;"> </span>   <span style="color: #4f97d7; font-weight: bold;">for</span> _ <span style="color: #4f97d7; font-weight: bold;">in</span> <span style="color: #4f97d7;">range</span>(2000):
<span style="background-color: #292e34;"> </span>   <span style="background-color: #292e34;"> </span>   sess.run(train_step,feed_dict={x:x_date,y:y_date})

<span style="background-color: #292e34;"> </span>   <span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">&#35757;&#32451;&#22909;&#21518;&#65292;&#29992;&#26469;&#20570;&#39044;&#27979;</span>
<span style="background-color: #292e34;"> </span>   <span style="color: #7590db;">prediction_value</span> = sess.run(prediction,feed_dict={x:x_date})
<span style="background-color: #292e34;"> </span>   plt.figure()
<span style="background-color: #292e34;"> </span>   plt.scatter(x_date, y_date)
<span style="background-color: #292e34;"> </span>   plt.plot(x_date,prediction_value,<span style="color: #2d9574;">'r-'</span>,lw=5)
<span style="background-color: #292e34;"> </span>   plt.show()


</pre>
</div>
</div>
</div>
