html/Python.html

<div id="outline-container-org41f1453" class="outline-4">
<h4 id="org41f1453"><span class="section-number-4">9.4.4.</span> a simple CNN case</h4>
<div class="outline-text-4" id="text-9-4-4">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #4f97d7; font-weight: bold;">import</span> tensorflow <span style="color: #4f97d7; font-weight: bold;">as</span> tf
<span style="color: #4f97d7; font-weight: bold;">import</span> numpy <span style="color: #4f97d7; font-weight: bold;">as</span> np
<span style="color: #7590db;">BATCH_SIZE</span> = 8
<span style="color: #7590db;">seed</span> = 23455

<span style="color: #7590db;">rng</span> = np.random.RandomState(seed)
<span style="color: #7590db;">X</span> = rng.rand(32, 2)
<span style="color: #7590db;">Y</span> = [[<span style="color: #4f97d7;">int</span>(X0+X1 &lt; 1)] <span style="color: #4f97d7; font-weight: bold;">for</span> (X0, X1) <span style="color: #4f97d7; font-weight: bold;">in</span> X]
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">print ("X is :", X)</span>
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">print ("Y is :", Y)</span>

<span style="color: #7590db;">x</span> = tf.placeholder(tf.float32, shape = (<span style="color: #a45bad;">None</span>, 2))
<span style="color: #7590db;">y_</span> = tf.placeholder(tf.float32, shape = (<span style="color: #a45bad;">None</span>, 1))

<span style="color: #7590db;">w1</span> = tf.Variable(tf.random_normal([2,3], stddev=1, seed=1))
<span style="color: #7590db;">w</span> = tf.Variable(tf.random_normal([3,3], stddev=1, seed=1))
<span style="color: #7590db;">w2</span> = tf.Variable(tf.random_normal([3,1], stddev=1, seed=1))

<span style="color: #7590db;">a</span> = tf.matmul(x,w1)
<span style="color: #7590db;">b</span> = tf.matmul(a,w)
<span style="color: #7590db;">y</span> = tf.matmul(b,w2)

<span style="color: #7590db;">loss</span> = tf.reduce_mean(tf.square(y-y_))
<span style="color: #7590db;">train_step</span> = tf.train.GradientDescentOptimizer(0.001).minimize(loss)

<span style="color: #4f97d7; font-weight: bold;">with</span> tf.Session() <span style="color: #4f97d7; font-weight: bold;">as</span> sess:
<span style="background-color: #292e34;"> </span>   <span style="color: #7590db;">init_op</span> = tf.global_variables_initializer()
<span style="background-color: #292e34;"> </span>   sess.run(init_op)
<span style="background-color: #292e34;"> </span>   <span style="color: #4f97d7;">print</span>(<span style="color: #2d9574;">"w1 is :"</span>, sess.run(w1))
<span style="background-color: #292e34;"> </span>   <span style="color: #4f97d7;">print</span>(<span style="color: #2d9574;">"w is :"</span>, sess.run(w))
<span style="background-color: #292e34;"> </span>   <span style="color: #4f97d7;">print</span>(<span style="color: #2d9574;">"w2 is :"</span>, sess.run(w2))

<span style="background-color: #292e34;"> </span>   <span style="color: #7590db;">steps</span>= 30000
<span style="background-color: #292e34;"> </span>   <span style="color: #4f97d7; font-weight: bold;">for</span> i <span style="color: #4f97d7; font-weight: bold;">in</span> <span style="color: #4f97d7;">range</span>(steps):
<span style="background-color: #292e34;"> </span>   <span style="background-color: #292e34;"> </span>   <span style="color: #7590db;">start</span> = (i*BATCH_SIZE) % 32
<span style="background-color: #292e34;"> </span>   <span style="background-color: #292e34;"> </span>   <span style="color: #7590db;">end</span> = start + BATCH_SIZE
<span style="background-color: #292e34;"> </span>   <span style="background-color: #292e34;"> </span>   sess.run(train_step, feed_dict={x:X[start:end], y_:Y[start:end]})
<span style="background-color: #292e34;"> </span>   <span style="background-color: #292e34;"> </span>   <span style="color: #4f97d7; font-weight: bold;">if</span> i % 5000 == 0:
<span style="background-color: #292e34;"> </span>   <span style="background-color: #292e34;"> </span>   <span style="background-color: #292e34;"> </span>   <span style="color: #7590db;">total_loss</span> = sess.run(loss, feed_dict={x:X, y_:Y})
<span style="background-color: #292e34;"> </span>   <span style="background-color: #292e34;"> </span>   <span style="background-color: #292e34;"> </span>   <span style="color: #4f97d7;">print</span>(<span style="color: #2d9574;">"After %d training steps, loss on all data is %g"</span> %(i,total_loss))
<span style="background-color: #292e34;"> </span>   <span style="color: #4f97d7;">print</span>(<span style="color: #2d9574;">"</span><span style="color: #a45bad;">\n</span><span style="color: #2d9574;">"</span>)
<span style="background-color: #292e34;"> </span>   <span style="color: #4f97d7;">print</span>(<span style="color: #2d9574;">"w1 is :"</span>, sess.run(w1))
<span style="background-color: #292e34;"> </span>   <span style="color: #4f97d7;">print</span>(<span style="color: #2d9574;">"w is :"</span>, sess.run(w))
<span style="background-color: #292e34;"> </span>   <span style="color: #4f97d7;">print</span>(<span style="color: #2d9574;">"w2 is :"</span>, sess.run(w2))

</pre>
</div>
</div>
</div>
