content/python.org
*** CNN train
#+BEGIN_SRC python
  import tensorflow as tf
  from tensorflow.examples.tutorials.mnist import input_data

  mnist=input_data.read_data_sets("MNIST_data",one_hot = True)

  batch_size = 100
  n_batch = mnist.train.num_examples // batch_size

  #初始化权值
  def weight_variable(shape):
      return tf.Variable(tf.truncated_normal(shape,stddev =0.01))

  #初始化偏置
  def bias_variable(shape):
      return tf.Variable(tf.constant(0.1,shape= shape))

  #定义卷积层
  def conv2d(x,W):
      return tf.nn.conv2d(x,W,strides=[1,1,1,1],padding="SAME") 

  #池化层定义
  def max_pool_2x2(x):
      return tf.nn.max_pool(x,ksize =[1,2,2,1],strides=[1,2,2,1], padding = "SAME")

  x = tf.placeholder(tf.float32,[None, 784])
  y = tf.placeholder(tf.float32,[None,10])

  x_image = tf.reshape(x,[-1,28,28,1])

  #初始化第一个卷积层的权值和偏置，输入其要求的形状
  W_convl = weight_variable([5,5,1,32]) #5x5的采样窗口大小，１通道对黑白，３通道对彩色
  b_convl = bias_variable([32])

  #现在卷积
  h_conv1 = tf.nn.relu(conv2d(x_image,W_convl) +b_convl)
  #现在池化
  h_pool1 = max_pool_2x2(h_conv1) 


  W_convl2 = weight_variable([5,5,32,64]) #5x5的采样窗口大小，１通道对黑白，３通道对彩色
  b_convl2 = bias_variable([64])

  #现在卷积
  h_conv2 = tf.nn.relu(conv2d(h_pool1 ,W_convl2) +b_convl2)
  #现在池化
  h_pool2 = max_pool_2x2(h_conv2)

  #池化后将结果扁平化处理，以便输入网络
  h_pool2_flat = tf.reshape(h_pool2, [-1,7*7*64])

  #建立第一个神经网络的全连接层，初始化其权重和偏置
  W_fcl = weight_variable([7*7*64, 100])
  b_fcl = bias_variable([100])

  #第一层的计算
  h_fcl = tf.nn.relu(tf.matmul(h_pool2_flat, W_fcl) + b_fcl)

  #dropout
  keep_prob = tf.placeholder(tf.float32)
  h_fcl_drop = tf.nn.dropout(h_fcl, keep_prob)

  #建立第二个神经层
  W_fc2 = weight_variable([100,10])
  b_fc2 = bias_variable([10])
  prediction = tf.nn.softmax(tf.matmul(h_fcl_drop, W_fc2)+b_fc2)

  #交叉熵
  cross_entropy = tf.reduce_mean(tf.nn.softmax_cross_entropy_with_logits(labels = y, logits=prediction))
  #优化
  train_step = tf.train.AdamOptimizer(1e-4).minimize(cross_entropy)

  #结果
  correct_prediction = tf.equal(tf.argmax(prediction,1),tf.argmax(y,1))
  #准确率
  accuracy = tf.reduce_mean(tf.cast(correct_prediction, tf.float32))

  with tf.Session() as sess:
      sess.run(tf.global_variables_initializer())
      for epoch in range(21):
          for batch in range(n_batch):
              batch_xs, batch_ys = mnist.train.next_batch(batch_size)
              sess.run(train_step, feed_dict={x:batch_xs, y:batch_ys, keep_prob:0.7})
          acc= sess.run(accuracy, feed_dict={x:mnist.test.images,y:mnist.test.labels, keep_prob:1.0})
          print("在第"+str(epoch)+"轮，准确率为"+str(acc))

#+END_SRC
