html/Python.html

<div id="outline-container-org1c1a552" class="outline-4">
<h4 id="org1c1a552"><span class="section-number-4">9.4.5.</span> CNN train</h4>
<div class="outline-text-4" id="text-9-4-5">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #4f97d7; font-weight: bold;">import</span> tensorflow <span style="color: #4f97d7; font-weight: bold;">as</span> tf
<span style="color: #4f97d7; font-weight: bold;">from</span> tensorflow.examples.tutorials.mnist <span style="color: #4f97d7; font-weight: bold;">import</span> input_data

<span style="color: #7590db;">mnist</span>=input_data.read_data_sets(<span style="color: #2d9574;">"MNIST_data"</span>,one_hot = <span style="color: #a45bad;">True</span>)

<span style="color: #7590db;">batch_size</span> = 100
<span style="color: #7590db;">n_batch</span> = mnist.train.num_examples // batch_size

<span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">&#21021;&#22987;&#21270;&#26435;&#20540;</span>
<span style="color: #4f97d7; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">weight_variable</span>(shape):
<span style="background-color: #292e34;"> </span>   <span style="color: #4f97d7; font-weight: bold;">return</span> tf.Variable(tf.truncated_normal(shape,stddev =0.01))

<span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">&#21021;&#22987;&#21270;&#20559;&#32622;</span>
<span style="color: #4f97d7; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">bias_variable</span>(shape):
<span style="background-color: #292e34;"> </span>   <span style="color: #4f97d7; font-weight: bold;">return</span> tf.Variable(tf.constant(0.1,shape= shape))

<span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">&#23450;&#20041;&#21367;&#31215;&#23618;</span>
<span style="color: #4f97d7; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">conv2d</span>(x,W):
<span style="background-color: #292e34;"> </span>   <span style="color: #4f97d7; font-weight: bold;">return</span> tf.nn.conv2d(x,W,strides=[1,1,1,1],padding=<span style="color: #2d9574;">"SAME"</span>) 

<span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">&#27744;&#21270;&#23618;&#23450;&#20041;</span>
<span style="color: #4f97d7; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">max_pool_2x2</span>(x):
<span style="background-color: #292e34;"> </span>   <span style="color: #4f97d7; font-weight: bold;">return</span> tf.nn.max_pool(x,ksize =[1,2,2,1],strides=[1,2,2,1], padding = <span style="color: #2d9574;">"SAME"</span>)

<span style="color: #7590db;">x</span> = tf.placeholder(tf.float32,[<span style="color: #a45bad;">None</span>, 784])
<span style="color: #7590db;">y</span> = tf.placeholder(tf.float32,[<span style="color: #a45bad;">None</span>,10])

<span style="color: #7590db;">x_image</span> = tf.reshape(x,[-1,28,28,1])

<span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">&#21021;&#22987;&#21270;&#31532;&#19968;&#20010;&#21367;&#31215;&#23618;&#30340;&#26435;&#20540;&#21644;&#20559;&#32622;&#65292;&#36755;&#20837;&#20854;&#35201;&#27714;&#30340;&#24418;&#29366;</span>
<span style="color: #7590db;">W_convl</span> = weight_variable([5,5,1,32]) <span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">5x5&#30340;&#37319;&#26679;&#31383;&#21475;&#22823;&#23567;&#65292;&#65297;&#36890;&#36947;&#23545;&#40657;&#30333;&#65292;&#65299;&#36890;&#36947;&#23545;&#24425;&#33394;</span>
<span style="color: #7590db;">b_convl</span> = bias_variable([32])

<span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">&#29616;&#22312;&#21367;&#31215;</span>
<span style="color: #7590db;">h_conv1</span> = tf.nn.relu(conv2d(x_image,W_convl) +b_convl)
<span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">&#29616;&#22312;&#27744;&#21270;</span>
<span style="color: #7590db;">h_pool1</span> = max_pool_2x2(h_conv1) 


<span style="color: #7590db;">W_convl2</span> = weight_variable([5,5,32,64]) <span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">5x5&#30340;&#37319;&#26679;&#31383;&#21475;&#22823;&#23567;&#65292;&#65297;&#36890;&#36947;&#23545;&#40657;&#30333;&#65292;&#65299;&#36890;&#36947;&#23545;&#24425;&#33394;</span>
<span style="color: #7590db;">b_convl2</span> = bias_variable([64])

<span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">&#29616;&#22312;&#21367;&#31215;</span>
<span style="color: #7590db;">h_conv2</span> = tf.nn.relu(conv2d(h_pool1 ,W_convl2) +b_convl2)
<span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">&#29616;&#22312;&#27744;&#21270;</span>
<span style="color: #7590db;">h_pool2</span> = max_pool_2x2(h_conv2)

<span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">&#27744;&#21270;&#21518;&#23558;&#32467;&#26524;&#25153;&#24179;&#21270;&#22788;&#29702;&#65292;&#20197;&#20415;&#36755;&#20837;&#32593;&#32476;</span>
<span style="color: #7590db;">h_pool2_flat</span> = tf.reshape(h_pool2, [-1,7*7*64])

<span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">&#24314;&#31435;&#31532;&#19968;&#20010;&#31070;&#32463;&#32593;&#32476;&#30340;&#20840;&#36830;&#25509;&#23618;&#65292;&#21021;&#22987;&#21270;&#20854;&#26435;&#37325;&#21644;&#20559;&#32622;</span>
<span style="color: #7590db;">W_fcl</span> = weight_variable([7*7*64, 100])
<span style="color: #7590db;">b_fcl</span> = bias_variable([100])

<span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">&#31532;&#19968;&#23618;&#30340;&#35745;&#31639;</span>
<span style="color: #7590db;">h_fcl</span> = tf.nn.relu(tf.matmul(h_pool2_flat, W_fcl) + b_fcl)

<span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">dropout</span>
<span style="color: #7590db;">keep_prob</span> = tf.placeholder(tf.float32)
<span style="color: #7590db;">h_fcl_drop</span> = tf.nn.dropout(h_fcl, keep_prob)

<span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">&#24314;&#31435;&#31532;&#20108;&#20010;&#31070;&#32463;&#23618;</span>
<span style="color: #7590db;">W_fc2</span> = weight_variable([100,10])
<span style="color: #7590db;">b_fc2</span> = bias_variable([10])
<span style="color: #7590db;">prediction</span> = tf.nn.softmax(tf.matmul(h_fcl_drop, W_fc2)+b_fc2)

<span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">&#20132;&#21449;&#29109;</span>
<span style="color: #7590db;">cross_entropy</span> = tf.reduce_mean(tf.nn.softmax_cross_entropy_with_logits(labels = y, logits=prediction))
<span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">&#20248;&#21270;</span>
<span style="color: #7590db;">train_step</span> = tf.train.AdamOptimizer(1e-4).minimize(cross_entropy)

<span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">&#32467;&#26524;</span>
<span style="color: #7590db;">correct_prediction</span> = tf.equal(tf.argmax(prediction,1),tf.argmax(y,1))
<span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">&#20934;&#30830;&#29575;</span>
<span style="color: #7590db;">accuracy</span> = tf.reduce_mean(tf.cast(correct_prediction, tf.float32))

<span style="color: #4f97d7; font-weight: bold;">with</span> tf.Session() <span style="color: #4f97d7; font-weight: bold;">as</span> sess:
<span style="background-color: #292e34;"> </span>   sess.run(tf.global_variables_initializer())
<span style="background-color: #292e34;"> </span>   <span style="color: #4f97d7; font-weight: bold;">for</span> epoch <span style="color: #4f97d7; font-weight: bold;">in</span> <span style="color: #4f97d7;">range</span>(21):
<span style="background-color: #292e34;"> </span>   <span style="background-color: #292e34;"> </span>   <span style="color: #4f97d7; font-weight: bold;">for</span> batch <span style="color: #4f97d7; font-weight: bold;">in</span> <span style="color: #4f97d7;">range</span>(n_batch):
<span style="background-color: #292e34;"> </span>   <span style="background-color: #292e34;"> </span>   <span style="background-color: #292e34;"> </span>   <span style="color: #7590db;">batch_xs</span>, <span style="color: #7590db;">batch_ys</span> = mnist.train.next_batch(batch_size)
<span style="background-color: #292e34;"> </span>   <span style="background-color: #292e34;"> </span>   <span style="background-color: #292e34;"> </span>   sess.run(train_step, feed_dict={x:batch_xs, y:batch_ys, keep_prob:0.7})
<span style="background-color: #292e34;"> </span>   <span style="background-color: #292e34;"> </span>   <span style="color: #7590db;">acc</span>= sess.run(accuracy, feed_dict={x:mnist.test.images,y:mnist.test.labels, keep_prob:1.0})
<span style="background-color: #292e34;"> </span>   <span style="background-color: #292e34;"> </span>   <span style="color: #4f97d7;">print</span>(<span style="color: #2d9574;">"&#22312;&#31532;"</span>+<span style="color: #4f97d7;">str</span>(epoch)+<span style="color: #2d9574;">"&#36718;&#65292;&#20934;&#30830;&#29575;&#20026;"</span>+<span style="color: #4f97d7;">str</span>(acc))

</pre>
</div>
</div>
</div>
