html/Python.html
<div id="outline-container-org3e321e1" class="outline-4">
<h4 id="org3e321e1"><span class="section-number-4">9.4.6.</span> classification</h4>
<div class="outline-text-4" id="text-9-4-6">
<div class="org-src-container">
<pre class="src src-python">
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">Youku video tutorial: http://i.youku.com/pythontutorial</span>

<span style="color: #9f8766;">"""</span>
<span style="color: #9f8766;">Please note, this code is only for python 3+. If you are using python 2+, please modify the code accordingly.</span>
<span style="color: #9f8766;">"""</span>
<span style="color: #4f97d7; font-weight: bold;">from</span> __future__ <span style="color: #4f97d7; font-weight: bold;">import</span> print_function
<span style="color: #4f97d7; font-weight: bold;">import</span> tensorflow <span style="color: #4f97d7; font-weight: bold;">as</span> tf
<span style="color: #4f97d7; font-weight: bold;">from</span> tensorflow.examples.tutorials.mnist <span style="color: #4f97d7; font-weight: bold;">import</span> input_data
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">number 1 to 10 data</span>
<span style="color: #7590db;">mnist</span> = input_data.read_data_sets(<span style="color: #2d9574;">'MNIST_data'</span>, one_hot=<span style="color: #a45bad;">True</span>)

<span style="color: #4f97d7; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">add_layer</span>(inputs, in_size, out_size, activation_function=<span style="color: #a45bad;">None</span>,):
<span style="background-color: #292e34;"> </span>   <span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">add one more layer and return the output of this layer</span>
<span style="background-color: #292e34;"> </span>   <span style="color: #7590db;">Weights</span> = tf.Variable(tf.random_normal([in_size, out_size]))
<span style="background-color: #292e34;"> </span>   <span style="color: #7590db;">biases</span> = tf.Variable(tf.zeros([1, out_size]) + 0.1,)
<span style="background-color: #292e34;"> </span>   <span style="color: #7590db;">Wx_plus_b</span> = tf.matmul(inputs, Weights) + biases
<span style="background-color: #292e34;"> </span>   <span style="color: #4f97d7; font-weight: bold;">if</span> activation_function <span style="color: #4f97d7; font-weight: bold;">is</span> <span style="color: #a45bad;">None</span>:
<span style="background-color: #292e34;"> </span>   <span style="background-color: #292e34;"> </span>   <span style="color: #7590db;">outputs</span> = Wx_plus_b
<span style="background-color: #292e34;"> </span>   <span style="color: #4f97d7; font-weight: bold;">else</span>:
<span style="background-color: #292e34;"> </span>   <span style="background-color: #292e34;"> </span>   <span style="color: #7590db;">outputs</span> = activation_function(Wx_plus_b,)
<span style="background-color: #292e34;"> </span>   <span style="color: #4f97d7; font-weight: bold;">return</span> outputs

<span style="color: #4f97d7; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">compute_accuracy</span>(v_xs, v_ys):
<span style="background-color: #292e34;"> </span>   <span style="color: #4f97d7; font-weight: bold;">global</span> prediction
<span style="background-color: #292e34;"> </span>   <span style="color: #7590db;">y_pre</span> = sess.run(prediction, feed_dict={xs: v_xs})
<span style="background-color: #292e34;"> </span>   <span style="color: #7590db;">correct_prediction</span> = tf.equal(tf.argmax(y_pre,1), tf.argmax(v_ys,1))
<span style="background-color: #292e34;"> </span>   <span style="color: #7590db;">accuracy</span> = tf.reduce_mean(tf.cast(correct_prediction, tf.float32))
<span style="background-color: #292e34;"> </span>   <span style="color: #7590db;">result</span> = sess.run(accuracy, feed_dict={xs: v_xs, ys: v_ys})
<span style="background-color: #292e34;"> </span>   <span style="color: #4f97d7; font-weight: bold;">return</span> result

<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">define placeholder for inputs to network</span>
<span style="color: #7590db;">xs</span> = tf.placeholder(tf.float32, [<span style="color: #a45bad;">None</span>, 784]) <span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">28x28</span>
<span style="color: #7590db;">ys</span> = tf.placeholder(tf.float32, [<span style="color: #a45bad;">None</span>, 10])

<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">add output layer</span>
<span style="color: #7590db;">prediction</span> = add_layer(xs, 784, 10,  activation_function=tf.nn.softmax)

<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">the error between prediction and real data</span>
<span style="color: #7590db;">cross_entropy</span> = tf.reduce_mean(-tf.reduce_sum(ys * tf.log(prediction),
<span style="background-color: #292e34;"> </span>   <span style="background-color: #292e34;"> </span>   <span style="background-color: #292e34;"> </span>   <span style="background-color: #292e34;"> </span>   <span style="background-color: #292e34;"> </span>   <span style="background-color: #292e34;"> </span>   <span style="background-color: #292e34;"> </span>   <span style="background-color: #292e34;"> </span>   <span style="background-color: #292e34;"> </span>   <span style="background-color: #292e34;"> </span>   <span style="background-color: #292e34;"> </span>   <span style="background-color: #292e34;"> </span> reduction_indices=[1]))       <span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">loss</span>
<span style="color: #7590db;">train_step</span> = tf.train.GradientDescentOptimizer(0.5).minimize(cross_entropy)

<span style="color: #7590db;">sess</span> = tf.Session()
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">important step</span>
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">tf.initialize_all_variables() no long valid from</span>
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">2017-03-02 if using tensorflow &gt;= 0.12</span>
<span style="color: #4f97d7; font-weight: bold;">if</span> <span style="color: #4f97d7;">int</span>((tf.__version__).split(<span style="color: #2d9574;">'.'</span>)[1]) &lt; 12 <span style="color: #4f97d7; font-weight: bold;">and</span> <span style="color: #4f97d7;">int</span>((tf.__version__).split(<span style="color: #2d9574;">'.'</span>)[0]) &lt; 1:
<span style="background-color: #292e34;"> </span>   <span style="color: #7590db;">init</span> = tf.initialize_all_variables()
<span style="color: #4f97d7; font-weight: bold;">else</span>:
<span style="background-color: #292e34;"> </span>   <span style="color: #7590db;">init</span> = tf.global_variables_initializer()
sess.run(init)

<span style="color: #4f97d7; font-weight: bold;">for</span> i <span style="color: #4f97d7; font-weight: bold;">in</span> <span style="color: #4f97d7;">range</span>(1000):
<span style="background-color: #292e34;"> </span>   <span style="color: #7590db;">batch_xs</span>, <span style="color: #7590db;">batch_ys</span> = mnist.train.next_batch(100)
<span style="background-color: #292e34;"> </span>   sess.run(train_step, feed_dict={xs: batch_xs, ys: batch_ys})
<span style="background-color: #292e34;"> </span>   <span style="color: #4f97d7; font-weight: bold;">if</span> i % 50 == 0:
<span style="background-color: #292e34;"> </span>   <span style="background-color: #292e34;"> </span>   <span style="color: #4f97d7;">print</span>(compute_accuracy(
<span style="background-color: #292e34;"> </span>   <span style="background-color: #292e34;"> </span>   <span style="background-color: #292e34;"> </span>   mnist.test.images, mnist.test.labels))


</pre>
</div>
</div>
</div>
