html/Python.html
<div id="outline-container-org0ae5eea" class="outline-4">
<h4 id="org0ae5eea"><span class="section-number-4">9.4.11.</span> without L regularizer</h4>
<div class="outline-text-4" id="text-9-4-11">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #4f97d7; font-weight: bold;">import</span> tensorflow <span style="color: #4f97d7; font-weight: bold;">as</span> tf
<span style="color: #4f97d7; font-weight: bold;">import</span> numpy <span style="color: #4f97d7; font-weight: bold;">as</span> np
<span style="color: #4f97d7; font-weight: bold;">import</span> matplotlib.pyplot <span style="color: #4f97d7; font-weight: bold;">as</span> plt
<span style="color: #7590db;">BATCH_SIZE</span> = 30
<span style="color: #7590db;">seed</span> = 2
<span style="color: #7590db;">rdm</span> = np.random.RandomState(seed)
<span style="color: #7590db;">X</span> = rdm.randn(300,2)
<span style="color: #7590db;">Y_</span> = [<span style="color: #4f97d7;">int</span>(x0*x0 + x1*x1 &lt; 2) <span style="color: #4f97d7; font-weight: bold;">for</span> (x0,x1) <span style="color: #4f97d7; font-weight: bold;">in</span> X]
<span style="color: #7590db;">Y_c</span> = [[<span style="color: #2d9574;">'red'</span> <span style="color: #4f97d7; font-weight: bold;">if</span> y <span style="color: #4f97d7; font-weight: bold;">else</span> <span style="color: #2d9574;">'blue'</span>] <span style="color: #4f97d7; font-weight: bold;">for</span> y <span style="color: #4f97d7; font-weight: bold;">in</span> Y_]
<span style="color: #7590db;">X</span> = np.vstack(X).reshape(-1,2)
<span style="color: #7590db;">Y_</span> = np.vstack(Y_).reshape(-1,1)
<span style="color: #4f97d7;">print</span>(X)
<span style="color: #4f97d7;">print</span>(Y_)
<span style="color: #4f97d7;">print</span>(Y_c)
plt.scatter(X[:,0],X[:,1], c = np.squeeze(Y_c))
plt.show()

<span style="color: #4f97d7; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">get_weight</span>(shape, regularizer):
<span style="background-color: #292e34;"> </span>   <span style="color: #7590db;">w</span> = tf.Variable(tf.random_normal(shape), dtype = tf.float32)
<span style="background-color: #292e34;"> </span>   tf.add_to_collection(<span style="color: #2d9574;">'losses'</span>, tf.contrib.layers.l2_regularizer(regularizer)(w))
<span style="background-color: #292e34;"> </span>   <span style="color: #4f97d7; font-weight: bold;">return</span> w
<span style="color: #4f97d7; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">get_bias</span>(shape):
<span style="background-color: #292e34;"> </span>   <span style="color: #7590db;">b</span> = tf.Variable(tf.constant(0.01, shape=shape))
<span style="background-color: #292e34;"> </span>   <span style="color: #4f97d7; font-weight: bold;">return</span> b
<span style="color: #7590db;">x</span> = tf.placeholder(tf.float32, shape=(<span style="color: #a45bad;">None</span>, 2))
<span style="color: #7590db;">y_</span> = tf.placeholder(tf.float32, shape = (<span style="color: #a45bad;">None</span> , 1))
<span style="color: #7590db;">w1</span> = get_weight([2,11], 0.01)
<span style="color: #7590db;">b1</span> = get_bias([11])
<span style="color: #7590db;">y1</span> = tf.nn.relu(tf.matmul(x,w1)+b1)
<span style="color: #7590db;">w2</span> = get_weight([11,1],0.01)
<span style="color: #7590db;">b2</span> = get_bias([1])
<span style="color: #7590db;">y</span> = tf.matmul(y1,w2)+b2

<span style="color: #7590db;">loss_mse</span> = tf.reduce_mean(tf.square(y-y_))
<span style="color: #7590db;">loss_total</span> = loss_mse + tf.add_n(tf.get_collection(<span style="color: #2d9574;">'losses'</span>))

<span style="color: #7590db;">train_step</span> = tf.train.AdamOptimizer(0.0001).minimize(loss_mse)
<span style="color: #4f97d7; font-weight: bold;">with</span> tf.Session() <span style="color: #4f97d7; font-weight: bold;">as</span> sess:
<span style="background-color: #292e34;"> </span>   <span style="color: #7590db;">init_op</span> = tf.global_variables_initializer()
<span style="background-color: #292e34;"> </span>   sess.run(init_op)
<span style="background-color: #292e34;"> </span>   <span style="color: #7590db;">STEPS</span> = 40000
<span style="background-color: #292e34;"> </span>   <span style="color: #4f97d7; font-weight: bold;">for</span> i <span style="color: #4f97d7; font-weight: bold;">in</span> <span style="color: #4f97d7;">range</span>(STEPS):
<span style="background-color: #292e34;"> </span>   <span style="background-color: #292e34;"> </span>   <span style="color: #7590db;">start</span> = (i*BATCH_SIZE) % 300
<span style="background-color: #292e34;"> </span>   <span style="background-color: #292e34;"> </span>   <span style="color: #7590db;">end</span> = start + BATCH_SIZE
<span style="background-color: #292e34;"> </span>   <span style="background-color: #292e34;"> </span>   sess.run(train_step, feed_dict = {x:X[start:end], y_:Y_[start:end]})
<span style="background-color: #292e34;"> </span>   <span style="background-color: #292e34;"> </span>   <span style="color: #4f97d7; font-weight: bold;">if</span> i % 2000 == 0:
<span style="background-color: #292e34;"> </span>   <span style="background-color: #292e34;"> </span>   <span style="background-color: #292e34;"> </span>   <span style="color: #7590db;">loss_mse_v</span> = sess.run(loss_mse, feed_dict={x:X,y_:Y_})
<span style="background-color: #292e34;"> </span>   <span style="background-color: #292e34;"> </span>   <span style="background-color: #292e34;"> </span>   <span style="color: #4f97d7;">print</span>(<span style="color: #2d9574;">'After %d steps, loss is: %f'</span> %(i, loss_mse_v))
<span style="background-color: #292e34;"> </span>   <span style="color: #7590db;">xx</span>, <span style="color: #7590db;">yy</span> = np.mgrid[-3:3:0.01, -3:3:0.01]
<span style="background-color: #292e34;"> </span>   <span style="color: #7590db;">grid</span> = np.c_[xx.ravel(), yy.ravel()]
<span style="background-color: #292e34;"> </span>   <span style="color: #7590db;">probs</span> = sess.run(y, feed_dict={x:grid})
<span style="background-color: #292e34;"> </span>   <span style="color: #7590db;">probs</span> = probs.reshape(xx.shape)
<span style="background-color: #292e34;"> </span>   <span style="color: #4f97d7;">print</span> (<span style="color: #2d9574;">'w1 is </span><span style="color: #a45bad;">\n</span><span style="color: #2d9574;">:'</span>, sess.run(w1))
<span style="background-color: #292e34;"> </span>   <span style="color: #4f97d7;">print</span> (<span style="color: #2d9574;">'b1 is </span><span style="color: #a45bad;">\n</span><span style="color: #2d9574;">:'</span>, sess.run(b1))
<span style="background-color: #292e34;"> </span>   <span style="color: #4f97d7;">print</span> (<span style="color: #2d9574;">'w2 is </span><span style="color: #a45bad;">\n</span><span style="color: #2d9574;">:'</span>, sess.run(w2))
<span style="background-color: #292e34;"> </span>   <span style="color: #4f97d7;">print</span> (<span style="color: #2d9574;">'b2 is </span><span style="color: #a45bad;">\n</span><span style="color: #2d9574;">:'</span>, sess.run(b2))
plt.scatter(X[:,0], X[:,1], c = np.squeeze(Y_c))
plt.contour(xx, yy, probs, levels = [.5])
plt.show()


</pre>
</div>
</div>
</div>
