content/python.org
*** exponen decay with L regularizer(this has error)
#+BEGIN_SRC python
  import numpy as np
  import matplotlib.pyplot as plt


  try:
      import opt4_8_generateds
      import opt4_8_forward
  except:
      import pip 
      pip.main(['install','opt4_8_forward'])
      pip.main(['install','opt4_8_generateds'])
      import opt4_8_generateds
      import opt4_8_forward



  STEPS = 40000
  BATCH_SIZE = 30
  LEARNING_RATE_BASE = 0.001
  LEARNING_RATE_DECAY = 0.999
  REGULARIZER = 0.01

  def backward():
      x = tf.placeholder(tf.float32, shape = (None,2))
      y_ = tf.placeholder(tf.float32, shape = (None,1))

      x , Y_, Y_c = opt4_8_generateds.generateds()
      y = opt4_8_forward.forward(x,REGULARIZER)

      global_steps = tf.Variable(0, trainable= False)
      learning_rate = tf.train.exponential_decay(
          LEARNING_RATE_BASE,
          global_steps,
          300/BATCH_SIZE,
          LEARNING_RATE_DECAY,
          staircase = True)
      loss_mse = tf.reduce_mean(tf.square(y-y_))
      loss_total = loss_mse + tf.add_n(tf.get_collection('losses'))

      train_step = tf.train.AdamOptimizer(learning_rate).minimizer(loss_total)

      with tf.Session() as sess:
          init_op = tf.global_variables_initializer()
          sess.run(init_op)
          for i in range(STEPS):
              start = (i*BATCH_SIZE) % 300
              end = start + BATCH_SIZE
              sess.run(train_step, feed_dict = {x:X[start:end], y_:Y_[start:end]})
              if i % 2000 == 0:
                  loss_v = sess.run(loss_total, feed_dict={x:X,y_:Y_})
                  print('After %d steps, loss is: %f' %(i, loss_v))
          xx, yy = np.mgrid[-3:3:0.01, -3:3:0.01]
          grid = np.c_[xx.ravel(), yy.ravel()]
          probs = sess.run(y, feed_dict={x:grid})
          probs = probs.reshape(xx.shape)

      plt.scatter(X[:,0], X[:,1], c = np.squeeze(Y_c))
      plt.contour(xx, yy, probs, levels = [.5])
      plt.show()

  if __name__ == '__main__':
      backward()


#+END_SRC
*** read date for variables
#+BEGIN_SRC python :results output
  from tensorflow.examples.tutorials.mnist import input_data
  mnist = input_data.read_data_sets('./data', one_hot = True)

  # print(mnist.train.labels[0])
  # print(mnist.train.images[0])

  BATCH_SIZE = 200
  xs, ys = mnist.train.next_batch(BATCH_SIZE)
  print("xs shape :", xs.shape)
  print("ys shape :", ys.shape)


#+END_SRC

#+RESULTS:
: Extracting ./data/train-images-idx3-ubyte.gz
: Extracting ./data/train-labels-idx1-ubyte.gz
: Extracting ./data/t10k-images-idx3-ubyte.gz
: Extracting ./data/t10k-labels-idx1-ubyte.gz
: xs shape : (200, 784)
: ys shape : (200, 10)




#+startup: content
** keras
