html/Python.html
<div id="outline-container-orgd8d660d" class="outline-4">
<h4 id="orgd8d660d"><span class="section-number-4">9.4.12.</span> exponen decay with L regularizer(this has error)</h4>
<div class="outline-text-4" id="text-9-4-12">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #4f97d7; font-weight: bold;">import</span> numpy <span style="color: #4f97d7; font-weight: bold;">as</span> np
<span style="color: #4f97d7; font-weight: bold;">import</span> matplotlib.pyplot <span style="color: #4f97d7; font-weight: bold;">as</span> plt


<span style="color: #4f97d7; font-weight: bold;">try</span>:
<span style="background-color: #292e34;"> </span>   <span style="color: #4f97d7; font-weight: bold;">import</span> opt4_8_generateds
<span style="background-color: #292e34;"> </span>   <span style="color: #4f97d7; font-weight: bold;">import</span> opt4_8_forward
<span style="color: #4f97d7; font-weight: bold;">except</span>:
<span style="background-color: #292e34;"> </span>   <span style="color: #4f97d7; font-weight: bold;">import</span> pip 
<span style="background-color: #292e34;"> </span>   pip.main([<span style="color: #2d9574;">'install'</span>,<span style="color: #2d9574;">'opt4_8_forward'</span>])
<span style="background-color: #292e34;"> </span>   pip.main([<span style="color: #2d9574;">'install'</span>,<span style="color: #2d9574;">'opt4_8_generateds'</span>])
<span style="background-color: #292e34;"> </span>   <span style="color: #4f97d7; font-weight: bold;">import</span> opt4_8_generateds
<span style="background-color: #292e34;"> </span>   <span style="color: #4f97d7; font-weight: bold;">import</span> opt4_8_forward



<span style="color: #7590db;">STEPS</span> = 40000
<span style="color: #7590db;">BATCH_SIZE</span> = 30
<span style="color: #7590db;">LEARNING_RATE_BASE</span> = 0.001
<span style="color: #7590db;">LEARNING_RATE_DECAY</span> = 0.999
<span style="color: #7590db;">REGULARIZER</span> = 0.01

<span style="color: #4f97d7; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">backward</span>():
<span style="background-color: #292e34;"> </span>   <span style="color: #7590db;">x</span> = tf.placeholder(tf.float32, shape = (<span style="color: #a45bad;">None</span>,2))
<span style="background-color: #292e34;"> </span>   <span style="color: #7590db;">y_</span> = tf.placeholder(tf.float32, shape = (<span style="color: #a45bad;">None</span>,1))

<span style="background-color: #292e34;"> </span>   <span style="color: #7590db;">x</span> , <span style="color: #7590db;">Y_</span>, <span style="color: #7590db;">Y_c</span> = opt4_8_generateds.generateds()
<span style="background-color: #292e34;"> </span>   <span style="color: #7590db;">y</span> = opt4_8_forward.forward(x,REGULARIZER)

<span style="background-color: #292e34;"> </span>   <span style="color: #7590db;">global_steps</span> = tf.Variable(0, trainable= <span style="color: #a45bad;">False</span>)
<span style="background-color: #292e34;"> </span>   <span style="color: #7590db;">learning_rate</span> = tf.train.exponential_decay(
<span style="background-color: #292e34;"> </span>   <span style="background-color: #292e34;"> </span>   LEARNING_RATE_BASE,
<span style="background-color: #292e34;"> </span>   <span style="background-color: #292e34;"> </span>   global_steps,
<span style="background-color: #292e34;"> </span>   <span style="background-color: #292e34;"> </span>   300/BATCH_SIZE,
<span style="background-color: #292e34;"> </span>   <span style="background-color: #292e34;"> </span>   LEARNING_RATE_DECAY,
<span style="background-color: #292e34;"> </span>   <span style="background-color: #292e34;"> </span>   staircase = <span style="color: #a45bad;">True</span>)
<span style="background-color: #292e34;"> </span>   <span style="color: #7590db;">loss_mse</span> = tf.reduce_mean(tf.square(y-y_))
<span style="background-color: #292e34;"> </span>   <span style="color: #7590db;">loss_total</span> = loss_mse + tf.add_n(tf.get_collection(<span style="color: #2d9574;">'losses'</span>))

<span style="background-color: #292e34;"> </span>   <span style="color: #7590db;">train_step</span> = tf.train.AdamOptimizer(learning_rate).minimizer(loss_total)

<span style="background-color: #292e34;"> </span>   <span style="color: #4f97d7; font-weight: bold;">with</span> tf.Session() <span style="color: #4f97d7; font-weight: bold;">as</span> sess:
<span style="background-color: #292e34;"> </span>   <span style="background-color: #292e34;"> </span>   <span style="color: #7590db;">init_op</span> = tf.global_variables_initializer()
<span style="background-color: #292e34;"> </span>   <span style="background-color: #292e34;"> </span>   sess.run(init_op)
<span style="background-color: #292e34;"> </span>   <span style="background-color: #292e34;"> </span>   <span style="color: #4f97d7; font-weight: bold;">for</span> i <span style="color: #4f97d7; font-weight: bold;">in</span> <span style="color: #4f97d7;">range</span>(STEPS):
<span style="background-color: #292e34;"> </span>   <span style="background-color: #292e34;"> </span>   <span style="background-color: #292e34;"> </span>   <span style="color: #7590db;">start</span> = (i*BATCH_SIZE) % 300
<span style="background-color: #292e34;"> </span>   <span style="background-color: #292e34;"> </span>   <span style="background-color: #292e34;"> </span>   <span style="color: #7590db;">end</span> = start + BATCH_SIZE
<span style="background-color: #292e34;"> </span>   <span style="background-color: #292e34;"> </span>   <span style="background-color: #292e34;"> </span>   sess.run(train_step, feed_dict = {x:X[start:end], y_:Y_[start:end]})
<span style="background-color: #292e34;"> </span>   <span style="background-color: #292e34;"> </span>   <span style="background-color: #292e34;"> </span>   <span style="color: #4f97d7; font-weight: bold;">if</span> i % 2000 == 0:
<span style="background-color: #292e34;"> </span>   <span style="background-color: #292e34;"> </span>   <span style="background-color: #292e34;"> </span>   <span style="background-color: #292e34;"> </span>   <span style="color: #7590db;">loss_v</span> = sess.run(loss_total, feed_dict={x:X,y_:Y_})
<span style="background-color: #292e34;"> </span>   <span style="background-color: #292e34;"> </span>   <span style="background-color: #292e34;"> </span>   <span style="background-color: #292e34;"> </span>   <span style="color: #4f97d7;">print</span>(<span style="color: #2d9574;">'After %d steps, loss is: %f'</span> %(i, loss_v))
<span style="background-color: #292e34;"> </span>   <span style="background-color: #292e34;"> </span>   <span style="color: #7590db;">xx</span>, <span style="color: #7590db;">yy</span> = np.mgrid[-3:3:0.01, -3:3:0.01]
<span style="background-color: #292e34;"> </span>   <span style="background-color: #292e34;"> </span>   <span style="color: #7590db;">grid</span> = np.c_[xx.ravel(), yy.ravel()]
<span style="background-color: #292e34;"> </span>   <span style="background-color: #292e34;"> </span>   <span style="color: #7590db;">probs</span> = sess.run(y, feed_dict={x:grid})
<span style="background-color: #292e34;"> </span>   <span style="background-color: #292e34;"> </span>   <span style="color: #7590db;">probs</span> = probs.reshape(xx.shape)

<span style="background-color: #292e34;"> </span>   plt.scatter(X[:,0], X[:,1], c = np.squeeze(Y_c))
<span style="background-color: #292e34;"> </span>   plt.contour(xx, yy, probs, levels = [.5])
<span style="background-color: #292e34;"> </span>   plt.show()

<span style="color: #4f97d7; font-weight: bold;">if</span> <span style="color: #4f97d7;">__name__</span> == <span style="color: #2d9574;">'__main__'</span>:
<span style="background-color: #292e34;"> </span>   backward()


</pre>
</div>
</div>
</div>
<div id="outline-container-org600a8b8" class="outline-4">
<h4 id="org600a8b8"><span class="section-number-4">9.4.13.</span> read date for variables</h4>
<div class="outline-text-4" id="text-9-4-13">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #4f97d7; font-weight: bold;">from</span> tensorflow.examples.tutorials.mnist <span style="color: #4f97d7; font-weight: bold;">import</span> input_data
<span style="color: #7590db;">mnist</span> = input_data.read_data_sets(<span style="color: #2d9574;">'./data'</span>, one_hot = <span style="color: #a45bad;">True</span>)

<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">print(mnist.train.labels[0])</span>
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">print(mnist.train.images[0])</span>

<span style="color: #7590db;">BATCH_SIZE</span> = 200
<span style="color: #7590db;">xs</span>, <span style="color: #7590db;">ys</span> = mnist.train.next_batch(BATCH_SIZE)
<span style="color: #4f97d7;">print</span>(<span style="color: #2d9574;">"xs shape :"</span>, xs.shape)
<span style="color: #4f97d7;">print</span>(<span style="color: #2d9574;">"ys shape :"</span>, ys.shape)


</pre>
</div>
</div>
</div>
</div>
