html/Python.html
<div id="outline-container-org6de7c97" class="outline-3">
<h3 id="org6de7c97"><span class="section-number-3">9.5.</span> keras</h3>
<div class="outline-text-3" id="text-9-5">
</div>
<div id="outline-container-org7342ee3" class="outline-4">
<h4 id="org7342ee3"><span class="section-number-4">9.5.1.</span> classification</h4>
<div class="outline-text-4" id="text-9-5-1">
<div class="org-src-container">
<pre class="src src-python">

<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">please note, all tutorial code are running under python3.5.</span>
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">If you use the version like python2.7, please modify the code accordingly</span>

<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">5 - Classifier example</span>

<span style="color: #4f97d7; font-weight: bold;">import</span> numpy <span style="color: #4f97d7; font-weight: bold;">as</span> np
np.random.seed(1337)  <span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">for reproducibility</span>
<span style="color: #4f97d7; font-weight: bold;">from</span> keras.datasets <span style="color: #4f97d7; font-weight: bold;">import</span> mnist
<span style="color: #4f97d7; font-weight: bold;">from</span> keras.utils <span style="color: #4f97d7; font-weight: bold;">import</span> np_utils
<span style="color: #4f97d7; font-weight: bold;">from</span> keras.models <span style="color: #4f97d7; font-weight: bold;">import</span> Sequential
<span style="color: #4f97d7; font-weight: bold;">from</span> keras.layers <span style="color: #4f97d7; font-weight: bold;">import</span> Dense, Activation
<span style="color: #4f97d7; font-weight: bold;">from</span> keras.optimizers <span style="color: #4f97d7; font-weight: bold;">import</span> RMSprop

<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">download the mnist to the path '~/.keras/datasets/' if it is the first time to be called</span>
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">X shape (60,000 28x28), y shape (10,000, )</span>
(X_train, y_train), (<span style="color: #7590db;">X_test</span>, <span style="color: #7590db;">y_test</span>) = mnist.load_data()

<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">data pre-processing</span>
<span style="color: #7590db;">X_train</span> = X_train.reshape(X_train.shape[0], -1) / 255.   <span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">normalize</span>
<span style="color: #7590db;">X_test</span> = X_test.reshape(X_test.shape[0], -1) / 255.      <span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">normalize</span>
<span style="color: #7590db;">y_train</span> = np_utils.to_categorical(y_train, num_classes=10)
<span style="color: #7590db;">y_test</span> = np_utils.to_categorical(y_test, num_classes=10)

<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">Another way to build your neural net</span>
<span style="color: #7590db;">model</span> = Sequential([
<span style="background-color: #292e34;"> </span>   Dense(32, input_dim=784),
<span style="background-color: #292e34;"> </span>   Activation(<span style="color: #2d9574;">'relu'</span>),
<span style="background-color: #292e34;"> </span>   Dense(10),
<span style="background-color: #292e34;"> </span>   Activation(<span style="color: #2d9574;">'softmax'</span>),
])

<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">Another way to define your optimizer</span>
<span style="color: #7590db;">rmsprop</span> = RMSprop(lr=0.001, rho=0.9, epsilon=1e-08, decay=0.0)

<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">We add metrics to get more results you want to see</span>
model.<span style="color: #4f97d7;">compile</span>(optimizer=rmsprop,
<span style="background-color: #292e34;"> </span>   <span style="background-color: #292e34;"> </span>   <span style="background-color: #292e34;"> </span>   <span style="background-color: #292e34;"> </span> loss=<span style="color: #2d9574;">'categorical_crossentropy'</span>,
<span style="background-color: #292e34;"> </span>   <span style="background-color: #292e34;"> </span>   <span style="background-color: #292e34;"> </span>   <span style="background-color: #292e34;"> </span> metrics=[<span style="color: #2d9574;">'accuracy'</span>])

<span style="color: #4f97d7;">print</span>(<span style="color: #2d9574;">'Training ------------'</span>)
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">Another way to train the model</span>
model.fit(X_train, y_train, epochs=2, batch_size=32)

<span style="color: #4f97d7;">print</span>(<span style="color: #2d9574;">'</span><span style="color: #a45bad;">\n</span><span style="color: #2d9574;">Testing ------------'</span>)
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">Evaluate the model with the metrics we defined earlier</span>
<span style="color: #7590db;">loss</span>, <span style="color: #7590db;">accuracy</span> = model.evaluate(X_test, y_test)

<span style="color: #4f97d7;">print</span>(<span style="color: #2d9574;">'test loss: '</span>, loss)
<span style="color: #4f97d7;">print</span>(<span style="color: #2d9574;">'test accuracy: '</span>, accuracy)

</pre>
</div>
</div>
</div>
<div id="outline-container-orgf415757" class="outline-4">
<h4 id="orgf415757"><span class="section-number-4">9.5.2.</span> regression</h4>
<div class="outline-text-4" id="text-9-5-2">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;"># please note, all tutorial code are running under python3.5.</span>
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;"># If you use the version like python2.7, please modify the code accordingly</span>

<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;"># 4 - Regressor example</span>

<span style="color: #4f97d7; font-weight: bold;">import</span> numpy <span style="color: #4f97d7; font-weight: bold;">as</span> np
np.random.seed(1337)  <span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">for reproducibility</span>
<span style="color: #4f97d7; font-weight: bold;">from</span> keras.models <span style="color: #4f97d7; font-weight: bold;">import</span> Sequential
<span style="color: #4f97d7; font-weight: bold;">from</span> keras.layers <span style="color: #4f97d7; font-weight: bold;">import</span> Dense
<span style="color: #4f97d7; font-weight: bold;">import</span> matplotlib.pyplot <span style="color: #4f97d7; font-weight: bold;">as</span> plt

<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">create some data</span>
<span style="color: #7590db;">X</span> = np.linspace(-1, 1, 200)
np.random.shuffle(X)    <span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">randomize the data</span>
<span style="color: #7590db;">Y</span> = 0.5 * X + 2 + np.random.normal(0, 0.05, (200 ))
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">plot data</span>
plt.scatter(X, Y)
plt.show()

<span style="color: #7590db;">X_train</span>, <span style="color: #7590db;">Y_train</span> = X[:160], Y[:160]     <span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">first 160 data points</span>
<span style="color: #7590db;">X_test</span>, <span style="color: #7590db;">Y_test</span> = X[160:], Y[160:]       <span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">last 40 data points</span>

<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">build a neural network from the 1st layer to the last layer</span>
<span style="color: #7590db;">model</span> = Sequential()

model.add(Dense(units=1, input_dim=1)) 

<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">choose loss function and optimizing method</span>
model.<span style="color: #4f97d7;">compile</span>(loss=<span style="color: #2d9574;">'mse'</span>, optimizer=<span style="color: #2d9574;">'sgd'</span>)

<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">training</span>
<span style="color: #4f97d7;">print</span>(<span style="color: #2d9574;">'Training -----------'</span>)
<span style="color: #4f97d7; font-weight: bold;">for</span> step <span style="color: #4f97d7; font-weight: bold;">in</span> <span style="color: #4f97d7;">range</span>(301):
<span style="background-color: #292e34;"> </span>   <span style="color: #7590db;">cost</span> = model.train_on_batch(X_train, Y_train)
<span style="background-color: #292e34;"> </span>   <span style="color: #4f97d7; font-weight: bold;">if</span> step % 100 == 0:
<span style="background-color: #292e34;"> </span>   <span style="background-color: #292e34;"> </span>   <span style="color: #4f97d7;">print</span>(<span style="color: #2d9574;">'train cost: '</span>, cost)

<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">test</span>
<span style="color: #4f97d7;">print</span>(<span style="color: #2d9574;">'</span><span style="color: #a45bad;">\n</span><span style="color: #2d9574;">Testing ------------'</span>)
<span style="color: #7590db;">cost</span> = model.evaluate(X_test, Y_test, batch_size=40)
<span style="color: #4f97d7;">print</span>(<span style="color: #2d9574;">'test cost:'</span>, cost)
<span style="color: #7590db;">W</span>, <span style="color: #7590db;">b</span> = model.layers[0].get_weights()
<span style="color: #4f97d7;">print</span>(<span style="color: #2d9574;">'Weights='</span>, W, <span style="color: #2d9574;">'</span><span style="color: #a45bad;">\n</span><span style="color: #2d9574;">biases='</span>, b)

<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">plotting the prediction</span>
<span style="color: #7590db;">Y_pred</span> = model.predict(X_test)
plt.scatter(X_test, Y_test)
plt.plot(X_test, Y_pred)
plt.show()
</pre>
</div>
</div>
</div>
</div>
