content/python.org
*** decisiontree
#+BEGIN_SRC python
  from sklearn.feature_extraction import DictVectorizer
  import csv
  from sklearn import preprocessing
  from sklearn import tree
  from sklearn.externals.six import StringIO
  import numpy as np
  import pandas as pd
  from pylab import *

  allElectronicsData = open("computer.csv")
  reader = csv.reader(allElectronicsData)
  headers = next(reader)
  print(headers)
  print(reader)

  featureList = []
  labelList = []
  for row in reader:
      labelList.append(row[len(row)-1])
      rowDict = {}
      for i in range(1,len(row)-1):
          rowDict[headers[i]] = row[i]
      featureList.append(rowDict)
  print(featureList)

  vec = DictVectorizer()
  dummyX = vec.fit_transform(featureList).toarray()
  print("dummyX: " + str(dummyX))
  print(vec.get_feature_names())

  print("labeList" + str(labelList))
  lb = preprocessing.LabelBinarizer()
  dummyY = lb.fit_transform(labelList)
  print("dummyY:" + str(dummyY))

  clf = tree.DecisionTreeClassifier(criterion= 'entropy')
  clf = clf.fit(dummyX,dummyY)
  print("clf :" + str(clf))

  # save as dot
  with open("output.dot","w") as f:
      f = tree.export_graphviz(clf, feature_names= vec.get_feature_names(), out_file = f)
    
  #in terminnal gives the flowwing comands

  #    dot -Tpdf -O output.dot
  #    xdg-open output.pdf

#+END_SRC
*** cross validation 1
#+BEGIN_SRC python
  # View more python learning tutorial on my Youtube and Youku channel!!!

  # Youtube video tutorial: https://www.youtube.com/channel/UCdyjiB5H8Pu7aDTNVXTTpcg
  # Youku video tutorial: http://i.youku.com/pythontutorial

  """
  Please note, this code is only for python 3+. If you are using python 2+, please modify the code accordingly.
  """
  from __future__ import print_function
  from sklearn.datasets import load_iris
  from sklearn.cross_validation import train_test_split
  from sklearn.neighbors import KNeighborsClassifier

  iris = load_iris()
  X = iris.data
  y = iris.target

  # test train split #
  X_train, X_test, y_train, y_test = train_test_split(X, y, random_state=4)
  knn = KNeighborsClassifier(n_neighbors=5)
  knn.fit(X_train, y_train)
  y_pred = knn.predict(X_test)
  print(knn.score(X_test, y_test))

  # this is cross_val_score #
  from sklearn.cross_validation import cross_val_score
  knn = KNeighborsClassifier(n_neighbors=5)
  scores = cross_val_score(knn, X, y, cv=5, scoring='accuracy')
  print(scores)

  # this is how to use cross_val_score to choose model and configs #
  from sklearn.cross_validation import cross_val_score
  import matplotlib.pyplot as plt
  k_range = range(1, 31)
  k_scores = []
  for k in k_range:
      knn = KNeighborsClassifier(n_neighbors=k)
      loss = -cross_val_score(knn, X, y, cv=10, scoring='mean_squared_error') # for regression
      k_scores.append(loss.mean())

  plt.plot(k_range, k_scores)
  plt.xlabel('Value of K for KNN')
  plt.ylabel('Cross-Validated Accuracy')
  plt.show()


#+END_SRC

