html/Python.html

<div id="outline-container-org5437b22" class="outline-4">
<h4 id="org5437b22"><span class="section-number-4">9.6.3.</span> cross validation 2</h4>
<div class="outline-text-4" id="text-9-6-3">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">View more python learning tutorial on my Youtube and Youku channel!!!</span>

<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">Youtube video tutorial: https://www.youtube.com/channel/UCdyjiB5H8Pu7aDTNVXTTpcg</span>
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">Youku video tutorial: http://i.youku.com/pythontutorial</span>

<span style="color: #9f8766;">"""</span>
<span style="color: #9f8766;">Please note, this code is only for python 3+. If you are using python 2+, please modify the code accordingly.</span>
<span style="color: #9f8766;">"""</span>
<span style="color: #4f97d7; font-weight: bold;">from</span> __future__ <span style="color: #4f97d7; font-weight: bold;">import</span> print_function
<span style="color: #4f97d7; font-weight: bold;">from</span> sklearn.learning_curve <span style="color: #4f97d7; font-weight: bold;">import</span>  learning_curve
<span style="color: #4f97d7; font-weight: bold;">from</span> sklearn.datasets <span style="color: #4f97d7; font-weight: bold;">import</span> load_digits
<span style="color: #4f97d7; font-weight: bold;">from</span> sklearn.svm <span style="color: #4f97d7; font-weight: bold;">import</span> SVC
<span style="color: #4f97d7; font-weight: bold;">import</span> matplotlib.pyplot <span style="color: #4f97d7; font-weight: bold;">as</span> plt
<span style="color: #4f97d7; font-weight: bold;">import</span> numpy <span style="color: #4f97d7; font-weight: bold;">as</span> np

<span style="color: #7590db;">digits</span> = load_digits()
<span style="color: #7590db;">X</span> = digits.data
<span style="color: #7590db;">y</span> = digits.target
<span style="color: #7590db;">train_sizes</span>, <span style="color: #7590db;">train_loss</span>, <span style="color: #7590db;">test_loss</span>= learning_curve(
<span style="background-color: #292e34;"> </span>   <span style="background-color: #292e34;"> </span>   SVC(gamma=0.01), X, y, cv=10, scoring=<span style="color: #2d9574;">'mean_squared_error'</span>,
<span style="background-color: #292e34;"> </span>   <span style="background-color: #292e34;"> </span>   train_sizes=[0.1, 0.25, 0.5, 0.75, 1])
<span style="color: #7590db;">train_loss_mean</span> = -np.mean(train_loss, axis=1)
<span style="color: #7590db;">test_loss_mean</span> = -np.mean(test_loss, axis=1)

plt.plot(train_sizes, train_loss_mean, <span style="color: #2d9574;">'o-'</span>, color=<span style="color: #2d9574;">"r"</span>,
<span style="background-color: #292e34;"> </span>   <span style="background-color: #292e34;"> </span>   <span style="background-color: #292e34;"> </span>   <span style="background-color: #292e34;"> </span>label=<span style="color: #2d9574;">"Training"</span>)
plt.plot(train_sizes, test_loss_mean, <span style="color: #2d9574;">'o-'</span>, color=<span style="color: #2d9574;">"g"</span>,
<span style="background-color: #292e34;"> </span>   <span style="background-color: #292e34;"> </span>   <span style="background-color: #292e34;"> </span>   <span style="background-color: #292e34;"> </span>label=<span style="color: #2d9574;">"Cross-validation"</span>)

plt.xlabel(<span style="color: #2d9574;">"Training examples"</span>)
plt.ylabel(<span style="color: #2d9574;">"Loss"</span>)
plt.legend(loc=<span style="color: #2d9574;">"best"</span>)
plt.show()


</pre>
</div>
</div>
</div>

<div id="outline-container-org404160e" class="outline-4">
<h4 id="org404160e"><span class="section-number-4">9.6.4.</span> corss validation 3</h4>
<div class="outline-text-4" id="text-9-6-4">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">View more python learning tutorial on my Youtube and Youku channel!!!</span>

<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">Youtube video tutorial: https://www.youtube.com/channel/UCdyjiB5H8Pu7aDTNVXTTpcg</span>
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">Youku video tutorial: http://i.youku.com/pythontutorial</span>

<span style="color: #9f8766;">"""</span>
<span style="color: #9f8766;">Please note, this code is only for python 3+. If you are using python 2+, please modify the code accordingly.</span>
<span style="color: #9f8766;">"""</span>
<span style="color: #4f97d7; font-weight: bold;">from</span> __future__ <span style="color: #4f97d7; font-weight: bold;">import</span> print_function
<span style="color: #4f97d7; font-weight: bold;">from</span> sklearn.learning_curve <span style="color: #4f97d7; font-weight: bold;">import</span>  validation_curve
<span style="color: #4f97d7; font-weight: bold;">from</span> sklearn.datasets <span style="color: #4f97d7; font-weight: bold;">import</span> load_digits
<span style="color: #4f97d7; font-weight: bold;">from</span> sklearn.svm <span style="color: #4f97d7; font-weight: bold;">import</span> SVC
<span style="color: #4f97d7; font-weight: bold;">import</span> matplotlib.pyplot <span style="color: #4f97d7; font-weight: bold;">as</span> plt
<span style="color: #4f97d7; font-weight: bold;">import</span> numpy <span style="color: #4f97d7; font-weight: bold;">as</span> np

<span style="color: #7590db;">digits</span> = load_digits()
<span style="color: #7590db;">X</span> = digits.data
<span style="color: #7590db;">y</span> = digits.target
<span style="color: #7590db;">param_range</span> = np.logspace(-6, -2.3, 5)
<span style="color: #7590db;">train_loss</span>, <span style="color: #7590db;">test_loss</span> = validation_curve(
<span style="background-color: #292e34;"> </span>   <span style="background-color: #292e34;"> </span>   SVC(), X, y, param_name=<span style="color: #2d9574;">'gamma'</span>, param_range=param_range, cv=10,
<span style="background-color: #292e34;"> </span>   <span style="background-color: #292e34;"> </span>   scoring=<span style="color: #2d9574;">'mean_squared_error'</span>)
<span style="color: #7590db;">train_loss_mean</span> = -np.mean(train_loss, axis=1)
<span style="color: #7590db;">test_loss_mean</span> = -np.mean(test_loss, axis=1)

plt.plot(param_range, train_loss_mean, <span style="color: #2d9574;">'o-'</span>, color=<span style="color: #2d9574;">"r"</span>,
<span style="background-color: #292e34;"> </span>   <span style="background-color: #292e34;"> </span>   <span style="background-color: #292e34;"> </span>   <span style="background-color: #292e34;"> </span>label=<span style="color: #2d9574;">"Training"</span>)
plt.plot(param_range, test_loss_mean, <span style="color: #2d9574;">'o-'</span>, color=<span style="color: #2d9574;">"g"</span>,
<span style="background-color: #292e34;"> </span>   <span style="background-color: #292e34;"> </span>   <span style="background-color: #292e34;"> </span>   <span style="background-color: #292e34;"> </span>label=<span style="color: #2d9574;">"Cross-validation"</span>)

plt.xlabel(<span style="color: #2d9574;">"gamma"</span>)
plt.ylabel(<span style="color: #2d9574;">"Loss"</span>)
plt.legend(loc=<span style="color: #2d9574;">"best"</span>)
plt.show()


</pre>
</div>
</div>
</div>
<div id="outline-container-org2f65a35" class="outline-4">
<h4 id="org2f65a35"><span class="section-number-4">9.6.5.</span> data application</h4>
<div class="outline-text-4" id="text-9-6-5">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">View more python learning tutorial on my Youtube and Youku channel!!!</span>

<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">Youtube video tutorial: https://www.youtube.com/channel/UCdyjiB5H8Pu7aDTNVXTTpcg</span>
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">Youku video tutorial: http://i.youku.com/pythontutorial</span>

<span style="color: #9f8766;">"""</span>
<span style="color: #9f8766;">Please note, this code is only for python 3+. If you are using python 2+, please modify the code accordingly.</span>
<span style="color: #9f8766;">"""</span>
<span style="color: #4f97d7; font-weight: bold;">from</span> __future__ <span style="color: #4f97d7; font-weight: bold;">import</span> print_function
<span style="color: #4f97d7; font-weight: bold;">from</span> sklearn <span style="color: #4f97d7; font-weight: bold;">import</span> datasets
<span style="color: #4f97d7; font-weight: bold;">from</span> sklearn.linear_model <span style="color: #4f97d7; font-weight: bold;">import</span> LinearRegression
<span style="color: #4f97d7; font-weight: bold;">import</span> matplotlib.pyplot <span style="color: #4f97d7; font-weight: bold;">as</span> plt

<span style="color: #7590db;">loaded_data</span> = datasets.load_boston()
<span style="color: #7590db;">data_X</span> = loaded_data.data
<span style="color: #7590db;">data_y</span> = loaded_data.target

<span style="color: #7590db;">model</span> = LinearRegression()
model.fit(data_X, data_y)

<span style="color: #4f97d7;">print</span>(model.predict(data_X[:4, :]))
<span style="color: #4f97d7;">print</span>(data_y[:4])

<span style="color: #7590db;">X</span>, <span style="color: #7590db;">y</span> = datasets.make_regression(n_samples=100, n_features=1, n_targets=1, noise=1)
plt.scatter(X, y)
plt.show()


</pre>
</div>
</div>
</div>
