content/python.org
*** eigenschaft function
#+BEGIN_SRC python
  # View more python learning tutorial on my Youtube and Youku channel!!!

  # Youtube video tutorial: https://www.youtube.com/channel/UCdyjiB5H8Pu7aDTNVXTTpcg
  # Youku video tutorial: http://i.youku.com/pythontutorial

  """
  Please note, this code is only for python 3+. If you are using python 2+, please modify the code accordingly.
  """
  from __future__ import print_function
  from sklearn import datasets
  from sklearn.linear_model import LinearRegression

  loaded_data = datasets.load_boston()
  data_X = loaded_data.data
  data_y = loaded_data.target

  model = LinearRegression()
  model.fit(data_X, data_y)

  print(model.predict(data_X[:4, :]))
  print(model.coef_)
  print(model.intercept_)
  print(model.get_params())
  print(model.score(data_X, data_y)) # R^2 coefficient of determination


#+END_SRC
*** iris
   View more python learning tutorial on my Youtube and Youku channel!!!

  Youtube video tutorial: https://www.youtube.com/channel/UCdyjiB5H8Pu7aDTNVXTTpcg
  Youku video tutorial: http://i.youku.com/pythontutorial

#+BEGIN_SRC python

  """
  Please note, this code is only for python 3+. If you are using python 2+, please modify the code accordingly.
  """
  from __future__ import print_function
  from sklearn import datasets
  from sklearn.model_selection import train_test_split
  from sklearn.neighbors import KNeighborsClassifier

  iris = datasets.load_iris()
  iris_X = iris.data
  iris_y = iris.target


  X_train, X_test, y_train, y_test = train_test_split(
      iris_X, iris_y, test_size=0.3)


  knn = KNeighborsClassifier()
  knn.fit(X_train, y_train)
  print(knn.predict(X_test))
  print(y_test)


#+END_SRC
*** normnalization
#+BEGIN_SRC python
# View more python learning tutorial on my Youtube and Youku channel!!!

# Youtube video tutorial: https://www.youtube.com/channel/UCdyjiB5H8Pu7aDTNVXTTpcg
# Youku video tutorial: http://i.youku.com/pythontutorial

"""
Please note, this code is only for python 3+. If you are using python 2+, please modify the code accordingly.
"""
from __future__ import print_function
from sklearn import preprocessing
import numpy as np
from sklearn.model_selection import train_test_split
from sklearn.datasets.samples_generator import make_classification
from sklearn.svm import SVC
import matplotlib.pyplot as plt

a = np.array([[10, 2.7, 3.6],
                     [-100, 5, -2],
                     [120, 20, 40]], dtype=np.float64)
print(a)
print(preprocessing.scale(a))

X, y = make_classification(n_samples=300, n_features=2 , n_redundant=0, n_informative=2, random_state=22, n_clusters_per_class=1, scale=100)
plt.scatter(X[:, 0], X[:, 1], c=y)
plt.show()
X = preprocessing.scale(X)    # normalization step
X_train, X_test, y_train, y_test = train_test_split(X, y, test_size=.3)
clf = SVC()
clf.fit(X_train, y_train)
print(clf.score(X_test, y_test))


#+END_SRC
