html/Python.html
<div id="outline-container-orga505df7" class="outline-4">
<h4 id="orga505df7"><span class="section-number-4">9.6.6.</span> eigenschaft function</h4>
<div class="outline-text-4" id="text-9-6-6">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">View more python learning tutorial on my Youtube and Youku channel!!!</span>

<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">Youtube video tutorial: https://www.youtube.com/channel/UCdyjiB5H8Pu7aDTNVXTTpcg</span>
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">Youku video tutorial: http://i.youku.com/pythontutorial</span>

<span style="color: #9f8766;">"""</span>
<span style="color: #9f8766;">Please note, this code is only for python 3+. If you are using python 2+, please modify the code accordingly.</span>
<span style="color: #9f8766;">"""</span>
<span style="color: #4f97d7; font-weight: bold;">from</span> __future__ <span style="color: #4f97d7; font-weight: bold;">import</span> print_function
<span style="color: #4f97d7; font-weight: bold;">from</span> sklearn <span style="color: #4f97d7; font-weight: bold;">import</span> datasets
<span style="color: #4f97d7; font-weight: bold;">from</span> sklearn.linear_model <span style="color: #4f97d7; font-weight: bold;">import</span> LinearRegression

<span style="color: #7590db;">loaded_data</span> = datasets.load_boston()
<span style="color: #7590db;">data_X</span> = loaded_data.data
<span style="color: #7590db;">data_y</span> = loaded_data.target

<span style="color: #7590db;">model</span> = LinearRegression()
model.fit(data_X, data_y)

<span style="color: #4f97d7;">print</span>(model.predict(data_X[:4, :]))
<span style="color: #4f97d7;">print</span>(model.coef_)
<span style="color: #4f97d7;">print</span>(model.intercept_)
<span style="color: #4f97d7;">print</span>(model.get_params())
<span style="color: #4f97d7;">print</span>(model.score(data_X, data_y)) <span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">R^2 coefficient of determination</span>


</pre>
</div>
</div>
</div>
<div id="outline-container-orgad2040e" class="outline-4">
<h4 id="orgad2040e"><span class="section-number-4">9.6.7.</span> iris</h4>
<div class="outline-text-4" id="text-9-6-7">
<p>
View more python learning tutorial on my Youtube and Youku channel!!!
</p>

<p>
Youtube video tutorial: <a href="https://www.youtube.com/channel/UCdyjiB5H8Pu7aDTNVXTTpcg">https://www.youtube.com/channel/UCdyjiB5H8Pu7aDTNVXTTpcg</a>
Youku video tutorial: <a href="http://i.youku.com/pythontutorial">http://i.youku.com/pythontutorial</a>
</p>

<div class="org-src-container">
<pre class="src src-python">
<span style="color: #9f8766;">"""</span>
<span style="color: #9f8766;">Please note, this code is only for python 3+. If you are using python 2+, please modify the code accordingly.</span>
<span style="color: #9f8766;">"""</span>
<span style="color: #4f97d7; font-weight: bold;">from</span> __future__ <span style="color: #4f97d7; font-weight: bold;">import</span> print_function
<span style="color: #4f97d7; font-weight: bold;">from</span> sklearn <span style="color: #4f97d7; font-weight: bold;">import</span> datasets
<span style="color: #4f97d7; font-weight: bold;">from</span> sklearn.model_selection <span style="color: #4f97d7; font-weight: bold;">import</span> train_test_split
<span style="color: #4f97d7; font-weight: bold;">from</span> sklearn.neighbors <span style="color: #4f97d7; font-weight: bold;">import</span> KNeighborsClassifier

<span style="color: #7590db;">iris</span> = datasets.load_iris()
<span style="color: #7590db;">iris_X</span> = iris.data
<span style="color: #7590db;">iris_y</span> = iris.target


<span style="color: #7590db;">X_train</span>, <span style="color: #7590db;">X_test</span>, <span style="color: #7590db;">y_train</span>, <span style="color: #7590db;">y_test</span> = train_test_split(
<span style="background-color: #292e34;"> </span>   iris_X, iris_y, test_size=0.3)


<span style="color: #7590db;">knn</span> = KNeighborsClassifier()
knn.fit(X_train, y_train)
<span style="color: #4f97d7;">print</span>(knn.predict(X_test))
<span style="color: #4f97d7;">print</span>(y_test)


</pre>
</div>
</div>
</div>
<div id="outline-container-org24199c4" class="outline-4">
<h4 id="org24199c4"><span class="section-number-4">9.6.8.</span> normnalization</h4>
<div class="outline-text-4" id="text-9-6-8">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">View more python learning tutorial on my Youtube and Youku channel!!!</span>

<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">Youtube video tutorial: https://www.youtube.com/channel/UCdyjiB5H8Pu7aDTNVXTTpcg</span>
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">Youku video tutorial: http://i.youku.com/pythontutorial</span>

<span style="color: #9f8766;">"""</span>
<span style="color: #9f8766;">Please note, this code is only for python 3+. If you are using python 2+, please modify the code accordingly.</span>
<span style="color: #9f8766;">"""</span>
<span style="color: #4f97d7; font-weight: bold;">from</span> __future__ <span style="color: #4f97d7; font-weight: bold;">import</span> print_function
<span style="color: #4f97d7; font-weight: bold;">from</span> sklearn <span style="color: #4f97d7; font-weight: bold;">import</span> preprocessing
<span style="color: #4f97d7; font-weight: bold;">import</span> numpy <span style="color: #4f97d7; font-weight: bold;">as</span> np
<span style="color: #4f97d7; font-weight: bold;">from</span> sklearn.model_selection <span style="color: #4f97d7; font-weight: bold;">import</span> train_test_split
<span style="color: #4f97d7; font-weight: bold;">from</span> sklearn.datasets.samples_generator <span style="color: #4f97d7; font-weight: bold;">import</span> make_classification
<span style="color: #4f97d7; font-weight: bold;">from</span> sklearn.svm <span style="color: #4f97d7; font-weight: bold;">import</span> SVC
<span style="color: #4f97d7; font-weight: bold;">import</span> matplotlib.pyplot <span style="color: #4f97d7; font-weight: bold;">as</span> plt

<span style="color: #7590db;">a</span> = np.array([[10, 2.7, 3.6],
<span style="background-color: #292e34;"> </span>   <span style="background-color: #292e34;"> </span>   <span style="background-color: #292e34;"> </span>   <span style="background-color: #292e34;"> </span>   <span style="background-color: #292e34;"> </span>   <span style="background-color: #292e34;"> </span>[-100, 5, -2],
<span style="background-color: #292e34;"> </span>   <span style="background-color: #292e34;"> </span>   <span style="background-color: #292e34;"> </span>   <span style="background-color: #292e34;"> </span>   <span style="background-color: #292e34;"> </span>   <span style="background-color: #292e34;"> </span>[120, 20, 40]], dtype=np.float64)
<span style="color: #4f97d7;">print</span>(a)
<span style="color: #4f97d7;">print</span>(preprocessing.scale(a))

<span style="color: #7590db;">X</span>, <span style="color: #7590db;">y</span> = make_classification(n_samples=300, n_features=2 , n_redundant=0, n_informative=2, random_state=22, n_clusters_per_class=1, scale=100)
plt.scatter(X[:, 0], X[:, 1], c=y)
plt.show()
<span style="color: #7590db;">X</span> = preprocessing.scale(X)    <span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">normalization step</span>
<span style="color: #7590db;">X_train</span>, <span style="color: #7590db;">X_test</span>, <span style="color: #7590db;">y_train</span>, <span style="color: #7590db;">y_test</span> = train_test_split(X, y, test_size=.3)
<span style="color: #7590db;">clf</span> = SVC()
clf.fit(X_train, y_train)
<span style="color: #4f97d7;">print</span>(clf.score(X_test, y_test))


</pre>
</div>
</div>
</div>
