content/python.org
*** save load
#+BEGIN_SRC python
  # View more python tutorials on my Youtube and Youku channel!!!

  # Youtube video tutorial: https://www.youtube.com/channel/UCdyjiB5H8Pu7aDTNVXTTpcg
  # Youku video tutorial: http://i.youku.com/pythontutorial

  """
  Please note, this code is only for python 3+. If you are using python 2+, please modify the code accordingly.
  """
  from __future__ import print_function
  from sklearn import svm
  from sklearn import datasets

  clf = svm.SVC()
  iris = datasets.load_iris()
  X, y = iris.data, iris.target
  clf.fit(X, y)

  # # method 1: pickle
  # import pickle
  # # save
  # with open('save/clf.pickle', 'wb') as f:
  #     pickle.dump(clf, f)
  # # restore
  # with open('save/clf.pickle', 'rb') as f:
  #    clf2 = pickle.load(f)
  #    print(clf2.predict(X[0:1]))

  # method 2: joblib
  from sklearn.externals import joblib
  # Save
  joblib.dump(clf, 'save/clf.pkl')
  # restore
  clf3 = joblib.load('save/clf.pkl')
  print(clf3.predict(X[0:1]))


#+END_SRC
** theano 
*** basic
#+BEGIN_SRC python :results output
  # View more python tutorials on my Youtube and Youku channel!!!

  # Youtube video tutorial: https://www.youtube.com/channel/UCdyjiB5H8Pu7aDTNVXTTpcg
  # Youku video tutorial: http://i.youku.com/pythontutorial

  # 4 - basic usage
  #   from __future__ import print_function
  import numpy as np
  import theano.tensor as T
  from theano import function

  # basic
  x = T.dscalar('x')
  y = T.dscalar('y')
  z = x+y     # define the actual function in here
  f = function([x, y], z)  # the inputs are in [], and the output in the "z"

  print(f(2,3))  # only give the inputs "x and y" for this function, then it will calculate the output "z"

  # # to pretty-print the function
  from theano import pp
  print(pp(z))

  # # how about matrix
  x = T.dmatrix('x')
  y = T.dmatrix('y')
  z = x + y
  f = function([x, y], z)
  print(f(np.arange(12).reshape((3,4)), 10*np.ones((3,4))))


#+END_SRC

#+RESULTS:
: 5.0
: (x + y)
: [[10. 11. 12. 13.]
:  [14. 15. 16. 17.]
:  [18. 19. 20. 21.]]

* Tensorflow 2 
** Tensorflow foundation
*** 数值类型 
|--------+------+---------+-----------------------+----------------------|
| type   | diam | shape   | example               | function             |
| Scalar |    0 | []      | []                    | acc                  |
| Vector |    1 | [n,]    | [1.0]                 | bias (b)             |
| Matrix |    2 | [n, m]  | [[1,2],[3,4]]         | weight (W)           |
| Tensor |   >=3 | [n,m,p] | [[[1],[1]],[[2],[2]]] | input ( [n, h, w, 3] |
|--------+------+---------+-----------------------+----------------------|

#+begin_src python

a = tf.constant(example)
tf.constant()  # 功能类似于tf.convert_to_tensor()
b = tf.constant('Hello Deep learning')
c = tf.constant(True)
dtype=tf.int16, int32, int64,tf.float16, tf.float32, tf.float64
tf.cast(a, tf.float64)
tf.Variable(a)    #可以添加a的可训练属性
tf.zeros([n,m])  tf.zeros_like(a)  == tf.zeros(a.shape)
tf.ones([n,m])   tf.ones_like(a)   == tf.ones(a.shape)
tf.fill([2,2],10)
tf.random.normal([2,2]) == tf.random.normal([2,2], mean=0, stddev=1)
tf.random.uniform(shape, minval=0,maxval=10,dtype=tf.float32)
tf.range(10) == tf.range(0,10, delta = 2)

#+end_src

#+RESULTS:

*** Reference(,) and Segment(:)
#+begin_src python
x = tf.random.normal([4,32,32,3])
x[2][1][0][1]  == x[2,1,0,1]

[start:end:step] for each dimension.
x[1:3:2, 1:4:2, 2:4:2, 1:3:2]

#+end_src

*** 改变视图
x = tf.random.normal([4,32,32,3]) 的数据是整体贮存的，可以合法的
reshape. 从后往前合并，拆分。

**** 增加维度
增加前置维度
tf.expand_dims(x, axis=0)
增加后置维度
tf.expand_dims(x, axis=-1)
也可以是其他值，表示在相应的位置增加一个维度

**** 删除维度
删除前置
tf.squeeze(x, axis=0)
后置和其他位置一样，删除dia=1的维度

*** 交换维度
这会改变数据的贮存顺序
x = tf.random.normal([2,32,32,3])
x = tf.transpose(x, perm=[0,3,1,2])
以前的维度下表变换为perm
 
*** Broadcasting
