html/Python.html
<div id="outline-container-orgbc23632" class="outline-4">
<h4 id="orgbc23632"><span class="section-number-4">9.6.9.</span> save load</h4>
<div class="outline-text-4" id="text-9-6-9">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">View more python tutorials on my Youtube and Youku channel!!!</span>

<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">Youtube video tutorial: https://www.youtube.com/channel/UCdyjiB5H8Pu7aDTNVXTTpcg</span>
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">Youku video tutorial: http://i.youku.com/pythontutorial</span>

<span style="color: #9f8766;">"""</span>
<span style="color: #9f8766;">Please note, this code is only for python 3+. If you are using python 2+, please modify the code accordingly.</span>
<span style="color: #9f8766;">"""</span>
<span style="color: #4f97d7; font-weight: bold;">from</span> __future__ <span style="color: #4f97d7; font-weight: bold;">import</span> print_function
<span style="color: #4f97d7; font-weight: bold;">from</span> sklearn <span style="color: #4f97d7; font-weight: bold;">import</span> svm
<span style="color: #4f97d7; font-weight: bold;">from</span> sklearn <span style="color: #4f97d7; font-weight: bold;">import</span> datasets

<span style="color: #7590db;">clf</span> = svm.SVC()
<span style="color: #7590db;">iris</span> = datasets.load_iris()
<span style="color: #7590db;">X</span>, <span style="color: #7590db;">y</span> = iris.data, iris.target
clf.fit(X, y)

<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;"># method 1: pickle</span>
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">import pickle</span>
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;"># save</span>
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">with open('save/clf.pickle', 'wb') as f:</span>
<span style="color: #2aa1ae; background-color: #292e34;">#     </span><span style="color: #2aa1ae; background-color: #292e34;">pickle.dump(clf, f)</span>
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;"># restore</span>
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">with open('save/clf.pickle', 'rb') as f:</span>
<span style="color: #2aa1ae; background-color: #292e34;">#    </span><span style="color: #2aa1ae; background-color: #292e34;">clf2 = pickle.load(f)</span>
<span style="color: #2aa1ae; background-color: #292e34;">#    </span><span style="color: #2aa1ae; background-color: #292e34;">print(clf2.predict(X[0:1]))</span>

<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">method 2: joblib</span>
<span style="color: #4f97d7; font-weight: bold;">from</span> sklearn.externals <span style="color: #4f97d7; font-weight: bold;">import</span> joblib
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">Save</span>
joblib.dump(clf, <span style="color: #2d9574;">'save/clf.pkl'</span>)
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">restore</span>
<span style="color: #7590db;">clf3</span> = joblib.load(<span style="color: #2d9574;">'save/clf.pkl'</span>)
<span style="color: #4f97d7;">print</span>(clf3.predict(X[0:1]))


</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org5c17284" class="outline-3">
<h3 id="org5c17284"><span class="section-number-3">9.7.</span> theano</h3>
<div class="outline-text-3" id="text-9-7">
</div>
<div id="outline-container-orgb5a4280" class="outline-4">
<h4 id="orgb5a4280"><span class="section-number-4">9.7.1.</span> basic</h4>
<div class="outline-text-4" id="text-9-7-1">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">View more python tutorials on my Youtube and Youku channel!!!</span>

<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">Youtube video tutorial: https://www.youtube.com/channel/UCdyjiB5H8Pu7aDTNVXTTpcg</span>
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">Youku video tutorial: http://i.youku.com/pythontutorial</span>

<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">4 - basic usage</span>
<span style="color: #2aa1ae; background-color: #292e34;">#   </span><span style="color: #2aa1ae; background-color: #292e34;">from __future__ import print_function</span>
<span style="color: #4f97d7; font-weight: bold;">import</span> numpy <span style="color: #4f97d7; font-weight: bold;">as</span> np
<span style="color: #4f97d7; font-weight: bold;">import</span> theano.tensor <span style="color: #4f97d7; font-weight: bold;">as</span> T
<span style="color: #4f97d7; font-weight: bold;">from</span> theano <span style="color: #4f97d7; font-weight: bold;">import</span> function

<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">basic</span>
<span style="color: #7590db;">x</span> = T.dscalar(<span style="color: #2d9574;">'x'</span>)
<span style="color: #7590db;">y</span> = T.dscalar(<span style="color: #2d9574;">'y'</span>)
<span style="color: #7590db;">z</span> = x+y     <span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">define the actual function in here</span>
<span style="color: #7590db;">f</span> = function([x, y], z)  <span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">the inputs are in [], and the output in the "z"</span>

<span style="color: #4f97d7;">print</span>(f(2,3))  <span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">only give the inputs "x and y" for this function, then it will calculate the output "z"</span>

<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;"># to pretty-print the function</span>
<span style="color: #4f97d7; font-weight: bold;">from</span> theano <span style="color: #4f97d7; font-weight: bold;">import</span> pp
<span style="color: #4f97d7;">print</span>(pp(z))

<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;"># how about matrix</span>
<span style="color: #7590db;">x</span> = T.dmatrix(<span style="color: #2d9574;">'x'</span>)
<span style="color: #7590db;">y</span> = T.dmatrix(<span style="color: #2d9574;">'y'</span>)
<span style="color: #7590db;">z</span> = x + y
<span style="color: #7590db;">f</span> = function([x, y], z)
<span style="color: #4f97d7;">print</span>(f(np.arange(12).reshape((3,4)), 10*np.ones((3,4))))


</pre>
</div>
</div>
</div>
</div>
</div>

<div id="outline-container-orgc235c28" class="outline-2">
<h2 id="orgc235c28"><span class="section-number-2">10.</span> Tensorflow 2</h2>
<div class="outline-text-2" id="text-10">
</div>
<div id="outline-container-org1198e72" class="outline-3">
<h3 id="org1198e72"><span class="section-number-3">10.1.</span> Tensorflow foundation</h3>
<div class="outline-text-3" id="text-10-1">
</div>
<div id="outline-container-org3ee66d6" class="outline-4">
<h4 id="org3ee66d6"><span class="section-number-4">10.1.1.</span> 数值类型</h4>
<div class="outline-text-4" id="text-10-1-1">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-right" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">type</td>
<td class="org-right">diam</td>
<td class="org-left">shape</td>
<td class="org-left">function</td>
</tr>

<tr>
<td class="org-left">Scalar</td>
<td class="org-right">0</td>
<td class="org-left">[]</td>
<td class="org-left">acc</td>
</tr>

<tr>
<td class="org-left">Vector</td>
<td class="org-right">1</td>
<td class="org-left">[n,]</td>
<td class="org-left">bias (b)</td>
</tr>

<tr>
<td class="org-left">Matrix</td>
<td class="org-right">2</td>
<td class="org-left">[n, m]</td>
<td class="org-left">weight (W)</td>
</tr>

<tr>
<td class="org-left">Tensor</td>
<td class="org-right">lg 3</td>
<td class="org-left">[n,m,p]</td>
<td class="org-left">input ( [n, h, w, 3]</td>
</tr>
</tbody>
</table>

<div class="org-src-container">
<pre class="src src-python">
<span style="color: #7590db;">a</span> = tf.constant(example)
tf.constant()  <span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">&#21151;&#33021;&#31867;&#20284;&#20110;tf.convert_to_tensor()</span>
<span style="color: #7590db;">b</span> = tf.constant(<span style="color: #2d9574;">'Hello Deep learning'</span>)
<span style="color: #7590db;">c</span> = tf.constant(<span style="color: #a45bad;">True</span>)
<span style="color: #7590db;">dtype</span>=tf.int16, int32, int64,tf.float16, tf.float32, tf.float64
tf.cast(a, tf.float64)
tf.Variable(a)    <span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">&#21487;&#20197;&#28155;&#21152;a&#30340;&#21487;&#35757;&#32451;&#23646;&#24615;</span>
tf.zeros([n,m])  tf.zeros_like(a)  == tf.zeros(a.shape)
tf.ones([n,m])   tf.ones_like(a)   == tf.ones(a.shape)
tf.fill([2,2],10)
tf.random.normal([2,2]) == tf.random.normal([2,2], mean=0, stddev=1)
tf.random.uniform(shape, minval=0,maxval=10,dtype=tf.float32)
tf.<span style="color: #4f97d7;">range</span>(10) == tf.<span style="color: #4f97d7;">range</span>(0,10, delta = 2)

</pre>
</div>
</div>
</div>

<div id="outline-container-org1e44052" class="outline-4">
<h4 id="org1e44052"><span class="section-number-4">10.1.2.</span> Reference(,) and Segment(:)</h4>
<div class="outline-text-4" id="text-10-1-2">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #7590db;">x</span> = tf.random.normal([4,32,32,3])
x[2][1][0][1]  == x[2,1,0,1]

[start:end:step] <span style="color: #4f97d7; font-weight: bold;">for</span> each dimension.
x[1:3:2, 1:4:2, 2:4:2, 1:3:2]

</pre>
</div>
</div>
</div>

<div id="outline-container-org8ade28e" class="outline-4">
<h4 id="org8ade28e"><span class="section-number-4">10.1.3.</span> 改变视图</h4>
<div class="outline-text-4" id="text-10-1-3">
<p>
x = tf.random.normal([4,32,32,3]) 的数据是整体贮存的，可以合法的
reshape. 从后往前合并，拆分。
</p>
</div>

<ol class="org-ol">
<li><a id="orgf492e60"></a>增加维度<br />
<div class="outline-text-5" id="text-10-1-3-1">
<p>
增加前置维度
tf.expand<sub>dims</sub>(x, axis=0)
增加后置维度
tf.expand<sub>dims</sub>(x, axis=-1)
也可以是其他值，表示在相应的位置增加一个维度
</p>
</div>
</li>

<li><a id="org6f98879"></a>删除维度<br />
<div class="outline-text-5" id="text-10-1-3-2">
<p>
删除前置
tf.squeeze(x, axis=0)
后置和其他位置一样，删除dia=1的维度
</p>
</div>
</li>
</ol>
</div>

<div id="outline-container-orgec9d2c6" class="outline-4">
<h4 id="orgec9d2c6"><span class="section-number-4">10.1.4.</span> 交换维度</h4>
<div class="outline-text-4" id="text-10-1-4">
<p>
这会改变数据的贮存顺序
x = tf.random.normal([2,32,32,3])
x = tf.transpose(x, perm=[0,3,1,2])
以前的维度下表变换为perm
</p>
</div>
</div>
