html/Python.html

<div id="outline-container-orgd72f59b" class="outline-4">
<h4 id="orgd72f59b"><span class="section-number-4">10.1.5.</span> Broadcasting</h4>
</div>
<div id="outline-container-org367fb08" class="outline-4">
<h4 id="org367fb08"><span class="section-number-4">10.1.6.</span> tile</h4>
<div class="outline-text-4" id="text-10-1-6">
<p>
x = tf.random.normal([4,32,32,3])
y = tf.tile(x,[2,3,3,1]) 对应维度各复制成原来的2，3，3，1倍。
</p>
</div>
</div>

<div id="outline-container-orge645736" class="outline-4">
<h4 id="orge645736"><span class="section-number-4">10.1.7.</span> Concatenate &amp; Stack &amp; Split &amp; unstack</h4>
<div class="outline-text-4" id="text-10-1-7">
<p>
tf.concat([a,b],axis=0) 除了axis=0外的所有维度都应该一样
tf.stack([a,b],axis=0) a,b的所有维度应该都一样，插入的位置和
expand<sub>dims</sub>() 遵守相同规则
tf.split(x, num<sub>or</sub><sub>size</sub><sub>splits</sub>=10, axis=0) 拆分的维度不消失
tf.unstack(x, axis=0) 拆为步长为1           拆分的维度消失
</p>
</div>
</div>

<div id="outline-container-org285769a" class="outline-4">
<h4 id="org285769a"><span class="section-number-4">10.1.8.</span> Statistik</h4>
<div class="outline-text-4" id="text-10-1-8">
<p>
L1 Norm  \(||x_{1}|| = \sum_{i}|x_{i}|\)
tf.norm(x, ord=1)
L2 Norm  \(||x_{2}|| = \sqrt{\sum_{i}|x_{i}|^2 }\)
tf.norm(x,ord=2)
</p>

<p>
tf.reduce<sub>max</sub>(x, axis=0)
tf.reduce<sub>min</sub>()
tf.reduce<sub>mean</sub>()
tf.reduce<sub>sum</sub>()
不指明axis则是对全局求解
tf.argmax(x, axis) 
tf.argmin(x,axis) axis 轴的极值坐标
</p>

<div class="org-src-container">
<pre class="src src-python">
<span style="color: #7590db;">out</span> = tf.random.normal([100,10])
<span style="color: #7590db;">out</span> = tf.nn.softmax(out, axis=1)
<span style="color: #7590db;">pred</span> = tf.argmax(out, axis=1)
<span style="color: #7590db;">y</span> = tf.random.uniform([100],dtype=tf.int64,maxval=10)
<span style="color: #7590db;">out</span> = tf.equal(pred, y)
<span style="color: #7590db;">out</span> = tf.cast(out, dtype=tf.float32)
<span style="color: #7590db;">cor</span> = tf.reduce_sum(out)
</pre>
</div>
</div>
</div>

<div id="outline-container-orgc736a0f" class="outline-4">
<h4 id="orgc736a0f"><span class="section-number-4">10.1.9.</span> Padding</h4>
<div class="outline-text-4" id="text-10-1-9">
<pre class="example">
x = tf.pad(x,[[0,2]]) []内是padding 填充的方案，每个[]表示一个维度
</pre>
</div>
</div>


<div id="outline-container-org343e3aa" class="outline-4">
<h4 id="org343e3aa"><span class="section-number-4">10.1.10.</span> advance manipulation</h4>
</div>
<div id="outline-container-org47e2aad" class="outline-4">
<h4 id="org47e2aad"><span class="section-number-4">10.1.11.</span> tf.minimum</h4>
<div class="outline-text-4" id="text-10-1-11">
<p>
tf.minimum(x, a) 最小a
tf.maximum(x, b) 最大b
tf.minimum(tf.maximum(x,2),7) == tf.clip<sub>by</sub><sub>value</sub>(x,2,7)
</p>
</div>
</div>

<div id="outline-container-orgf904bb7" class="outline-4">
<h4 id="orgf904bb7"><span class="section-number-4">10.1.12.</span> tf.gather</h4>
<div class="outline-text-4" id="text-10-1-12">
<p>
tf.gather(x, [0,2,4,5,7],axis =1) 抽取在axis=1上的[0,2,4,5,7]坐标的组
成数据，并可以重新定义组成数据的顺序
</p>
</div>
</div>
<div id="outline-container-orgf04359d" class="outline-4">
<h4 id="orgf04359d"><span class="section-number-4">10.1.13.</span> tf.gather<sub>nd</sub></h4>
<div class="outline-text-4" id="text-10-1-13">
<p>
后面根的[]说明了所有成员要操作的维度，
第一成员的第一维坐标为1，第二维坐标为1..
所有成员组成List
</p>
</div>
</div>
<div id="outline-container-orga4d3f13" class="outline-4">
<h4 id="orga4d3f13"><span class="section-number-4">10.1.14.</span> tf.boolean<sub>mask</sub></h4>
<div class="outline-text-4" id="text-10-1-14">
<p>
tf.boolean<sub>mask</sub>(x, mask=[True, False, True, False],axis =0)
在axis=0的轴上，只有mask成员是True才会被选中，mask 长度等于axis=0 轴的
长度。
</p>
</div>
</div>
<div id="outline-container-org29cf680" class="outline-4">
<h4 id="org29cf680"><span class="section-number-4">10.1.15.</span> tf.where</h4>
<div class="outline-text-4" id="text-10-1-15">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #7590db;">a</span> = tf.ones([3,3])
<span style="color: #7590db;">b</span> = tf.zeros([3,3])
<span style="color: #7590db;">cond</span> = tf.constant([<span style="color: #a45bad;">True</span>,<span style="color: #a45bad;">False</span>,<span style="color: #a45bad;">False</span>],[<span style="color: #a45bad;">False</span>, <span style="color: #a45bad;">True</span>, <span style="color: #a45bad;">True</span>],[<span style="color: #a45bad;">False</span>, <span style="color: #a45bad;">False</span>, <span style="color: #a45bad;">False</span>])
<span style="color: #7590db;">c</span> = tf.where(cond, a,b)
</pre>
</div>
<p>
tf.where(cond) 返回所有值为True元素的下标
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #7590db;">x</span> = tf.random.normal([3.3])
<span style="color: #7590db;">mask</span> = x&gt;0
<span style="color: #7590db;">ind</span> = tf.where(mask)
<span style="color: #7590db;">a</span> = tf.gather_nd(x,ind)
</pre>
</div>
</div>
</div>
<div id="outline-container-orgcdc1e04" class="outline-4">
<h4 id="orgcdc1e04"><span class="section-number-4">10.1.16.</span> tf.scatter<sub>nd</sub></h4>
<div class="outline-text-4" id="text-10-1-16">
<p>
在一个长度为8的空白向量（全为0）里，将updates按照indices的位置写入
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #7590db;">indices</span> = tf.constant([[4],[3],[2],[1]])
<span style="color: #7590db;">updates</span> = tf.constant([3,1,0,2])
tf.scatter_nd(indices, updates, [8])

</pre>
</div>
</div>
</div>

<div id="outline-container-orgc0e8788" class="outline-4">
<h4 id="orgc0e8788"><span class="section-number-4">10.1.17.</span> tf.meshgrid</h4>
<div class="outline-text-4" id="text-10-1-17">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #7590db;">x</span> = tf.linspace(-8., 8, 100)   <span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">-8&#21518;&#38754;&#30340;. &#19981;&#33021;&#30465;&#30053;</span>
<span style="color: #7590db;">y</span> = tf.linspace(-8., 8, 100)
x.<span style="color: #7590db;">shape</span> = 100
<span style="color: #7590db;">x</span>, <span style="color: #7590db;">y</span> = tf.meshgrid(x,y)
x.<span style="color: #7590db;">shape</span> = [100,100]
ax.contour3D(x.numpy(), y.numpy(), z.numpy(), 50)

</pre>
</div>
</div>
</div>
</div>
