content/python.org
** chapter 01 code

一个很简单的例子，用tf来求某个函数的导数
#+BEGIN_SRC python :results output
import tensorflow as tf
a = tf.constant(1.)
b = tf.constant(2.)
c = tf.constant(3.)
w = tf.constant(4.)

with tf.GradientTape() as tape:
    tape.watch([w])
    y = a*w**2 + b*w + c
[dy_dw] = tape.gradient(y, [w])
print(dy_dw)

#+END_SRC


检测cpu和gpu运行时的时间对比
#+begin_src python :results output 
  import tensorflow as tf
  import timeit

  n = 10000000
  with tf.device('/cpu:0'):
      cpu_a = tf.random.normal([1, n])
      cpu_b = tf.random.normal([n, 1])

  with tf.device('/gpu:0'):
      gpu_a = tf.random.normal([1, n])
      gpu_b = tf.random.normal([n, 1])

  def cpu_run():
      with tf.device('/cpu:0'):
          c = tf.matmul(cpu_a, cpu_b)
      return c

  def gpu_run():
      with tf.device('/gpu:0'):
          c = tf.matmul(gpu_a, cpu_b)
      return c

  cpu_time = timeit.timeit(cpu_run, number=10)
  gpu_time = timeit.timeit(cpu_run, number=10)
  print('run time: ', cpu_time, gpu_time)



#+end_src

#+RESULTS:
: run time:  0.0974298170003749 0.09593267899981583

不用tensorflow的API，使用纯函数来实现神经网络训练的例子
#+begin_src python :results output
import numpy as np
data = []
for i in range(100):
    x = np.random.uniform(-10., 10)
    y = 1.477*x + 0.089 + np.random.normal(0., 0.01)
    data.append([x, y])
data = np.array(data)


def mse(b, w, points):
    totalError = 0
    for i in range(0, len(points)):
        x = points[i, 0]
        y = points[i, 1]
        totalError += (y-(w*x+b))**2
    return totalError/float(len(points))


def step_gradient(b_current, w_current, points, lr):
    b_gradient = 0
    w_gradient = 0
    M = float(len(points))
    for i in range(0, len(points)):
        x = points[i, 0]
        y = points[i, 1]
        b_gradient += (2/M)*((w_current*x+b_current)-y)
        w_gradient += (2/M)*x*((w_current*x + b_current)-y)
    new_b = b_current - (lr*b_gradient)
    new_w = w_current - (lr*w_gradient)
    return [new_b, new_w]


def gradient_descent(points, staring_b, staring_w, lr, num_iterations):
    b = staring_b
    w = staring_w
    for step in range(num_iterations):
        b, w = step_gradient(b, w, np.array(points), lr)
        loss = mse(b, w, points)
        if step % 5000  == 0:
            print(f"iterations:{step}, loss :{loss}, w:{w}, b:{b}")
    return [b, w]


def main():
    lr = 0.001
    initial_b = 0
    initial_w = 0
    num_iterations = 100000
    [b, w] = gradient_descent(data, initial_b, initial_w, lr, num_iterations)
    loss = mse(b, w, data)
    print(f"Final loss :{loss}, w:{w}, b:{b}")


# if __name__ ==' __main__':
main()


#+end_src

#+RESULTS:
#+begin_example
iterations:0, loss :70.10079414302263, w:0.11067024890672035, b:0.003952550528332437
iterations:5000, loss :0.00010199717063390048, w:1.4769704836166537, b:0.08946956663994972
iterations:10000, loss :0.00010199716394347099, w:1.4769703908814773, b:0.08947221136809669
iterations:15000, loss :0.00010199716394347127, w:1.4769703908749494, b:0.08947221155430594
iterations:20000, loss :0.0001019971639434711, w:1.476970390874949, b:0.08947221155431519
iterations:25000, loss :0.0001019971639434711, w:1.476970390874949, b:0.08947221155431519
iterations:30000, loss :0.0001019971639434711, w:1.476970390874949, b:0.08947221155431519
iterations:35000, loss :0.0001019971639434711, w:1.476970390874949, b:0.08947221155431519
iterations:40000, loss :0.0001019971639434711, w:1.476970390874949, b:0.08947221155431519
iterations:45000, loss :0.0001019971639434711, w:1.476970390874949, b:0.08947221155431519
iterations:50000, loss :0.0001019971639434711, w:1.476970390874949, b:0.08947221155431519
iterations:55000, loss :0.0001019971639434711, w:1.476970390874949, b:0.08947221155431519
iterations:60000, loss :0.0001019971639434711, w:1.476970390874949, b:0.08947221155431519
iterations:65000, loss :0.0001019971639434711, w:1.476970390874949, b:0.08947221155431519
iterations:70000, loss :0.0001019971639434711, w:1.476970390874949, b:0.08947221155431519
iterations:75000, loss :0.0001019971639434711, w:1.476970390874949, b:0.08947221155431519
iterations:80000, loss :0.0001019971639434711, w:1.476970390874949, b:0.08947221155431519
iterations:85000, loss :0.0001019971639434711, w:1.476970390874949, b:0.08947221155431519
iterations:90000, loss :0.0001019971639434711, w:1.476970390874949, b:0.08947221155431519
iterations:95000, loss :0.0001019971639434711, w:1.476970390874949, b:0.08947221155431519
Final loss :0.0001019971639434711, w:1.476970390874949, b:0.08947221155431519
#+end_example

