html/Python.html

<div id="outline-container-org662bcd0" class="outline-3">
<h3 id="org662bcd0"><span class="section-number-3">10.2.</span> chapter 01 code</h3>
<div class="outline-text-3" id="text-10-2">
<p>
一个很简单的例子，用tf来求某个函数的导数
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #4f97d7; font-weight: bold;">import</span> tensorflow <span style="color: #4f97d7; font-weight: bold;">as</span> tf
<span style="color: #7590db;">a</span> = tf.constant(1.)
<span style="color: #7590db;">b</span> = tf.constant(2.)
<span style="color: #7590db;">c</span> = tf.constant(3.)
<span style="color: #7590db;">w</span> = tf.constant(4.)

<span style="color: #4f97d7; font-weight: bold;">with</span> tf.GradientTape() <span style="color: #4f97d7; font-weight: bold;">as</span> tape:
<span style="background-color: #292e34;"> </span>   tape.watch([w])
<span style="background-color: #292e34;"> </span>   <span style="color: #7590db;">y</span> = a*w**2 + b*w + c
[<span style="color: #7590db;">dy_dw</span>] = tape.gradient(y, [w])
<span style="color: #4f97d7;">print</span>(dy_dw)

</pre>
</div>


<p>
检测cpu和gpu运行时的时间对比
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #4f97d7; font-weight: bold;">import</span> tensorflow <span style="color: #4f97d7; font-weight: bold;">as</span> tf
<span style="color: #4f97d7; font-weight: bold;">import</span> timeit

<span style="color: #7590db;">n</span> = 10000000
<span style="color: #4f97d7; font-weight: bold;">with</span> tf.device(<span style="color: #2d9574;">'/cpu:0'</span>):
<span style="background-color: #292e34;"> </span>   <span style="color: #7590db;">cpu_a</span> = tf.random.normal([1, n])
<span style="background-color: #292e34;"> </span>   <span style="color: #7590db;">cpu_b</span> = tf.random.normal([n, 1])

<span style="color: #4f97d7; font-weight: bold;">with</span> tf.device(<span style="color: #2d9574;">'/gpu:0'</span>):
<span style="background-color: #292e34;"> </span>   <span style="color: #7590db;">gpu_a</span> = tf.random.normal([1, n])
<span style="background-color: #292e34;"> </span>   <span style="color: #7590db;">gpu_b</span> = tf.random.normal([n, 1])

<span style="color: #4f97d7; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">cpu_run</span>():
<span style="background-color: #292e34;"> </span>   <span style="color: #4f97d7; font-weight: bold;">with</span> tf.device(<span style="color: #2d9574;">'/cpu:0'</span>):
<span style="background-color: #292e34;"> </span>   <span style="background-color: #292e34;"> </span>   <span style="color: #7590db;">c</span> = tf.matmul(cpu_a, cpu_b)
<span style="background-color: #292e34;"> </span>   <span style="color: #4f97d7; font-weight: bold;">return</span> c

<span style="color: #4f97d7; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">gpu_run</span>():
<span style="background-color: #292e34;"> </span>   <span style="color: #4f97d7; font-weight: bold;">with</span> tf.device(<span style="color: #2d9574;">'/gpu:0'</span>):
<span style="background-color: #292e34;"> </span>   <span style="background-color: #292e34;"> </span>   <span style="color: #7590db;">c</span> = tf.matmul(gpu_a, cpu_b)
<span style="background-color: #292e34;"> </span>   <span style="color: #4f97d7; font-weight: bold;">return</span> c

<span style="color: #7590db;">cpu_time</span> = timeit.timeit(cpu_run, number=10)
<span style="color: #7590db;">gpu_time</span> = timeit.timeit(cpu_run, number=10)
<span style="color: #4f97d7;">print</span>(<span style="color: #2d9574;">'run time: '</span>, cpu_time, gpu_time)



</pre>
</div>

<p>
不用tensorflow的API，使用纯函数来实现神经网络训练的例子
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #4f97d7; font-weight: bold;">import</span> numpy <span style="color: #4f97d7; font-weight: bold;">as</span> np
<span style="color: #7590db;">data</span> = []
<span style="color: #4f97d7; font-weight: bold;">for</span> i <span style="color: #4f97d7; font-weight: bold;">in</span> <span style="color: #4f97d7;">range</span>(100):
<span style="background-color: #292e34;"> </span>   <span style="color: #7590db;">x</span> = np.random.uniform(-10., 10)
<span style="background-color: #292e34;"> </span>   <span style="color: #7590db;">y</span> = 1.477*x + 0.089 + np.random.normal(0., 0.01)
<span style="background-color: #292e34;"> </span>   data.append([x, y])
<span style="color: #7590db;">data</span> = np.array(data)


<span style="color: #4f97d7; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">mse</span>(b, w, points):
<span style="background-color: #292e34;"> </span>   <span style="color: #7590db;">totalError</span> = 0
<span style="background-color: #292e34;"> </span>   <span style="color: #4f97d7; font-weight: bold;">for</span> i <span style="color: #4f97d7; font-weight: bold;">in</span> <span style="color: #4f97d7;">range</span>(0, <span style="color: #4f97d7;">len</span>(points)):
<span style="background-color: #292e34;"> </span>   <span style="background-color: #292e34;"> </span>   <span style="color: #7590db;">x</span> = points[i, 0]
<span style="background-color: #292e34;"> </span>   <span style="background-color: #292e34;"> </span>   <span style="color: #7590db;">y</span> = points[i, 1]
<span style="background-color: #292e34;"> </span>   <span style="background-color: #292e34;"> </span>   <span style="color: #7590db;">totalError</span> += (y-(w*x+b))**2
<span style="background-color: #292e34;"> </span>   <span style="color: #4f97d7; font-weight: bold;">return</span> totalError/<span style="color: #4f97d7;">float</span>(<span style="color: #4f97d7;">len</span>(points))


<span style="color: #4f97d7; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">step_gradient</span>(b_current, w_current, points, lr):
<span style="background-color: #292e34;"> </span>   <span style="color: #7590db;">b_gradient</span> = 0
<span style="background-color: #292e34;"> </span>   <span style="color: #7590db;">w_gradient</span> = 0
<span style="background-color: #292e34;"> </span>   <span style="color: #7590db;">M</span> = <span style="color: #4f97d7;">float</span>(<span style="color: #4f97d7;">len</span>(points))
<span style="background-color: #292e34;"> </span>   <span style="color: #4f97d7; font-weight: bold;">for</span> i <span style="color: #4f97d7; font-weight: bold;">in</span> <span style="color: #4f97d7;">range</span>(0, <span style="color: #4f97d7;">len</span>(points)):
<span style="background-color: #292e34;"> </span>   <span style="background-color: #292e34;"> </span>   <span style="color: #7590db;">x</span> = points[i, 0]
<span style="background-color: #292e34;"> </span>   <span style="background-color: #292e34;"> </span>   <span style="color: #7590db;">y</span> = points[i, 1]
<span style="background-color: #292e34;"> </span>   <span style="background-color: #292e34;"> </span>   <span style="color: #7590db;">b_gradient</span> += (2/M)*((w_current*x+b_current)-y)
<span style="background-color: #292e34;"> </span>   <span style="background-color: #292e34;"> </span>   <span style="color: #7590db;">w_gradient</span> += (2/M)*x*((w_current*x + b_current)-y)
<span style="background-color: #292e34;"> </span>   <span style="color: #7590db;">new_b</span> = b_current - (lr*b_gradient)
<span style="background-color: #292e34;"> </span>   <span style="color: #7590db;">new_w</span> = w_current - (lr*w_gradient)
<span style="background-color: #292e34;"> </span>   <span style="color: #4f97d7; font-weight: bold;">return</span> [new_b, new_w]


<span style="color: #4f97d7; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">gradient_descent</span>(points, staring_b, staring_w, lr, num_iterations):
<span style="background-color: #292e34;"> </span>   <span style="color: #7590db;">b</span> = staring_b
<span style="background-color: #292e34;"> </span>   <span style="color: #7590db;">w</span> = staring_w
<span style="background-color: #292e34;"> </span>   <span style="color: #4f97d7; font-weight: bold;">for</span> step <span style="color: #4f97d7; font-weight: bold;">in</span> <span style="color: #4f97d7;">range</span>(num_iterations):
<span style="background-color: #292e34;"> </span>   <span style="background-color: #292e34;"> </span>   <span style="color: #7590db;">b</span>, <span style="color: #7590db;">w</span> = step_gradient(b, w, np.array(points), lr)
<span style="background-color: #292e34;"> </span>   <span style="background-color: #292e34;"> </span>   <span style="color: #7590db;">loss</span> = mse(b, w, points)
<span style="background-color: #292e34;"> </span>   <span style="background-color: #292e34;"> </span>   <span style="color: #4f97d7; font-weight: bold;">if</span> step % 5000  == 0:
<span style="background-color: #292e34;"> </span>   <span style="background-color: #292e34;"> </span>   <span style="background-color: #292e34;"> </span>   <span style="color: #4f97d7;">print</span>(f<span style="color: #2d9574;">"iterations:</span>{step}<span style="color: #2d9574;">, loss :</span>{loss}<span style="color: #2d9574;">, w:</span>{w}<span style="color: #2d9574;">, b:</span>{b}<span style="color: #2d9574;">"</span>)
<span style="background-color: #292e34;"> </span>   <span style="color: #4f97d7; font-weight: bold;">return</span> [b, w]


<span style="color: #4f97d7; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">main</span>():
<span style="background-color: #292e34;"> </span>   <span style="color: #7590db;">lr</span> = 0.001
<span style="background-color: #292e34;"> </span>   <span style="color: #7590db;">initial_b</span> = 0
<span style="background-color: #292e34;"> </span>   <span style="color: #7590db;">initial_w</span> = 0
<span style="background-color: #292e34;"> </span>   <span style="color: #7590db;">num_iterations</span> = 100000
<span style="background-color: #292e34;"> </span>   [<span style="color: #7590db;">b</span>, <span style="color: #7590db;">w</span>] = gradient_descent(data, initial_b, initial_w, lr, num_iterations)
<span style="background-color: #292e34;"> </span>   <span style="color: #7590db;">loss</span> = mse(b, w, data)
<span style="background-color: #292e34;"> </span>   <span style="color: #4f97d7;">print</span>(f<span style="color: #2d9574;">"Final loss :</span>{loss}<span style="color: #2d9574;">, w:</span>{w}<span style="color: #2d9574;">, b:</span>{b}<span style="color: #2d9574;">"</span>)


<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">if __name__ ==' __main__':</span>
main()


</pre>
</div>
</div>
</div>
