content/python.org
** MNIST dataset

#+begin_src python :results output :session MNIST_image
  import tensorflow as tf
  from tensorflow import keras
  from tensorflow.keras import layers, optimizers, datasets
  w1 = tf.Variable(tf.random.truncated_normal([784, 256], stddev=0.1))
  b1 = tf.Variable(tf.zeros([256]))
  w2 = tf.Variable(tf.random.truncated_normal([256, 128], stddev=0.1))
  b2 = tf.Variable(tf.zeros([128]))
  w3 = tf.Variable(tf.random.truncated_normal([128, 10], stddev=0.1))
  b3 = tf.Variable(tf.zeros([10]))
  (x,y),(x_val, y_val)=datasets.mnist.load_data()
  print('x:',x.shape, 'y:', y.shape,'x test:', x_val.shape, 'y test:', y_val)
  def preprocess(x, y):
      x = tf.cast(x, dtype = tf.float32)/255.
      x = tf.reshape(x, [-1,28*28])
      y = tf.cast(y,dtype=tf.int32)
      y = tf.one_hot(y, depth=10)
      return x,y
  train_db = tf.data.Dataset.from_tensor_slices((x,y))  #构建Dataset 对象
  train_db = train_db.shuffle(10000)                    # 打散样本顺序
  train_db = train_db.batch(128)                        #批训练
  train_db = train_db.map(preprocess)
  test_db = tf.data.Dataset.from_tensor_slices((x_val, y_val))
  test_db = test_db.shuffle(1000)
  test_db = test_db.batch(128)
  test_db = test_db.map(preprocess)
  lr = 0.001
  for epoch in range(8):
      for step, (x,y) in enumerate(train_db):
          with tf.GradientTape() as tape:
              h1 = x@w1 + tf.broadcast_to(b1, [x.shape[0], 256])
              h1 = tf.nn.relu(h1)
              h2 = h1@w2 + b2
              h2 = tf.nn.relu(h2)
              out = h2@w3 + b3
              loss = tf.square(y - out)
              loss = tf.reduce_mean(loss)
              grads = tape.gradient(loss, [w1,b1,w2,b2,w3,b3])
              w1.assign_sub(lr *grads[0])
              b1.assign_sub(lr * grads[1])
              w2.assign_sub(lr *grads[2])
              b2.assign_sub(lr * grads[3])
              w3.assign_sub(lr *grads[4])
              b3.assign_sub(lr * grads[5])
  for x, y in test_db:
      h1 = x@w1 + b1
      h1 = tf.nn.relu(h1)
      h2 = h1@w2 + b2
      h2 = tf.nn.relu(h2)
      out = h2@w3 + b3
      pred = tf.argmax(out,axis=1)
      y = tf.argmax(y, axis=1)
      correct = tf.equal(pred, y)
      total_correct +=tf.reduce_sum(tf.cast(correct,dty=tf.int32)).numpy()



#+end_src

