html/Python.html

<div id="outline-container-org7faa39e" class="outline-3">
<h3 id="org7faa39e"><span class="section-number-3">10.3.</span> MNIST dataset</h3>
<div class="outline-text-3" id="text-10-3">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #4f97d7; font-weight: bold;">import</span> tensorflow <span style="color: #4f97d7; font-weight: bold;">as</span> tf
<span style="color: #4f97d7; font-weight: bold;">from</span> tensorflow <span style="color: #4f97d7; font-weight: bold;">import</span> keras
<span style="color: #4f97d7; font-weight: bold;">from</span> tensorflow.keras <span style="color: #4f97d7; font-weight: bold;">import</span> layers, optimizers, datasets
<span style="color: #7590db;">w1</span> = tf.Variable(tf.random.truncated_normal([784, 256], stddev=0.1))
<span style="color: #7590db;">b1</span> = tf.Variable(tf.zeros([256]))
<span style="color: #7590db;">w2</span> = tf.Variable(tf.random.truncated_normal([256, 128], stddev=0.1))
<span style="color: #7590db;">b2</span> = tf.Variable(tf.zeros([128]))
<span style="color: #7590db;">w3</span> = tf.Variable(tf.random.truncated_normal([128, 10], stddev=0.1))
<span style="color: #7590db;">b3</span> = tf.Variable(tf.zeros([10]))
(x,y),(<span style="color: #7590db;">x_val</span>, <span style="color: #7590db;">y_val</span>)=datasets.mnist.load_data()
<span style="color: #4f97d7;">print</span>(<span style="color: #2d9574;">'x:'</span>,x.shape, <span style="color: #2d9574;">'y:'</span>, y.shape,<span style="color: #2d9574;">'x test:'</span>, x_val.shape, <span style="color: #2d9574;">'y test:'</span>, y_val)
<span style="color: #4f97d7; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">preprocess</span>(x, y):
<span style="background-color: #292e34;"> </span>   <span style="color: #7590db;">x</span> = tf.cast(x, dtype = tf.float32)/255.
<span style="background-color: #292e34;"> </span>   <span style="color: #7590db;">x</span> = tf.reshape(x, [-1,28*28])
<span style="background-color: #292e34;"> </span>   <span style="color: #7590db;">y</span> = tf.cast(y,dtype=tf.int32)
<span style="background-color: #292e34;"> </span>   <span style="color: #7590db;">y</span> = tf.one_hot(y, depth=10)
<span style="background-color: #292e34;"> </span>   <span style="color: #4f97d7; font-weight: bold;">return</span> x,y
<span style="color: #7590db;">train_db</span> = tf.data.Dataset.from_tensor_slices((x,y))  <span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">&#26500;&#24314;Dataset &#23545;&#35937;</span>
<span style="color: #7590db;">train_db</span> = train_db.shuffle(10000)                    <span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">&#25171;&#25955;&#26679;&#26412;&#39034;&#24207;</span>
<span style="color: #7590db;">train_db</span> = train_db.batch(128)                        <span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">&#25209;&#35757;&#32451;</span>
<span style="color: #7590db;">train_db</span> = train_db.<span style="color: #4f97d7;">map</span>(preprocess)
<span style="color: #7590db;">test_db</span> = tf.data.Dataset.from_tensor_slices((x_val, y_val))
<span style="color: #7590db;">test_db</span> = test_db.shuffle(1000)
<span style="color: #7590db;">test_db</span> = test_db.batch(128)
<span style="color: #7590db;">test_db</span> = test_db.<span style="color: #4f97d7;">map</span>(preprocess)
<span style="color: #7590db;">lr</span> = 0.001
<span style="color: #4f97d7; font-weight: bold;">for</span> epoch <span style="color: #4f97d7; font-weight: bold;">in</span> <span style="color: #4f97d7;">range</span>(8):
<span style="background-color: #292e34;"> </span>   <span style="color: #4f97d7; font-weight: bold;">for</span> step, (x,y) <span style="color: #4f97d7; font-weight: bold;">in</span> <span style="color: #4f97d7;">enumerate</span>(train_db):
<span style="background-color: #292e34;"> </span>   <span style="background-color: #292e34;"> </span>   <span style="color: #4f97d7; font-weight: bold;">with</span> tf.GradientTape() <span style="color: #4f97d7; font-weight: bold;">as</span> tape:
<span style="background-color: #292e34;"> </span>   <span style="background-color: #292e34;"> </span>   <span style="background-color: #292e34;"> </span>   <span style="color: #7590db;">h1</span> = x@w1 + tf.broadcast_to(b1, [x.shape[0], 256])
<span style="background-color: #292e34;"> </span>   <span style="background-color: #292e34;"> </span>   <span style="background-color: #292e34;"> </span>   <span style="color: #7590db;">h1</span> = tf.nn.relu(h1)
<span style="background-color: #292e34;"> </span>   <span style="background-color: #292e34;"> </span>   <span style="background-color: #292e34;"> </span>   <span style="color: #7590db;">h2</span> = h1@w2 + b2
<span style="background-color: #292e34;"> </span>   <span style="background-color: #292e34;"> </span>   <span style="background-color: #292e34;"> </span>   <span style="color: #7590db;">h2</span> = tf.nn.relu(h2)
<span style="background-color: #292e34;"> </span>   <span style="background-color: #292e34;"> </span>   <span style="background-color: #292e34;"> </span>   <span style="color: #7590db;">out</span> = h2@w3 + b3
<span style="background-color: #292e34;"> </span>   <span style="background-color: #292e34;"> </span>   <span style="background-color: #292e34;"> </span>   <span style="color: #7590db;">loss</span> = tf.square(y - out)
<span style="background-color: #292e34;"> </span>   <span style="background-color: #292e34;"> </span>   <span style="background-color: #292e34;"> </span>   <span style="color: #7590db;">loss</span> = tf.reduce_mean(loss)
<span style="background-color: #292e34;"> </span>   <span style="background-color: #292e34;"> </span>   <span style="background-color: #292e34;"> </span>   <span style="color: #7590db;">grads</span> = tape.gradient(loss, [w1,b1,w2,b2,w3,b3])
<span style="background-color: #292e34;"> </span>   <span style="background-color: #292e34;"> </span>   <span style="background-color: #292e34;"> </span>   w1.assign_sub(lr *grads[0])
<span style="background-color: #292e34;"> </span>   <span style="background-color: #292e34;"> </span>   <span style="background-color: #292e34;"> </span>   b1.assign_sub(lr * grads[1])
<span style="background-color: #292e34;"> </span>   <span style="background-color: #292e34;"> </span>   <span style="background-color: #292e34;"> </span>   w2.assign_sub(lr *grads[2])
<span style="background-color: #292e34;"> </span>   <span style="background-color: #292e34;"> </span>   <span style="background-color: #292e34;"> </span>   b2.assign_sub(lr * grads[3])
<span style="background-color: #292e34;"> </span>   <span style="background-color: #292e34;"> </span>   <span style="background-color: #292e34;"> </span>   w3.assign_sub(lr *grads[4])
<span style="background-color: #292e34;"> </span>   <span style="background-color: #292e34;"> </span>   <span style="background-color: #292e34;"> </span>   b3.assign_sub(lr * grads[5])
<span style="color: #4f97d7; font-weight: bold;">for</span> x, y <span style="color: #4f97d7; font-weight: bold;">in</span> test_db:
<span style="background-color: #292e34;"> </span>   <span style="color: #7590db;">h1</span> = x@w1 + b1
<span style="background-color: #292e34;"> </span>   <span style="color: #7590db;">h1</span> = tf.nn.relu(h1)
<span style="background-color: #292e34;"> </span>   <span style="color: #7590db;">h2</span> = h1@w2 + b2
<span style="background-color: #292e34;"> </span>   <span style="color: #7590db;">h2</span> = tf.nn.relu(h2)
<span style="background-color: #292e34;"> </span>   <span style="color: #7590db;">out</span> = h2@w3 + b3
<span style="background-color: #292e34;"> </span>   <span style="color: #7590db;">pred</span> = tf.argmax(out,axis=1)
<span style="background-color: #292e34;"> </span>   <span style="color: #7590db;">y</span> = tf.argmax(y, axis=1)
<span style="background-color: #292e34;"> </span>   <span style="color: #7590db;">correct</span> = tf.equal(pred, y)
<span style="background-color: #292e34;"> </span>   <span style="color: #7590db;">total_correct</span> +=tf.reduce_sum(tf.cast(correct,dty=tf.int32)).numpy()



</pre>
</div>
</div>
</div>
