html/Python.html

<div id="outline-container-orga95bea1" class="outline-3">
<h3 id="orga95bea1"><span class="section-number-3">10.5.</span> Keras</h3>
<div class="outline-text-3" id="text-10-5">
</div>
<div id="outline-container-orgd556147" class="outline-4">
<h4 id="orgd556147"><span class="section-number-4">10.5.1.</span> tf.keras</h4>
<div class="outline-text-4" id="text-10-5-1">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #4f97d7; font-weight: bold;">import</span> tensorflow <span style="color: #4f97d7; font-weight: bold;">as</span> tf
<span style="color: #4f97d7; font-weight: bold;">from</span> tensorflow <span style="color: #4f97d7; font-weight: bold;">import</span> keras
<span style="color: #4f97d7; font-weight: bold;">from</span> tensorflow.keras <span style="color: #4f97d7; font-weight: bold;">import</span> layers

<span style="color: #7590db;">x</span> = tf.constant([2., 1., 0.1])
<span style="color: #4f97d7;">print</span>(tf.keras.layers.Softmax(axis=-1)(x))
<span style="color: #4f97d7;">print</span>(tf.nn.softmax(x))

</pre>
</div>

<p>
tf.keras.Model 是tf.keras.Sequential的父类(网络类）
Sequential类还有方法：
Sequential.compile()
Sequential.fit()
Sequential.predict()
</p>

<p>
tf.keras.layers.Layer 是网络层类的父类（网络层类）
</p>
</div>
</div>

<div id="outline-container-orgb953dd8" class="outline-4">
<h4 id="orgb953dd8"><span class="section-number-4">10.5.2.</span> 模型的保存和加载</h4>
<div class="outline-text-4" id="text-10-5-2">
</div>
<ol class="org-ol">
<li><a id="org80f039a"></a>保存数值<br />
<div class="outline-text-5" id="text-10-5-2-1">
<p>
Sequential.save<sub>weights</sub>('weights.ckpt')
重建了一样的网络后，重新加载
Sequential.load<sub>weights</sub>('weights.ckpt')
</p>
</div>
</li>
<li><a id="orgc3a68cf"></a>保存框架<br />
<div class="outline-text-5" id="text-10-5-2-2">
<p>
tf.keras.Sequential.save('model.h5')
不需要重构模型，可以直接生成保存的模型
network = tf.keras.models.load<sub>model</sub>('model.h5')
</p>
</div>
</li>
<li><a id="orga75c778"></a>跨系统平台保存恢复<br />
<div class="outline-text-5" id="text-10-5-2-3">
<p>
tf.saved<sub>model.save</sub>(network, 'model-savedmodel')
复制，分发该文件后，在跨平台上复现
network = tf.saved<sub>model.load</sub>('model-savedmodel')
</p>
</div>
</li>
</ol>
</div>
<div id="outline-container-orgf858045" class="outline-4">
<h4 id="orgf858045"><span class="section-number-4">10.5.3.</span> self-def</h4>
<div class="outline-text-4" id="text-10-5-3">
<p>
自定义网络层类，继承Layer
自定义网络类，继承Model
</p>
</div>
</div>
</div>

<div id="outline-container-orged73fd1" class="outline-3">
<h3 id="orged73fd1"><span class="section-number-3">10.6.</span> Dropout</h3>
<div class="outline-text-3" id="text-10-6">
<p>
tf.nn.dropout(x, rate = 0.5)
model.add(layers.Dropout(rate=0.5))
</p>
</div>
</div>
<div id="outline-container-org95601ef" class="outline-3">
<h3 id="org95601ef"><span class="section-number-3">10.7.</span> Data Augmentation</h3>
<div class="outline-text-3" id="text-10-7">
</div>
<div id="outline-container-org6482b98" class="outline-4">
<h4 id="org6482b98"><span class="section-number-4">10.7.1.</span> resize</h4>
<div class="outline-text-4" id="text-10-7-1">
<p>
tf.image.resize(x,[244,244])
</p>
</div>
</div>
<div id="outline-container-orgc396477" class="outline-4">
<h4 id="orgc396477"><span class="section-number-4">10.7.2.</span> rote</h4>
<div class="outline-text-4" id="text-10-7-2">
<p>
tf.image.rot90(x,1) k为1时，代表一个90度的g逆时针旋转
</p>
</div>
</div>
<div id="outline-container-orge044106" class="outline-4">
<h4 id="orge044106"><span class="section-number-4">10.7.3.</span> flip</h4>
<div class="outline-text-4" id="text-10-7-3">
<p>
tf.image.random<sub>flip</sub><sub>left</sub><sub>right</sub>(x)
tf.image.random<sub>flip</sub><sub>up</sub><sub>down</sub>(x)
</p>
</div>
</div>
<div id="outline-container-org3731d69" class="outline-4">
<h4 id="org3731d69"><span class="section-number-4">10.7.4.</span> crop</h4>
<div class="outline-text-4" id="text-10-7-4">
<p>
先放大，再剪裁
tf.image.resize(x,[244,244])
tf.image.random<sub>crop</sub>(x,[224,224,3])
</p>
</div>
</div>
</div>
</div>

<div id="outline-container-org1e5a7e3" class="outline-2">
<h2 id="org1e5a7e3"><span class="section-number-2">11.</span> IDE</h2>
<div class="outline-text-2" id="text-11">
</div>
<div id="outline-container-org1b8b6ab" class="outline-3">
<h3 id="org1b8b6ab"><span class="section-number-3">11.1.</span> emacs</h3>
</div>
<div id="outline-container-orgd97ba9d" class="outline-3">
<h3 id="orgd97ba9d"><span class="section-number-3">11.2.</span> Pycharm</h3>
<div class="outline-text-3" id="text-11-2">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">M-1</td>
<td class="org-left">open projects</td>
</tr>

<tr>
<td class="org-left">C-M-c</td>
<td class="org-left">collapse 折叠代码</td>
</tr>

<tr>
<td class="org-left">C-M-e</td>
<td class="org-left">expand  打开代码</td>
</tr>

<tr>
<td class="org-left">C-M-s</td>
<td class="org-left">open Settings</td>
</tr>

<tr>
<td class="org-left">C-S-+</td>
<td class="org-left">increasing fonts</td>
</tr>

<tr>
<td class="org-left">C-S+-</td>
<td class="org-left">decreasing fonts</td>
</tr>

<tr>
<td class="org-left">C-S-0</td>
<td class="org-left">reset fonts</td>
</tr>

<tr>
<td class="org-left">S-Esc</td>
<td class="org-left">close</td>
</tr>

<tr>
<td class="org-left">S-tab</td>
<td class="org-left">open in Emacs</td>
</tr>

<tr>
<td class="org-left">S-Enter</td>
<td class="org-left">execute/run</td>
</tr>

<tr>
<td class="org-left">C-S-i</td>
<td class="org-left">go to define file</td>
</tr>

<tr>
<td class="org-left">C-M-l</td>
<td class="org-left">show line</td>
</tr>

<tr>
<td class="org-left">C-F12</td>
<td class="org-left">close main bar</td>
</tr>

<tr>
<td class="org-left">C-M-x</td>
<td class="org-left">exit</td>
</tr>

<tr>
<td class="org-left">C-A-[]</td>
<td class="org-left">change in between opened projects</td>
</tr>

<tr>
<td class="org-left">C-ins</td>
<td class="org-left">in project add a new file</td>
</tr>

<tr>
<td class="org-left">C-c C-p</td>
<td class="org-left">execute python file</td>
</tr>

<tr>
<td class="org-left">C-c C-o</td>
<td class="org-left">close (python) tab</td>
</tr>

<tr>
<td class="org-left">f11</td>
<td class="org-left">Full screen</td>
</tr>

<tr>
<td class="org-left">A-.</td>
<td class="org-left">open the relate source file</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-org39dc3b1" class="outline-3">
<h3 id="org39dc3b1"><span class="section-number-3">11.3.</span> jupyter</h3>
<div class="outline-text-3" id="text-11-3">
<div class="org-src-container">
<pre class="src src-sh">sudo apt install jupyter
sudo apt install jupyter lab
pip install jupyterthemes
jt -t monokai -f fira -fs 13 -nf ptsans -nfs 11 -N -kl -cursw 5 -cursc r -cellw 95% -T

</pre>
</div>
<p>
Helf -&gt; edit shortcut
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">j</td>
<td class="org-left">next cell</td>
</tr>

<tr>
<td class="org-left">k</td>
<td class="org-left">previous cell</td>
</tr>

<tr>
<td class="org-left">f</td>
<td class="org-left">pull the cell to the top</td>
</tr>

<tr>
<td class="org-left">i</td>
<td class="org-left">intercept cell</td>
</tr>

<tr>
<td class="org-left">c</td>
<td class="org-left">clear results</td>
</tr>

<tr>
<td class="org-left">space</td>
<td class="org-left">next site</td>
</tr>

<tr>
<td class="org-left">ctrl space</td>
<td class="org-left">previous site</td>
</tr>

<tr>
<td class="org-left">ctrl enter</td>
<td class="org-left">execute and to the next cell</td>
</tr>

<tr>
<td class="org-left">C-M-m</td>
<td class="org-left">close mainbar</td>
</tr>

<tr>
<td class="org-left">C-M-n</td>
<td class="org-left">close toolbar</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>

<div id="outline-container-org43629be" class="outline-2">
<h2 id="org43629be"><span class="section-number-2">12.</span> Flask</h2>
<div class="outline-text-2" id="text-12">
<p>
open development and debug mode
</p>
<pre class="example">
export FLASK_APP=app
export FLASK_DEBUG=1
export FLASK_ENV=development
flask run

</pre>
</div>
</div>
